#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Ch000_LayerInterface

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Ch000_LayerInterface.ABP_Ch000_LayerInterface_C.ActionCustom
// 0x0020 (0x0020 - 0x0000)
struct ABP_Ch000_LayerInterface_C_ActionCustom final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ActionCustom_0;                                    // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Ch000_LayerInterface_C_ActionCustom) == 0x000008, "Wrong alignment on ABP_Ch000_LayerInterface_C_ActionCustom");
static_assert(sizeof(ABP_Ch000_LayerInterface_C_ActionCustom) == 0x000020, "Wrong size on ABP_Ch000_LayerInterface_C_ActionCustom");
static_assert(offsetof(ABP_Ch000_LayerInterface_C_ActionCustom, InPose) == 0x000000, "Member 'ABP_Ch000_LayerInterface_C_ActionCustom::InPose' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_LayerInterface_C_ActionCustom, ActionCustom_0) == 0x000010, "Member 'ABP_Ch000_LayerInterface_C_ActionCustom::ActionCustom_0' has a wrong offset!");

// Function ABP_Ch000_LayerInterface.ABP_Ch000_LayerInterface_C.NagaraBlend
// 0x0038 (0x0038 - 0x0000)
struct ABP_Ch000_LayerInterface_C_NagaraBlend final
{
public:
	struct FPoseLink                              LowerBody;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              UpperBody;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         UpperWeights;                                      // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              NagaraBlend_0;                                     // 0x0028(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Ch000_LayerInterface_C_NagaraBlend) == 0x000008, "Wrong alignment on ABP_Ch000_LayerInterface_C_NagaraBlend");
static_assert(sizeof(ABP_Ch000_LayerInterface_C_NagaraBlend) == 0x000038, "Wrong size on ABP_Ch000_LayerInterface_C_NagaraBlend");
static_assert(offsetof(ABP_Ch000_LayerInterface_C_NagaraBlend, LowerBody) == 0x000000, "Member 'ABP_Ch000_LayerInterface_C_NagaraBlend::LowerBody' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_LayerInterface_C_NagaraBlend, UpperBody) == 0x000010, "Member 'ABP_Ch000_LayerInterface_C_NagaraBlend::UpperBody' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_LayerInterface_C_NagaraBlend, UpperWeights) == 0x000020, "Member 'ABP_Ch000_LayerInterface_C_NagaraBlend::UpperWeights' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_LayerInterface_C_NagaraBlend, NagaraBlend_0) == 0x000028, "Member 'ABP_Ch000_LayerInterface_C_NagaraBlend::NagaraBlend_0' has a wrong offset!");

}

