#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Ch000_Extra_00

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonModule_structs.hpp"


namespace SDK::Params
{

// Function ABP_Ch000_Extra_00.ABP_Ch000_Extra_00_C.ExecuteUbergraph_ABP_Ch000_Extra_00
// 0x0078 (0x0078 - 0x0000)
struct ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerDatabaseWork*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BP_GetAvatarBodyPhysique_ReturnValue;     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BP_GetAvatarBodyScale_ReturnValue;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterGame*                         K2Node_DynamicCast_AsCharacter_Game;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECharacterId                                  CallFunc_BP_GetCharacterId_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_1;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsAvatarCharacterId_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterGame*                         K2Node_DynamicCast_AsCharacter_Game_1;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterAvatarComponent*              CallFunc_GetAvatarComponent_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BP_GetAvatarBodyPhysique_ReturnValue_1;   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BP_GetAvatarBodyScale_ReturnValue_1;      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00) == 0x000008, "Wrong alignment on ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00");
static_assert(sizeof(ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00) == 0x000078, "Wrong size on ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00");
static_assert(offsetof(ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00, EntryPoint) == 0x000000, "Member 'ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00, CallFunc_BP_GetAvatarBodyPhysique_ReturnValue) == 0x000010, "Member 'ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00::CallFunc_BP_GetAvatarBodyPhysique_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00, CallFunc_BP_GetAvatarBodyScale_ReturnValue) == 0x000014, "Member 'ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00::CallFunc_BP_GetAvatarBodyScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000018, "Member 'ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00, K2Node_DynamicCast_AsCharacter_Game) == 0x000020, "Member 'ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00::K2Node_DynamicCast_AsCharacter_Game' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00, CallFunc_BP_GetCharacterId_ReturnValue) == 0x000029, "Member 'ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00::CallFunc_BP_GetCharacterId_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00, CallFunc_TryGetPawnOwner_ReturnValue_1) == 0x000030, "Member 'ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00::CallFunc_TryGetPawnOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00, CallFunc_BP_IsAvatarCharacterId_ReturnValue) == 0x000038, "Member 'ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00::CallFunc_BP_IsAvatarCharacterId_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00, K2Node_DynamicCast_AsCharacter_Game_1) == 0x000040, "Member 'ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00::K2Node_DynamicCast_AsCharacter_Game_1' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00, CallFunc_GetAvatarComponent_ReturnValue) == 0x000050, "Member 'ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00::CallFunc_GetAvatarComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00, K2Node_SwitchEnum_CmpSuccess) == 0x000058, "Member 'ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00, CallFunc_BP_GetAvatarBodyPhysique_ReturnValue_1) == 0x00005C, "Member 'ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00::CallFunc_BP_GetAvatarBodyPhysique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00, CallFunc_BP_GetAvatarBodyScale_ReturnValue_1) == 0x000060, "Member 'ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00::CallFunc_BP_GetAvatarBodyScale_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'ABP_Ch000_Extra_00_C_ExecuteUbergraph_ABP_Ch000_Extra_00::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function ABP_Ch000_Extra_00.ABP_Ch000_Extra_00_C.CalcAvatarBoneScale
// 0x0038 (0x0038 - 0x0000)
struct ABP_Ch000_Extra_00_C_CalcAvatarBoneScale final
{
public:
	float                                         BodyScale;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BodyPhysique;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_1;         // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Ch000_Extra_00_C_CalcAvatarBoneScale) == 0x000004, "Wrong alignment on ABP_Ch000_Extra_00_C_CalcAvatarBoneScale");
static_assert(sizeof(ABP_Ch000_Extra_00_C_CalcAvatarBoneScale) == 0x000038, "Wrong size on ABP_Ch000_Extra_00_C_CalcAvatarBoneScale");
static_assert(offsetof(ABP_Ch000_Extra_00_C_CalcAvatarBoneScale, BodyScale) == 0x000000, "Member 'ABP_Ch000_Extra_00_C_CalcAvatarBoneScale::BodyScale' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_CalcAvatarBoneScale, BodyPhysique) == 0x000004, "Member 'ABP_Ch000_Extra_00_C_CalcAvatarBoneScale::BodyPhysique' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_CalcAvatarBoneScale, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000008, "Member 'ABP_Ch000_Extra_00_C_CalcAvatarBoneScale::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_CalcAvatarBoneScale, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'ABP_Ch000_Extra_00_C_CalcAvatarBoneScale::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_CalcAvatarBoneScale, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000010, "Member 'ABP_Ch000_Extra_00_C_CalcAvatarBoneScale::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_CalcAvatarBoneScale, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'ABP_Ch000_Extra_00_C_CalcAvatarBoneScale::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_CalcAvatarBoneScale, CallFunc_Add_FloatFloat_ReturnValue) == 0x000020, "Member 'ABP_Ch000_Extra_00_C_CalcAvatarBoneScale::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_CalcAvatarBoneScale, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000024, "Member 'ABP_Ch000_Extra_00_C_CalcAvatarBoneScale::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_CalcAvatarBoneScale, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000028, "Member 'ABP_Ch000_Extra_00_C_CalcAvatarBoneScale::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_CalcAvatarBoneScale, CallFunc_Conv_FloatToVector_ReturnValue_1) == 0x00002C, "Member 'ABP_Ch000_Extra_00_C_CalcAvatarBoneScale::CallFunc_Conv_FloatToVector_ReturnValue_1' has a wrong offset!");

// Function ABP_Ch000_Extra_00.ABP_Ch000_Extra_00_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABP_Ch000_Extra_00_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Ch000_Extra_00_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Ch000_Extra_00_C_AnimGraph");
static_assert(sizeof(ABP_Ch000_Extra_00_C_AnimGraph) == 0x000020, "Wrong size on ABP_Ch000_Extra_00_C_AnimGraph");
static_assert(offsetof(ABP_Ch000_Extra_00_C_AnimGraph, InPose) == 0x000000, "Member 'ABP_Ch000_Extra_00_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'ABP_Ch000_Extra_00_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Ch000_Extra_00.ABP_Ch000_Extra_00_C.OuterMeshExtensions
// 0x0020 (0x0020 - 0x0000)
struct ABP_Ch000_Extra_00_C_OuterMeshExtensions final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              OuterMeshExtensions_0;                             // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Ch000_Extra_00_C_OuterMeshExtensions) == 0x000008, "Wrong alignment on ABP_Ch000_Extra_00_C_OuterMeshExtensions");
static_assert(sizeof(ABP_Ch000_Extra_00_C_OuterMeshExtensions) == 0x000020, "Wrong size on ABP_Ch000_Extra_00_C_OuterMeshExtensions");
static_assert(offsetof(ABP_Ch000_Extra_00_C_OuterMeshExtensions, InPose) == 0x000000, "Member 'ABP_Ch000_Extra_00_C_OuterMeshExtensions::InPose' has a wrong offset!");
static_assert(offsetof(ABP_Ch000_Extra_00_C_OuterMeshExtensions, OuterMeshExtensions_0) == 0x000010, "Member 'ABP_Ch000_Extra_00_C_OuterMeshExtensions::OuterMeshExtensions_0' has a wrong offset!");

}

