#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Ch000_Extra_00

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CommonModule_structs.hpp"
#include "GameModule_classes.hpp"
#include "AnimBlueprintNodes_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Ch000_Extra_00.ABP_Ch000_Extra_00_C
// 0x1790 (0x1A50 - 0x02C0)
class UABP_Ch000_Extra_00_C final : public UAnimInstancePostProcess
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x02C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x02F8(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0410(0x0030)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0440(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0460(0x0118)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0578(0x0020)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_3;                // 0x0598(0x00F0)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_2;                // 0x0688(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_3;                          // 0x0778(0x00F0)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_1;                // 0x0868(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_2;                          // 0x0958(0x00F0)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier;                  // 0x0A48(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_1;                          // 0x0B38(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x0C28(0x00F0)()
	uint8                                         Pad_D18[0x8];                                      // 0x0D18(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_MuscleEx                     AnimGraphNode_MuscleEx_3;                          // 0x0D20(0x01C0)()
	struct FAnimNode_MuscleEx                     AnimGraphNode_MuscleEx_2;                          // 0x0EE0(0x01C0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x10A0(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1120(0x0108)()
	struct FAnimNode_DynamicRetarget              AnimGraphNode_DynamicRetarget;                     // 0x1228(0x00E8)()
	struct FAnimNode_MuscleEx                     AnimGraphNode_MuscleEx_1;                          // 0x1310(0x01C0)()
	struct FAnimNode_MuscleEx                     AnimGraphNode_MuscleEx;                            // 0x14D0(0x01C0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1690(0x0108)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x1798(0x00B0)()
	uint8                                         Pad_1848[0x8];                                     // 0x1848(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x1850(0x01E0)()
	class UAnimSequence*                          RetargetPose;                                      // 0x1A30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NeckScale;                                         // 0x1A38(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WeistScale;                                        // 0x1A44(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_Ch000_Extra_00(int32 EntryPoint);
	void OnChangedCustomizeAvatarDelegate______0();
	void BlueprintInitializeAnimation();
	void CalcAvatarBoneScale(float BodyScale, float BodyPhysique);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void OuterMeshExtensions(const struct FPoseLink& InPose, struct FPoseLink* OuterMeshExtensions_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Ch000_Extra_00_C">();
	}
	static class UABP_Ch000_Extra_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Ch000_Extra_00_C>();
	}
};
static_assert(alignof(UABP_Ch000_Extra_00_C) == 0x000010, "Wrong alignment on UABP_Ch000_Extra_00_C");
static_assert(sizeof(UABP_Ch000_Extra_00_C) == 0x001A50, "Wrong size on UABP_Ch000_Extra_00_C");
static_assert(offsetof(UABP_Ch000_Extra_00_C, UberGraphFrame) == 0x0002C0, "Member 'UABP_Ch000_Extra_00_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_Root_1) == 0x0002C8, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_LinkedInputPose) == 0x0002F8, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_Root) == 0x000410, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_ComponentToLocalSpace) == 0x000440, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_SubInput) == 0x000460, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_LocalToComponentSpace) == 0x000578, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_RotationMultiplier_3) == 0x000598, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_RotationMultiplier_3' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_RotationMultiplier_2) == 0x000688, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_RotationMultiplier_2' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_CopyBone_3) == 0x000778, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_CopyBone_3' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_RotationMultiplier_1) == 0x000868, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_RotationMultiplier_1' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_CopyBone_2) == 0x000958, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_CopyBone_2' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_RotationMultiplier) == 0x000A48, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_RotationMultiplier' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_CopyBone_1) == 0x000B38, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_CopyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_CopyBone) == 0x000C28, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_CopyBone' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_MuscleEx_3) == 0x000D20, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_MuscleEx_3' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_MuscleEx_2) == 0x000EE0, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_MuscleEx_2' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_SequencePlayer) == 0x0010A0, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_ModifyBone_1) == 0x001120, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_DynamicRetarget) == 0x001228, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_DynamicRetarget' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_MuscleEx_1) == 0x001310, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_MuscleEx_1' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_MuscleEx) == 0x0014D0, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_MuscleEx' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_ModifyBone) == 0x001690, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_LinkedAnimLayer) == 0x001798, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, AnimGraphNode_TwoBoneIK) == 0x001850, "Member 'UABP_Ch000_Extra_00_C::AnimGraphNode_TwoBoneIK' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, RetargetPose) == 0x001A30, "Member 'UABP_Ch000_Extra_00_C::RetargetPose' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, NeckScale) == 0x001A38, "Member 'UABP_Ch000_Extra_00_C::NeckScale' has a wrong offset!");
static_assert(offsetof(UABP_Ch000_Extra_00_C, WeistScale) == 0x001A44, "Member 'UABP_Ch000_Extra_00_C::WeistScale' has a wrong offset!");

}

