#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BackendSubsystem

#include "Basic.hpp"

#include "MasterDataModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum BackendSubsystem.EAutoStartBattleState
// NumValues: 0x0006
enum class EAutoStartBattleState : uint8
{
	Invalid                                  = 0,
	SquadMemberNotComplete                   = 1,
	WaitForSquadMemberJoin                   = 2,
	WaitForAllPlayerReady                    = 3,
	MoveToVisualLobby                        = 4,
	Max                                      = 5,
};

// Enum BackendSubsystem.EGuildJoinRule
// NumValues: 0x0004
enum class EGuildJoinRule : uint8
{
	Invalid                                  = 0,
	None                                     = 1,
	ApprovalRequired                         = 2,
	Max                                      = 3,
};

// Enum BackendSubsystem.EGuildPolicy
// NumValues: 0x0009
enum class EGuildPolicy : uint8
{
	Invalid                                  = 0,
	None                                     = 1,
	EnjoyPlayers                             = 2,
	SeriousPlayers                           = 3,
	BeginnerWelcome                          = 4,
	RewardCollectors                         = 5,
	Team12Battle                             = 6,
	EventPlayers                             = 7,
	Max                                      = 8,
};

// Enum BackendSubsystem.EPresetType
// NumValues: 0x0006
enum class EPresetType : uint8
{
	Invalid                                  = 0,
	Costume                                  = 1,
	Voice                                    = 2,
	Appeal                                   = 3,
	Emblem                                   = 4,
	Max                                      = 5,
};

// Enum BackendSubsystem.EGuildFacility
// NumValues: 0x0005
enum class EGuildFacility : uint8
{
	Invalid                                  = 0,
	Rescue                                   = 1,
	Training                                 = 2,
	Office                                   = 3,
	Max                                      = 4,
};

// Enum BackendSubsystem.EBnIdStatus
// NumValues: 0x0006
enum class EBnIdStatus : uint8
{
	Invalid                                  = 0,
	ELinkable                                = 1,
	ELinked                                  = 2,
	EMaintenance                             = 3,
	EOutOfService                            = 4,
	Max                                      = 5,
};

// Enum BackendSubsystem.EBackendSubsystemPhase
// NumValues: 0x0033
enum class EBackendSubsystemPhase : uint8
{
	Invalid                                  = 0,
	Pause                                    = 1,
	BootUp                                   = 2,
	CosmosInitializing                       = 3,
	CosmosInitialized                        = 4,
	Downloading                              = 5,
	Downloaded                               = 6,
	LoadingMasterDataCache                   = 7,
	LoadedMasterDataCache                    = 8,
	CosmosLoggingIn                          = 9,
	CosmosLoggedIn                           = 10,
	LoadingGallery                           = 11,
	LoadedGallery                            = 12,
	StartLoadCatalog                         = 13,
	LoadingCatalog                           = 14,
	LoadedCatalog                            = 15,
	LoadTrackingNumber                       = 16,
	LoadingTrackingNumber                    = 17,
	LoadedTrackingNumber                     = 18,
	StartLoadPurchaseStatus                  = 19,
	LoadingPurchaseStatus                    = 20,
	LoadedPurchaseStatus                     = 21,
	StartConfirmPurchase                     = 22,
	ConfirmingPurchase                       = 23,
	ConfirmedPurchase                        = 24,
	StartLoadPurchasedItem                   = 25,
	LoadingPurchasedItem                     = 26,
	LoadedPurchasedItem                      = 27,
	CompleteInitialize                       = 28,
	WaitForLogin                             = 29,
	LoggingIn                                = 30,
	StartLoadingServerList                   = 31,
	LoadedServerList                         = 32,
	LoggedIn                                 = 33,
	StartLoadCountryCode                     = 34,
	LoadingCountryCode                       = 35,
	LoadedCountryCode                        = 36,
	CosmosStartUp                            = 37,
	CosmosStartingUp                         = 38,
	CosmosStartedUp                          = 39,
	MatchingConnecting                       = 40,
	MatchingConnected                        = 41,
	LoadingMainMenu                          = 42,
	LoadedMainMenu                           = 43,
	LoadingProfile                           = 44,
	LoadedProfile                            = 45,
	LoadingCharacterSelect                   = 46,
	LoadedCharacterSelect                    = 47,
	Playing                                  = 48,
	Error                                    = 49,
	Max                                      = 50,
};

// Enum BackendSubsystem.ETutorialStepNo
// NumValues: 0x0012
enum class ETutorialStepNo : uint8
{
	Invalid                                  = 0,
	None                                     = 1,
	TutorialStage                            = 2,
	TestPlay                                 = 3,
	InitialSeasonPass                        = 4,
	SetPlayerName                            = 5,
	Mission                                  = 6,
	Rank5                                    = 7,
	OutGame                                  = 8,
	Open1                                    = 9,
	Open2                                    = 10,
	Open3                                    = 11,
	Open4                                    = 12,
	Open5                                    = 13,
	Open6                                    = 14,
	Open7                                    = 15,
	Finished                                 = 16,
	Max                                      = 17,
};

// Enum BackendSubsystem.EFriendListSortOrder
// NumValues: 0x0004
enum class EFriendListSortOrder : uint8
{
	Invalid                                  = 0,
	LastLoginAsc                             = 1,
	LastLoginDesc                            = 2,
	Max                                      = 3,
};

// Enum BackendSubsystem.EGuildMemberSort
// NumValues: 0x000E
enum class EGuildMemberSort : uint8
{
	Invalid                                  = 0,
	JoinDateTimeAsc                          = 1,
	JoinDateTimeDesc                         = 2,
	RankDesc                                 = 3,
	RankAsc                                  = 4,
	LastLoginAsc                             = 5,
	LastLoginDesc                            = 6,
	PointDesc                                = 7,
	PointAsc                                 = 8,
	ScoreDesc                                = 9,
	ScoreAsc                                 = 10,
	LikeDesc                                 = 11,
	LikeAsc                                  = 12,
	Max                                      = 13,
};

// Enum BackendSubsystem.ERankingType
// NumValues: 0x0009
enum class ERankingType : uint8
{
	Invalid                                  = 0,
	BillboardChart                           = 1,
	Mvp                                      = 2,
	GuildTop                                 = 3,
	GuildElite                               = 4,
	Event                                    = 5,
	EventIndividual                          = 6,
	EventGuild                               = 7,
	Max                                      = 8,
};

// Enum BackendSubsystem.EItemCategory
// NumValues: 0x000B
enum class EItemCategory : uint8
{
	Invalid                                  = 0,
	Character                                = 1,
	Currency                                 = 2,
	Emblem                                   = 3,
	CustomizeCostume                         = 4,
	CustomizeAppeal                          = 5,
	CustomizeVoice                           = 6,
	MyAdParts                                = 7,
	Pack                                     = 8,
	Variation                                = 9,
	Max                                      = 10,
};

// Enum BackendSubsystem.EVoiceChatMemberStatus
// NumValues: 0x0008
enum class EVoiceChatMemberStatus : uint8
{
	Invalid                                  = 0,
	EJoined                                  = 1,
	ELeft                                    = 2,
	ETalking                                 = 3,
	EVolume                                  = 4,
	EMuted                                   = 5,
	EUnmuted                                 = 6,
	Max                                      = 7,
};

// Enum BackendSubsystem.EVoiceChatSystemStatus
// NumValues: 0x0006
enum class EVoiceChatSystemStatus : uint8
{
	Invalid                                  = 0,
	EConnected                               = 1,
	EDisconnected                            = 2,
	ELoggedIn                                = 3,
	EJoined                                  = 4,
	Max                                      = 5,
};

// Enum BackendSubsystem.EGuildSearchMemberRange
// NumValues: 0x0007
enum class EGuildSearchMemberRange : uint8
{
	Invalid                                  = 0,
	None                                     = 1,
	Num01_05                                 = 2,
	Num06_10                                 = 3,
	Num11_20                                 = 4,
	OverNum21                                = 5,
	Max                                      = 6,
};

// Enum BackendSubsystem.EGuildSearchLevelRange
// NumValues: 0x0006
enum class EGuildSearchLevelRange : uint8
{
	Invalid                                  = 0,
	None                                     = 1,
	Lv01_10                                  = 2,
	Lv11_30                                  = 3,
	OverLv31                                 = 4,
	Max                                      = 5,
};

// Enum BackendSubsystem.EResultType
// NumValues: 0x0006
enum class EResultType : uint8
{
	Invalid                                  = 0,
	Damage                                   = 1,
	KO                                       = 2,
	Support                                  = 3,
	Citizen                                  = 4,
	Max                                      = 5,
};

// Enum BackendSubsystem.ELikeType
// NumValues: 0x0017
enum class ELikeType : uint8
{
	Invalid                                  = 0,
	Profile                                  = 1,
	InGame                                   = 2,
	LeaderBoardTopDamage                     = 3,
	LeaderBoardTopKo                         = 4,
	LeaderBoardTopSupport                    = 5,
	LeaderBoardTopAssist                     = 6,
	GuildChangeName                          = 7,
	GuildChangeProfile                       = 8,
	GuildOverEliteRanking                    = 9,
	GuildOverTopRanking                      = 10,
	GuildDonate                              = 11,
	GuildBuy                                 = 12,
	GuildNewMember                           = 13,
	GuildStreakWins                          = 14,
	GuildDonateRescue                        = 15,
	GuildDonateTraining                      = 16,
	GuildDonateOffice                        = 17,
	NpcRescue                                = 18,
	NpcRaid                                  = 19,
	NpcKotaRescue                            = 20,
	NpcKotaRaid                              = 21,
	Max                                      = 22,
};

// Enum BackendSubsystem.EKpiLevel
// NumValues: 0x0019
enum class EKpiLevel : uint8
{
	Title                                    = 0,
	Eula                                     = 1,
	MainMenu                                 = 2,
	TeamUp                                   = 3,
	SearchTeam                               = 4,
	BattleReady                              = 5,
	VisualLobby                              = 6,
	RankMatchTeamUp                          = 7,
	Tutorial                                 = 8,
	Watch                                    = 9,
	Result                                   = 10,
	Equipment                                = 11,
	MyAd                                     = 12,
	PickupPlayer                             = 13,
	Avatar                                   = 14,
	Shop                                     = 15,
	Gasha                                    = 16,
	SeasonPass                               = 17,
	Profile                                  = 18,
	Gallery                                  = 19,
	Ranking                                  = 20,
	Guild                                    = 21,
	Config                                   = 22,
	Mission                                  = 23,
	Max                                      = 24,
};

// Enum BackendSubsystem.EGuildActivity
// NumValues: 0x000D
enum class EGuildActivity : uint8
{
	Invalid                                  = 0,
	ChangeName                               = 1,
	ChangeProfile                            = 2,
	OverEliteRanking                         = 3,
	OverTopRanking                           = 4,
	RescueFacilityDonate                     = 5,
	TrainingFacilityDonate                   = 6,
	OfficeFacilityDonate                     = 7,
	GuildLevelUp                             = 8,
	UseBoost                                 = 9,
	NewMember                                = 10,
	StreakWins                               = 11,
	Max                                      = 12,
};

// Enum BackendSubsystem.EGuildPosition
// NumValues: 0x0005
enum class EGuildPosition : uint8
{
	Invalid                                  = 0,
	Member                                   = 1,
	Leader                                   = 2,
	SubLeader                                = 3,
	Max                                      = 4,
};

// Enum BackendSubsystem.ENetScore
// NumValues: 0x0009
enum class ENetScore : uint8
{
	Invalid                                  = 0,
	Level_1                                  = 1,
	Level_2                                  = 2,
	Level_3                                  = 3,
	Level_4                                  = 4,
	Level_5                                  = 5,
	Level_6                                  = 6,
	Level_7                                  = 7,
	Max                                      = 8,
};

// Enum BackendSubsystem.ERankingLeagueChange
// NumValues: 0x0006
enum class ERankingLeagueChange : uint8
{
	Invalid                                  = 0,
	None                                     = 1,
	Promotion                                = 2,
	Demotion                                 = 3,
	Keep                                     = 4,
	Max                                      = 5,
};

// Enum BackendSubsystem.EMissionAchievementStatus
// NumValues: 0x0005
enum class EMissionAchievementStatus : uint8
{
	Invalid                                  = 0,
	None                                     = 1,
	Finished                                 = 2,
	Received                                 = 3,
	Max                                      = 4,
};

// Enum BackendSubsystem.EItemListSortOrder
// NumValues: 0x0008
enum class EItemListSortOrder : uint8
{
	Invalid                                  = 0,
	ReceiveNew                               = 1,
	ReceiveOld                               = 2,
	ExpireClose                              = 3,
	ExpireFar                                = 4,
	NameAsc                                  = 5,
	NameDesc                                 = 6,
	Max                                      = 7,
};

// Enum BackendSubsystem.EFriendListTypeWithSort
// NumValues: 0x0016
enum class EFriendListTypeWithSort : uint8
{
	Invalid                                  = 0,
	FriendAsc                                = 1,
	FriendDesc                               = 2,
	ApplyingAsc                              = 3,
	ApplyingDesc                             = 4,
	AppliedAsc                               = 5,
	AppliedDesc                              = 6,
	GuildMemberAsc                           = 7,
	GuildMemberDesc                          = 8,
	LatelyPlayedAsc                          = 9,
	LatelyPlayedDesc                         = 10,
	PlatformFriendAsc                        = 11,
	PlatformFriendDesc                       = 12,
	SearchAsc                                = 13,
	SearchDesc                               = 14,
	GuildInviteFriendAsc                     = 15,
	GuildInviteFriendDesc                    = 16,
	GuildInviteLatelyPlayedAsc               = 17,
	GuildInviteLatelyPlayedDesc              = 18,
	GuildInvitePlatformFriendAsc             = 19,
	GuildInvitePlatformFriendDesc            = 20,
	Max                                      = 21,
};

// Enum BackendSubsystem.EFriendListType
// NumValues: 0x000D
enum class EFriendListType : uint8
{
	Invalid                                  = 0,
	Friend                                   = 1,
	Applying                                 = 2,
	Applied                                  = 3,
	GuildMember                              = 4,
	LatelyPlayed                             = 5,
	PlatformFriend                           = 6,
	Search                                   = 7,
	All                                      = 8,
	GuildInviteFriend                        = 9,
	GuildInviteLatelyPlayed                  = 10,
	GuildInvitePlatformFriend                = 11,
	Max                                      = 12,
};

// Enum BackendSubsystem.EFriendStatus
// NumValues: 0x0008
enum class EFriendStatus : uint8
{
	Invalid                                  = 0,
	None                                     = 1,
	Applying                                 = 2,
	Applied                                  = 3,
	Friend                                   = 4,
	All                                      = 5,
	NotMember                                = 6,
	Max                                      = 7,
};

// Enum BackendSubsystem.EMyAdDeliveryStatus
// NumValues: 0x0004
enum class EMyAdDeliveryStatus : uint8
{
	Invalid                                  = 0,
	NoDelivery                               = 1,
	Delivered                                = 2,
	Max                                      = 3,
};

// Enum BackendSubsystem.EBuyCustomizeStatus
// NumValues: 0x0007
enum class EBuyCustomizeStatus : uint8
{
	Invalid                                  = 0,
	Available                                = 1,
	Possessed                                = 2,
	NotForSale                               = 3,
	ReqNormalColor                           = 4,
	NotEnoughMoney                           = 5,
	Max                                      = 6,
};

// Enum BackendSubsystem.ETutorialOpenFeature
// NumValues: 0x0009
enum class ETutorialOpenFeature : uint8
{
	Invalid                                  = 0,
	Customize                                = 1,
	Shop                                     = 2,
	Gasha                                    = 3,
	Friend                                   = 4,
	SquadMatch                               = 5,
	Squad                                    = 6,
	Chat                                     = 7,
	Max                                      = 8,
};

// Enum BackendSubsystem.EInviteType
// NumValues: 0x0005
enum class EInviteType : uint8
{
	Invalid                                  = 0,
	Squad                                    = 1,
	Guild                                    = 2,
	Friend                                   = 3,
	Max                                      = 4,
};

// Enum BackendSubsystem.ENoticeReceiveMode
// NumValues: 0x0006
enum class ENoticeReceiveMode : uint8
{
	Invalid                                  = 0,
	ReceiveSingle                            = 1,
	ReceiveAll                               = 2,
	DeleteRead                               = 3,
	DeleteSingle                             = 4,
	Max                                      = 5,
};

// Enum BackendSubsystem.ENoticeCategory
// NumValues: 0x0005
enum class ENoticeCategory : uint8
{
	Invalid                                  = 0,
	None                                     = 1,
	Information                              = 2,
	Invitation                               = 3,
	Max                                      = 4,
};

// Enum BackendSubsystem.ETitleCodeRegion
// NumValues: 0x0005
enum class ETitleCodeRegion : uint8
{
	JP                                       = 0,
	US                                       = 1,
	EU                                       = 2,
	ASIA                                     = 3,
	ETitleCodeRegion_MAX                     = 4,
};

// Enum BackendSubsystem.EWebApiCacheType
// NumValues: 0x0006
enum class EWebApiCacheType : uint8
{
	NoCache                                  = 0,
	NoClear                                  = 1,
	UpdateClear                              = 2,
	TimerClear                               = 3,
	UpdateOrTimerClear                       = 4,
	EWebApiCacheType_MAX                     = 5,
};

// Enum BackendSubsystem.EWebApiCacheKey
// NumValues: 0x0024
enum class EWebApiCacheKey : uint8
{
	NoCache                                  = 0,
	LoadMainMenu                             = 1,
	LoadCharacterSelect                      = 2,
	LoadProfile                              = 3,
	LoadBillboardChart                       = 4,
	LoadBattleRecord                         = 5,
	LoadCustomizeCostume                     = 6,
	LoadCustomizeVoice                       = 7,
	LoadCustomizeAppeal                      = 8,
	LoadCustomizeEmblem                      = 9,
	LoadCustomizeVariation                   = 10,
	LoadCustomizePreset                      = 11,
	LoadAdList                               = 12,
	LoadAvatar                               = 13,
	LoadShop                                 = 14,
	LoadLottery                              = 15,
	LoadLotteryRate                          = 16,
	LoadLotteryHistory                       = 17,
	LoadLotteryMileageInfo                   = 18,
	LoadMission                              = 19,
	LoadFriends                              = 20,
	SearchPlayers                            = 21,
	LoadInventory                            = 22,
	LoadSquadReceivedInvitation              = 23,
	LoadSquadSentInvitation                  = 24,
	LoadGuildInfo                            = 25,
	LoadGuildRecordList                      = 26,
	LoadRanking                              = 27,
	LoadGallery                              = 28,
	LoadSetting                              = 29,
	LoadLicense                              = 30,
	LoadSeasonPass                           = 31,
	LoadSpecialLicense                       = 32,
	LoadEvent                                = 33,
	LoadCustomMatchResult                    = 34,
	EWebApiCacheKey_MAX                      = 35,
};

// ScriptStruct BackendSubsystem.WebApiArg
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FWebApiArg final
{
public:
	uint8                                         Pad_0[0x38];                                       // 0x0000(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FWebApiArg) == 0x000008, "Wrong alignment on FWebApiArg");
static_assert(sizeof(FWebApiArg) == 0x000038, "Wrong size on FWebApiArg");

// ScriptStruct BackendSubsystem.ResultData
// 0x0078 (0x0078 - 0x0000)
struct FResultData final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Exp;                                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RankPoint;                                         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SeasonPassPoint;                                   // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Coin;                                              // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GuildPoint;                                        // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LiveTimeSecond;                                    // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Rank;                                              // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWin;                                              // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         bLive;                                             // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Damage;                                            // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KillCount;                                         // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DeathCount;                                        // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KillAssistCount;                                   // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HealAssistCount;                                   // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CoopActionCount;                                   // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Point;                                             // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RescueCount;                                       // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BrokeCount;                                        // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LevelUpCount;                                      // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PickedItemCount;                                   // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ItemSupportCount;                                  // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssaultCount;                                      // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 ScoreTableCodeList;                                // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FResultData) == 0x000008, "Wrong alignment on FResultData");
static_assert(sizeof(FResultData) == 0x000078, "Wrong size on FResultData");
static_assert(offsetof(FResultData, PlayerId) == 0x000000, "Member 'FResultData::PlayerId' has a wrong offset!");
static_assert(offsetof(FResultData, Exp) == 0x000010, "Member 'FResultData::Exp' has a wrong offset!");
static_assert(offsetof(FResultData, RankPoint) == 0x000014, "Member 'FResultData::RankPoint' has a wrong offset!");
static_assert(offsetof(FResultData, SeasonPassPoint) == 0x000018, "Member 'FResultData::SeasonPassPoint' has a wrong offset!");
static_assert(offsetof(FResultData, Coin) == 0x00001C, "Member 'FResultData::Coin' has a wrong offset!");
static_assert(offsetof(FResultData, GuildPoint) == 0x000020, "Member 'FResultData::GuildPoint' has a wrong offset!");
static_assert(offsetof(FResultData, LiveTimeSecond) == 0x000024, "Member 'FResultData::LiveTimeSecond' has a wrong offset!");
static_assert(offsetof(FResultData, Rank) == 0x000028, "Member 'FResultData::Rank' has a wrong offset!");
static_assert(offsetof(FResultData, bWin) == 0x00002C, "Member 'FResultData::bWin' has a wrong offset!");
static_assert(offsetof(FResultData, bLive) == 0x000030, "Member 'FResultData::bLive' has a wrong offset!");
static_assert(offsetof(FResultData, Damage) == 0x000034, "Member 'FResultData::Damage' has a wrong offset!");
static_assert(offsetof(FResultData, KillCount) == 0x000038, "Member 'FResultData::KillCount' has a wrong offset!");
static_assert(offsetof(FResultData, DeathCount) == 0x00003C, "Member 'FResultData::DeathCount' has a wrong offset!");
static_assert(offsetof(FResultData, KillAssistCount) == 0x000040, "Member 'FResultData::KillAssistCount' has a wrong offset!");
static_assert(offsetof(FResultData, HealAssistCount) == 0x000044, "Member 'FResultData::HealAssistCount' has a wrong offset!");
static_assert(offsetof(FResultData, CoopActionCount) == 0x000048, "Member 'FResultData::CoopActionCount' has a wrong offset!");
static_assert(offsetof(FResultData, Point) == 0x00004C, "Member 'FResultData::Point' has a wrong offset!");
static_assert(offsetof(FResultData, RescueCount) == 0x000050, "Member 'FResultData::RescueCount' has a wrong offset!");
static_assert(offsetof(FResultData, BrokeCount) == 0x000054, "Member 'FResultData::BrokeCount' has a wrong offset!");
static_assert(offsetof(FResultData, LevelUpCount) == 0x000058, "Member 'FResultData::LevelUpCount' has a wrong offset!");
static_assert(offsetof(FResultData, PickedItemCount) == 0x00005C, "Member 'FResultData::PickedItemCount' has a wrong offset!");
static_assert(offsetof(FResultData, ItemSupportCount) == 0x000060, "Member 'FResultData::ItemSupportCount' has a wrong offset!");
static_assert(offsetof(FResultData, AssaultCount) == 0x000064, "Member 'FResultData::AssaultCount' has a wrong offset!");
static_assert(offsetof(FResultData, ScoreTableCodeList) == 0x000068, "Member 'FResultData::ScoreTableCodeList' has a wrong offset!");

// ScriptStruct BackendSubsystem.DbPackItemParam
// 0x03E0 (0x03E0 - 0x0000)
struct FDbPackItemParam final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EItemCategory                                 ECategory;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMasterDataCharacter                   Character;                                         // 0x0010(0x00A8)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FMasterDataCurrency                    Currency;                                          // 0x00B8(0x0068)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FMasterDataEmblem                      Emblem;                                            // 0x0120(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FMasterDataCustomizeCostume            CustomizeCostume;                                  // 0x0170(0x00A0)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FMasterDataCustomizeEmote              CustomizeEmote;                                    // 0x0210(0x0078)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FMasterDataCustomizeVoice              CustomizeVoice;                                    // 0x0288(0x0080)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FMasterDataMyAdParts                   MyAdParts;                                         // 0x0308(0x0048)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         Code;                                              // 0x0350(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           Name;                                              // 0x0358(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0368(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FString                                 AssetName;                                         // 0x0380(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ObtainFrom;                                        // 0x0390(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   DisplayName;                                       // 0x03A8(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   MultilineDisplayName;                              // 0x03C0(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         Quantity;                                          // 0x03D8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDbPackItemParam) == 0x000008, "Wrong alignment on FDbPackItemParam");
static_assert(sizeof(FDbPackItemParam) == 0x0003E0, "Wrong size on FDbPackItemParam");
static_assert(offsetof(FDbPackItemParam, ECategory) == 0x000008, "Member 'FDbPackItemParam::ECategory' has a wrong offset!");
static_assert(offsetof(FDbPackItemParam, Character) == 0x000010, "Member 'FDbPackItemParam::Character' has a wrong offset!");
static_assert(offsetof(FDbPackItemParam, Currency) == 0x0000B8, "Member 'FDbPackItemParam::Currency' has a wrong offset!");
static_assert(offsetof(FDbPackItemParam, Emblem) == 0x000120, "Member 'FDbPackItemParam::Emblem' has a wrong offset!");
static_assert(offsetof(FDbPackItemParam, CustomizeCostume) == 0x000170, "Member 'FDbPackItemParam::CustomizeCostume' has a wrong offset!");
static_assert(offsetof(FDbPackItemParam, CustomizeEmote) == 0x000210, "Member 'FDbPackItemParam::CustomizeEmote' has a wrong offset!");
static_assert(offsetof(FDbPackItemParam, CustomizeVoice) == 0x000288, "Member 'FDbPackItemParam::CustomizeVoice' has a wrong offset!");
static_assert(offsetof(FDbPackItemParam, MyAdParts) == 0x000308, "Member 'FDbPackItemParam::MyAdParts' has a wrong offset!");
static_assert(offsetof(FDbPackItemParam, Code) == 0x000350, "Member 'FDbPackItemParam::Code' has a wrong offset!");
static_assert(offsetof(FDbPackItemParam, Name) == 0x000358, "Member 'FDbPackItemParam::Name' has a wrong offset!");
static_assert(offsetof(FDbPackItemParam, Description) == 0x000368, "Member 'FDbPackItemParam::Description' has a wrong offset!");
static_assert(offsetof(FDbPackItemParam, AssetName) == 0x000380, "Member 'FDbPackItemParam::AssetName' has a wrong offset!");
static_assert(offsetof(FDbPackItemParam, ObtainFrom) == 0x000390, "Member 'FDbPackItemParam::ObtainFrom' has a wrong offset!");
static_assert(offsetof(FDbPackItemParam, DisplayName) == 0x0003A8, "Member 'FDbPackItemParam::DisplayName' has a wrong offset!");
static_assert(offsetof(FDbPackItemParam, MultilineDisplayName) == 0x0003C0, "Member 'FDbPackItemParam::MultilineDisplayName' has a wrong offset!");
static_assert(offsetof(FDbPackItemParam, Quantity) == 0x0003D8, "Member 'FDbPackItemParam::Quantity' has a wrong offset!");

// ScriptStruct BackendSubsystem.DbItemCategoryParam
// 0x0488 (0x0488 - 0x0000)
struct FDbItemCategoryParam
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EItemCategory                                 ECategory;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMasterDataCharacter                   Character;                                         // 0x0010(0x00A8)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FMasterDataCurrency                    Currency;                                          // 0x00B8(0x0068)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FMasterDataEmblem                      Emblem;                                            // 0x0120(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FMasterDataCustomizeCostume            CustomizeCostume;                                  // 0x0170(0x00A0)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FMasterDataCustomizeEmote              CustomizeEmote;                                    // 0x0210(0x0078)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FMasterDataCustomizeVoice              CustomizeVoice;                                    // 0x0288(0x0080)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FMasterDataMyAdParts                   MyAdParts;                                         // 0x0308(0x0048)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FMasterDataPack                        Pack;                                              // 0x0350(0x0048)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FDbPackItemParam>               PackItems;                                         // 0x0398(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FMasterDataVariation                   Variation;                                         // 0x03A8(0x0058)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         Code;                                              // 0x0400(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           Name;                                              // 0x0408(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0418(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FString                                 AssetName;                                         // 0x0430(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ObtainFrom;                                        // 0x0440(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   DisplayName;                                       // 0x0458(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   MultilineDisplayName;                              // 0x0470(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDbItemCategoryParam) == 0x000008, "Wrong alignment on FDbItemCategoryParam");
static_assert(sizeof(FDbItemCategoryParam) == 0x000488, "Wrong size on FDbItemCategoryParam");
static_assert(offsetof(FDbItemCategoryParam, ECategory) == 0x000008, "Member 'FDbItemCategoryParam::ECategory' has a wrong offset!");
static_assert(offsetof(FDbItemCategoryParam, Character) == 0x000010, "Member 'FDbItemCategoryParam::Character' has a wrong offset!");
static_assert(offsetof(FDbItemCategoryParam, Currency) == 0x0000B8, "Member 'FDbItemCategoryParam::Currency' has a wrong offset!");
static_assert(offsetof(FDbItemCategoryParam, Emblem) == 0x000120, "Member 'FDbItemCategoryParam::Emblem' has a wrong offset!");
static_assert(offsetof(FDbItemCategoryParam, CustomizeCostume) == 0x000170, "Member 'FDbItemCategoryParam::CustomizeCostume' has a wrong offset!");
static_assert(offsetof(FDbItemCategoryParam, CustomizeEmote) == 0x000210, "Member 'FDbItemCategoryParam::CustomizeEmote' has a wrong offset!");
static_assert(offsetof(FDbItemCategoryParam, CustomizeVoice) == 0x000288, "Member 'FDbItemCategoryParam::CustomizeVoice' has a wrong offset!");
static_assert(offsetof(FDbItemCategoryParam, MyAdParts) == 0x000308, "Member 'FDbItemCategoryParam::MyAdParts' has a wrong offset!");
static_assert(offsetof(FDbItemCategoryParam, Pack) == 0x000350, "Member 'FDbItemCategoryParam::Pack' has a wrong offset!");
static_assert(offsetof(FDbItemCategoryParam, PackItems) == 0x000398, "Member 'FDbItemCategoryParam::PackItems' has a wrong offset!");
static_assert(offsetof(FDbItemCategoryParam, Variation) == 0x0003A8, "Member 'FDbItemCategoryParam::Variation' has a wrong offset!");
static_assert(offsetof(FDbItemCategoryParam, Code) == 0x000400, "Member 'FDbItemCategoryParam::Code' has a wrong offset!");
static_assert(offsetof(FDbItemCategoryParam, Name) == 0x000408, "Member 'FDbItemCategoryParam::Name' has a wrong offset!");
static_assert(offsetof(FDbItemCategoryParam, Description) == 0x000418, "Member 'FDbItemCategoryParam::Description' has a wrong offset!");
static_assert(offsetof(FDbItemCategoryParam, AssetName) == 0x000430, "Member 'FDbItemCategoryParam::AssetName' has a wrong offset!");
static_assert(offsetof(FDbItemCategoryParam, ObtainFrom) == 0x000440, "Member 'FDbItemCategoryParam::ObtainFrom' has a wrong offset!");
static_assert(offsetof(FDbItemCategoryParam, DisplayName) == 0x000458, "Member 'FDbItemCategoryParam::DisplayName' has a wrong offset!");
static_assert(offsetof(FDbItemCategoryParam, MultilineDisplayName) == 0x000470, "Member 'FDbItemCategoryParam::MultilineDisplayName' has a wrong offset!");

// ScriptStruct BackendSubsystem.DbMileageItem
// 0x0018 (0x04A0 - 0x0488)
struct FDbMileageItem final : public FDbItemCategoryParam
{
public:
	class FString                                 ExchangeItemId;                                    // 0x0488(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Quantity;                                          // 0x0498(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDbMileageItem) == 0x000008, "Wrong alignment on FDbMileageItem");
static_assert(sizeof(FDbMileageItem) == 0x0004A0, "Wrong size on FDbMileageItem");
static_assert(offsetof(FDbMileageItem, ExchangeItemId) == 0x000488, "Member 'FDbMileageItem::ExchangeItemId' has a wrong offset!");
static_assert(offsetof(FDbMileageItem, Quantity) == 0x000498, "Member 'FDbMileageItem::Quantity' has a wrong offset!");

// ScriptStruct BackendSubsystem.DbGuildMemberParam
// 0x0098 (0x0098 - 0x0000)
struct FDbGuildMemberParam final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PlayerId;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlatformPlayerId;                                  // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlayerName;                                        // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ContributePoint;                                   // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BestContributePoint;                               // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LikeCount;                                         // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMasterDataRankExp                     Rank;                                              // 0x0048(0x0038)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	EGuildPosition                                EPosition;                                         // 0x0080(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNew;                                              // 0x0081(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              LastLoginAt;                                       // 0x0088(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMySelf;                                           // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnline;                                           // 0x0091(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlatformBlock;                                    // 0x0092(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDbGuildMemberParam) == 0x000008, "Wrong alignment on FDbGuildMemberParam");
static_assert(sizeof(FDbGuildMemberParam) == 0x000098, "Wrong size on FDbGuildMemberParam");
static_assert(offsetof(FDbGuildMemberParam, PlayerId) == 0x000008, "Member 'FDbGuildMemberParam::PlayerId' has a wrong offset!");
static_assert(offsetof(FDbGuildMemberParam, PlatformPlayerId) == 0x000018, "Member 'FDbGuildMemberParam::PlatformPlayerId' has a wrong offset!");
static_assert(offsetof(FDbGuildMemberParam, PlayerName) == 0x000028, "Member 'FDbGuildMemberParam::PlayerName' has a wrong offset!");
static_assert(offsetof(FDbGuildMemberParam, ContributePoint) == 0x000038, "Member 'FDbGuildMemberParam::ContributePoint' has a wrong offset!");
static_assert(offsetof(FDbGuildMemberParam, BestContributePoint) == 0x00003C, "Member 'FDbGuildMemberParam::BestContributePoint' has a wrong offset!");
static_assert(offsetof(FDbGuildMemberParam, LikeCount) == 0x000040, "Member 'FDbGuildMemberParam::LikeCount' has a wrong offset!");
static_assert(offsetof(FDbGuildMemberParam, Rank) == 0x000048, "Member 'FDbGuildMemberParam::Rank' has a wrong offset!");
static_assert(offsetof(FDbGuildMemberParam, EPosition) == 0x000080, "Member 'FDbGuildMemberParam::EPosition' has a wrong offset!");
static_assert(offsetof(FDbGuildMemberParam, bNew) == 0x000081, "Member 'FDbGuildMemberParam::bNew' has a wrong offset!");
static_assert(offsetof(FDbGuildMemberParam, LastLoginAt) == 0x000088, "Member 'FDbGuildMemberParam::LastLoginAt' has a wrong offset!");
static_assert(offsetof(FDbGuildMemberParam, bMySelf) == 0x000090, "Member 'FDbGuildMemberParam::bMySelf' has a wrong offset!");
static_assert(offsetof(FDbGuildMemberParam, bOnline) == 0x000091, "Member 'FDbGuildMemberParam::bOnline' has a wrong offset!");
static_assert(offsetof(FDbGuildMemberParam, bPlatformBlock) == 0x000092, "Member 'FDbGuildMemberParam::bPlatformBlock' has a wrong offset!");

// ScriptStruct BackendSubsystem.DbsCustomizeItemParam
// 0x0008 (0x0490 - 0x0488)
struct FDbsCustomizeItemParam : public FDbItemCategoryParam
{
public:
	uint8                                         Pad_488[0x1];                                      // 0x0488(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUnlocked;                                         // 0x0489(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEquipped;                                         // 0x048A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFavorite;                                         // 0x048B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBuyCustomizeStatus                           EBuyStatus;                                        // 0x048C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48D[0x3];                                      // 0x048D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDbsCustomizeItemParam) == 0x000008, "Wrong alignment on FDbsCustomizeItemParam");
static_assert(sizeof(FDbsCustomizeItemParam) == 0x000490, "Wrong size on FDbsCustomizeItemParam");
static_assert(offsetof(FDbsCustomizeItemParam, bUnlocked) == 0x000489, "Member 'FDbsCustomizeItemParam::bUnlocked' has a wrong offset!");
static_assert(offsetof(FDbsCustomizeItemParam, bEquipped) == 0x00048A, "Member 'FDbsCustomizeItemParam::bEquipped' has a wrong offset!");
static_assert(offsetof(FDbsCustomizeItemParam, bFavorite) == 0x00048B, "Member 'FDbsCustomizeItemParam::bFavorite' has a wrong offset!");
static_assert(offsetof(FDbsCustomizeItemParam, EBuyStatus) == 0x00048C, "Member 'FDbsCustomizeItemParam::EBuyStatus' has a wrong offset!");

// ScriptStruct BackendSubsystem.CatalogIdPs4
// 0x0020 (0x0020 - 0x0000)
struct FCatalogIdPs4 final
{
public:
	class FString                                 ProductLabel;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SkuLabel;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCatalogIdPs4) == 0x000008, "Wrong alignment on FCatalogIdPs4");
static_assert(sizeof(FCatalogIdPs4) == 0x000020, "Wrong size on FCatalogIdPs4");
static_assert(offsetof(FCatalogIdPs4, ProductLabel) == 0x000000, "Member 'FCatalogIdPs4::ProductLabel' has a wrong offset!");
static_assert(offsetof(FCatalogIdPs4, SkuLabel) == 0x000010, "Member 'FCatalogIdPs4::SkuLabel' has a wrong offset!");

// ScriptStruct BackendSubsystem.KpiBattleLog
// 0x0288 (0x0288 - 0x0000)
struct FKpiBattleLog final
{
public:
	class FString                                 StartMatchData;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EndMatchDate;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KOScore;                                           // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KOAssistScore;                                     // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DamageScore;                                       // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SurvivalTime;                                      // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CharacterCode;                                     // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VariationCode;                                     // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CostumeCode;                                       // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AuraId;                                            // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AuraVisibleInBattle;                               // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MatchingTime;                                      // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x58];                                      // 0x0058(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FirstUniqueActionId;                               // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FirstUniqueActionCount;                            // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SecondUniqueActionId;                              // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SecondUniqueActionCount;                           // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x14];                                      // 0x00C0(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ViewingTime;                                       // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
