#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BackendSubsystem

#include "Basic.hpp"

#include "BackendSubsystem_structs.hpp"
#include "MasterDataModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "VoiceChatModule_structs.hpp"


namespace SDK::Params
{

// Function BackendSubsystem.BackendSubsystem.AcceptFriendship
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_AcceptFriendship final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BackendSubsystem_AcceptFriendship) == 0x000008, "Wrong alignment on BackendSubsystem_AcceptFriendship");
static_assert(sizeof(BackendSubsystem_AcceptFriendship) == 0x000018, "Wrong size on BackendSubsystem_AcceptFriendship");
static_assert(offsetof(BackendSubsystem_AcceptFriendship, PlayerId) == 0x000000, "Member 'BackendSubsystem_AcceptFriendship::PlayerId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_AcceptFriendship, ReturnValue) == 0x000010, "Member 'BackendSubsystem_AcceptFriendship::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.AcceptFriendshipImpl
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_AcceptFriendshipImpl final
{
public:
	int32                                         RequestId;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWebApiArg>                     Args;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_AcceptFriendshipImpl) == 0x000008, "Wrong alignment on BackendSubsystem_AcceptFriendshipImpl");
static_assert(sizeof(BackendSubsystem_AcceptFriendshipImpl) == 0x000018, "Wrong size on BackendSubsystem_AcceptFriendshipImpl");
static_assert(offsetof(BackendSubsystem_AcceptFriendshipImpl, RequestId) == 0x000000, "Member 'BackendSubsystem_AcceptFriendshipImpl::RequestId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_AcceptFriendshipImpl, Args) == 0x000008, "Member 'BackendSubsystem_AcceptFriendshipImpl::Args' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.AcceptGuild
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_AcceptGuild final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BackendSubsystem_AcceptGuild) == 0x000008, "Wrong alignment on BackendSubsystem_AcceptGuild");
static_assert(sizeof(BackendSubsystem_AcceptGuild) == 0x000018, "Wrong size on BackendSubsystem_AcceptGuild");
static_assert(offsetof(BackendSubsystem_AcceptGuild, PlayerId) == 0x000000, "Member 'BackendSubsystem_AcceptGuild::PlayerId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_AcceptGuild, ReturnValue) == 0x000010, "Member 'BackendSubsystem_AcceptGuild::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.AcceptGuildImpl
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_AcceptGuildImpl final
{
public:
	int32                                         RequestId;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWebApiArg>                     Args;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_AcceptGuildImpl) == 0x000008, "Wrong alignment on BackendSubsystem_AcceptGuildImpl");
static_assert(sizeof(BackendSubsystem_AcceptGuildImpl) == 0x000018, "Wrong size on BackendSubsystem_AcceptGuildImpl");
static_assert(offsetof(BackendSubsystem_AcceptGuildImpl, RequestId) == 0x000000, "Member 'BackendSubsystem_AcceptGuildImpl::RequestId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_AcceptGuildImpl, Args) == 0x000008, "Member 'BackendSubsystem_AcceptGuildImpl::Args' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.AcceptGuildInvitation
// 0x0038 (0x0038 - 0x0000)
struct BackendSubsystem_AcceptGuildInvitation final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GuildId;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NoticeId;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BackendSubsystem_AcceptGuildInvitation) == 0x000008, "Wrong alignment on BackendSubsystem_AcceptGuildInvitation");
static_assert(sizeof(BackendSubsystem_AcceptGuildInvitation) == 0x000038, "Wrong size on BackendSubsystem_AcceptGuildInvitation");
static_assert(offsetof(BackendSubsystem_AcceptGuildInvitation, PlayerId) == 0x000000, "Member 'BackendSubsystem_AcceptGuildInvitation::PlayerId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_AcceptGuildInvitation, GuildId) == 0x000010, "Member 'BackendSubsystem_AcceptGuildInvitation::GuildId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_AcceptGuildInvitation, NoticeId) == 0x000020, "Member 'BackendSubsystem_AcceptGuildInvitation::NoticeId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_AcceptGuildInvitation, ReturnValue) == 0x000030, "Member 'BackendSubsystem_AcceptGuildInvitation::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.AcceptGuildInvitationImpl
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_AcceptGuildInvitationImpl final
{
public:
	int32                                         RequestId;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWebApiArg>                     Args;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_AcceptGuildInvitationImpl) == 0x000008, "Wrong alignment on BackendSubsystem_AcceptGuildInvitationImpl");
static_assert(sizeof(BackendSubsystem_AcceptGuildInvitationImpl) == 0x000018, "Wrong size on BackendSubsystem_AcceptGuildInvitationImpl");
static_assert(offsetof(BackendSubsystem_AcceptGuildInvitationImpl, RequestId) == 0x000000, "Member 'BackendSubsystem_AcceptGuildInvitationImpl::RequestId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_AcceptGuildInvitationImpl, Args) == 0x000008, "Member 'BackendSubsystem_AcceptGuildInvitationImpl::Args' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.AddKpiPlayerBattleLog_DS
// 0x0298 (0x0298 - 0x0000)
struct BackendSubsystem_AddKpiPlayerBattleLog_DS final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKpiBattleLog                          Kpi;                                               // 0x0010(0x0288)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_AddKpiPlayerBattleLog_DS) == 0x000008, "Wrong alignment on BackendSubsystem_AddKpiPlayerBattleLog_DS");
static_assert(sizeof(BackendSubsystem_AddKpiPlayerBattleLog_DS) == 0x000298, "Wrong size on BackendSubsystem_AddKpiPlayerBattleLog_DS");
static_assert(offsetof(BackendSubsystem_AddKpiPlayerBattleLog_DS, PlayerId) == 0x000000, "Member 'BackendSubsystem_AddKpiPlayerBattleLog_DS::PlayerId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_AddKpiPlayerBattleLog_DS, Kpi) == 0x000010, "Member 'BackendSubsystem_AddKpiPlayerBattleLog_DS::Kpi' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.AddPlayer_DS
// 0x0028 (0x0028 - 0x0000)
struct BackendSubsystem_AddPlayer_DS final
{
public:
	class FString                                 SquadId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlayerId;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CharacterCode;                                     // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BackendSubsystem_AddPlayer_DS) == 0x000008, "Wrong alignment on BackendSubsystem_AddPlayer_DS");
static_assert(sizeof(BackendSubsystem_AddPlayer_DS) == 0x000028, "Wrong size on BackendSubsystem_AddPlayer_DS");
static_assert(offsetof(BackendSubsystem_AddPlayer_DS, SquadId) == 0x000000, "Member 'BackendSubsystem_AddPlayer_DS::SquadId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_AddPlayer_DS, PlayerId) == 0x000010, "Member 'BackendSubsystem_AddPlayer_DS::PlayerId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_AddPlayer_DS, CharacterCode) == 0x000020, "Member 'BackendSubsystem_AddPlayer_DS::CharacterCode' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.ApplyGuild
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_ApplyGuild final
{
public:
	class FString                                 GuildId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RecommendApply;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_ApplyGuild) == 0x000008, "Wrong alignment on BackendSubsystem_ApplyGuild");
static_assert(sizeof(BackendSubsystem_ApplyGuild) == 0x000018, "Wrong size on BackendSubsystem_ApplyGuild");
static_assert(offsetof(BackendSubsystem_ApplyGuild, GuildId) == 0x000000, "Member 'BackendSubsystem_ApplyGuild::GuildId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_ApplyGuild, RecommendApply) == 0x000010, "Member 'BackendSubsystem_ApplyGuild::RecommendApply' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_ApplyGuild, ReturnValue) == 0x000014, "Member 'BackendSubsystem_ApplyGuild::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.ApplyGuildImpl
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_ApplyGuildImpl final
{
public:
	int32                                         RequestId;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWebApiArg>                     Args;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_ApplyGuildImpl) == 0x000008, "Wrong alignment on BackendSubsystem_ApplyGuildImpl");
static_assert(sizeof(BackendSubsystem_ApplyGuildImpl) == 0x000018, "Wrong size on BackendSubsystem_ApplyGuildImpl");
static_assert(offsetof(BackendSubsystem_ApplyGuildImpl, RequestId) == 0x000000, "Member 'BackendSubsystem_ApplyGuildImpl::RequestId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_ApplyGuildImpl, Args) == 0x000008, "Member 'BackendSubsystem_ApplyGuildImpl::Args' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.AutoStartBattle
// 0x0001 (0x0001 - 0x0000)
struct BackendSubsystem_AutoStartBattle final
{
public:
	bool                                          bInitialize;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_AutoStartBattle) == 0x000001, "Wrong alignment on BackendSubsystem_AutoStartBattle");
static_assert(sizeof(BackendSubsystem_AutoStartBattle) == 0x000001, "Wrong size on BackendSubsystem_AutoStartBattle");
static_assert(offsetof(BackendSubsystem_AutoStartBattle, bInitialize) == 0x000000, "Member 'BackendSubsystem_AutoStartBattle::bInitialize' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.AutoStartBattleComplete
// 0x0001 (0x0001 - 0x0000)
struct BackendSubsystem_AutoStartBattleComplete final
{
public:
	EAutoStartBattleState                         State;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_AutoStartBattleComplete) == 0x000001, "Wrong alignment on BackendSubsystem_AutoStartBattleComplete");
static_assert(sizeof(BackendSubsystem_AutoStartBattleComplete) == 0x000001, "Wrong size on BackendSubsystem_AutoStartBattleComplete");
static_assert(offsetof(BackendSubsystem_AutoStartBattleComplete, State) == 0x000000, "Member 'BackendSubsystem_AutoStartBattleComplete::State' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.AutoStartBattleProgress1
// 0x0008 (0x0008 - 0x0000)
struct BackendSubsystem_AutoStartBattleProgress1 final
{
public:
	int32                                         SkillBase;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PenaltyLevel;                                      // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_AutoStartBattleProgress1) == 0x000004, "Wrong alignment on BackendSubsystem_AutoStartBattleProgress1");
static_assert(sizeof(BackendSubsystem_AutoStartBattleProgress1) == 0x000008, "Wrong size on BackendSubsystem_AutoStartBattleProgress1");
static_assert(offsetof(BackendSubsystem_AutoStartBattleProgress1, SkillBase) == 0x000000, "Member 'BackendSubsystem_AutoStartBattleProgress1::SkillBase' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_AutoStartBattleProgress1, PenaltyLevel) == 0x000004, "Member 'BackendSubsystem_AutoStartBattleProgress1::PenaltyLevel' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.BroadcastAutoStartBattleComplete
// 0x0008 (0x0008 - 0x0000)
struct BackendSubsystem_BroadcastAutoStartBattleComplete final
{
public:
	bool                                          Idle;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StateSetting;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_BroadcastAutoStartBattleComplete) == 0x000004, "Wrong alignment on BackendSubsystem_BroadcastAutoStartBattleComplete");
static_assert(sizeof(BackendSubsystem_BroadcastAutoStartBattleComplete) == 0x000008, "Wrong size on BackendSubsystem_BroadcastAutoStartBattleComplete");
static_assert(offsetof(BackendSubsystem_BroadcastAutoStartBattleComplete, Idle) == 0x000000, "Member 'BackendSubsystem_BroadcastAutoStartBattleComplete::Idle' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_BroadcastAutoStartBattleComplete, StateSetting) == 0x000004, "Member 'BackendSubsystem_BroadcastAutoStartBattleComplete::StateSetting' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.BroadcastOnLoadCompleteEventNextTick
// 0x0004 (0x0004 - 0x0000)
struct BackendSubsystem_BroadcastOnLoadCompleteEventNextTick final
{
public:
	int32                                         RequestId;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_BroadcastOnLoadCompleteEventNextTick) == 0x000004, "Wrong alignment on BackendSubsystem_BroadcastOnLoadCompleteEventNextTick");
static_assert(sizeof(BackendSubsystem_BroadcastOnLoadCompleteEventNextTick) == 0x000004, "Wrong size on BackendSubsystem_BroadcastOnLoadCompleteEventNextTick");
static_assert(offsetof(BackendSubsystem_BroadcastOnLoadCompleteEventNextTick, RequestId) == 0x000000, "Member 'BackendSubsystem_BroadcastOnLoadCompleteEventNextTick::RequestId' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.Buy
// 0x0010 (0x0010 - 0x0000)
struct BackendSubsystem_Buy final
{
public:
	int32                                         ShopItemCode;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrencyCode;                                      // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_Buy) == 0x000004, "Wrong alignment on BackendSubsystem_Buy");
static_assert(sizeof(BackendSubsystem_Buy) == 0x000010, "Wrong size on BackendSubsystem_Buy");
static_assert(offsetof(BackendSubsystem_Buy, ShopItemCode) == 0x000000, "Member 'BackendSubsystem_Buy::ShopItemCode' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_Buy, CurrencyCode) == 0x000004, "Member 'BackendSubsystem_Buy::CurrencyCode' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_Buy, Count) == 0x000008, "Member 'BackendSubsystem_Buy::Count' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_Buy, ReturnValue) == 0x00000C, "Member 'BackendSubsystem_Buy::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.BuyImpl
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_BuyImpl final
{
public:
	int32                                         RequestId;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWebApiArg>                     Args;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_BuyImpl) == 0x000008, "Wrong alignment on BackendSubsystem_BuyImpl");
static_assert(sizeof(BackendSubsystem_BuyImpl) == 0x000018, "Wrong size on BackendSubsystem_BuyImpl");
static_assert(offsetof(BackendSubsystem_BuyImpl, RequestId) == 0x000000, "Member 'BackendSubsystem_BuyImpl::RequestId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_BuyImpl, Args) == 0x000008, "Member 'BackendSubsystem_BuyImpl::Args' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.BuyLicenseImpl
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_BuyLicenseImpl final
{
public:
	int32                                         RequestId;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWebApiArg>                     Args;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_BuyLicenseImpl) == 0x000008, "Wrong alignment on BackendSubsystem_BuyLicenseImpl");
static_assert(sizeof(BackendSubsystem_BuyLicenseImpl) == 0x000018, "Wrong size on BackendSubsystem_BuyLicenseImpl");
static_assert(offsetof(BackendSubsystem_BuyLicenseImpl, RequestId) == 0x000000, "Member 'BackendSubsystem_BuyLicenseImpl::RequestId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_BuyLicenseImpl, Args) == 0x000008, "Member 'BackendSubsystem_BuyLicenseImpl::Args' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.BuyLicenseWithExpImpl
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_BuyLicenseWithExpImpl final
{
public:
	int32                                         RequestId;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWebApiArg>                     Args;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_BuyLicenseWithExpImpl) == 0x000008, "Wrong alignment on BackendSubsystem_BuyLicenseWithExpImpl");
static_assert(sizeof(BackendSubsystem_BuyLicenseWithExpImpl) == 0x000018, "Wrong size on BackendSubsystem_BuyLicenseWithExpImpl");
static_assert(offsetof(BackendSubsystem_BuyLicenseWithExpImpl, RequestId) == 0x000000, "Member 'BackendSubsystem_BuyLicenseWithExpImpl::RequestId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_BuyLicenseWithExpImpl, Args) == 0x000008, "Member 'BackendSubsystem_BuyLicenseWithExpImpl::Args' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.BuyPremiumDailyLoginBonus
// 0x0004 (0x0004 - 0x0000)
struct BackendSubsystem_BuyPremiumDailyLoginBonus final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_BuyPremiumDailyLoginBonus) == 0x000004, "Wrong alignment on BackendSubsystem_BuyPremiumDailyLoginBonus");
static_assert(sizeof(BackendSubsystem_BuyPremiumDailyLoginBonus) == 0x000004, "Wrong size on BackendSubsystem_BuyPremiumDailyLoginBonus");
static_assert(offsetof(BackendSubsystem_BuyPremiumDailyLoginBonus, ReturnValue) == 0x000000, "Member 'BackendSubsystem_BuyPremiumDailyLoginBonus::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.BuyPremiumDailyLoginBonusImpl
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_BuyPremiumDailyLoginBonusImpl final
{
public:
	int32                                         RequestId;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWebApiArg>                     Args;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_BuyPremiumDailyLoginBonusImpl) == 0x000008, "Wrong alignment on BackendSubsystem_BuyPremiumDailyLoginBonusImpl");
static_assert(sizeof(BackendSubsystem_BuyPremiumDailyLoginBonusImpl) == 0x000018, "Wrong size on BackendSubsystem_BuyPremiumDailyLoginBonusImpl");
static_assert(offsetof(BackendSubsystem_BuyPremiumDailyLoginBonusImpl, RequestId) == 0x000000, "Member 'BackendSubsystem_BuyPremiumDailyLoginBonusImpl::RequestId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_BuyPremiumDailyLoginBonusImpl, Args) == 0x000008, "Member 'BackendSubsystem_BuyPremiumDailyLoginBonusImpl::Args' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.BuyProLicense
// 0x0004 (0x0004 - 0x0000)
struct BackendSubsystem_BuyProLicense final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_BuyProLicense) == 0x000004, "Wrong alignment on BackendSubsystem_BuyProLicense");
static_assert(sizeof(BackendSubsystem_BuyProLicense) == 0x000004, "Wrong size on BackendSubsystem_BuyProLicense");
static_assert(offsetof(BackendSubsystem_BuyProLicense, ReturnValue) == 0x000000, "Member 'BackendSubsystem_BuyProLicense::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.BuyProLicenseWithExp
// 0x0004 (0x0004 - 0x0000)
struct BackendSubsystem_BuyProLicenseWithExp final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_BuyProLicenseWithExp) == 0x000004, "Wrong alignment on BackendSubsystem_BuyProLicenseWithExp");
static_assert(sizeof(BackendSubsystem_BuyProLicenseWithExp) == 0x000004, "Wrong size on BackendSubsystem_BuyProLicenseWithExp");
static_assert(offsetof(BackendSubsystem_BuyProLicenseWithExp, ReturnValue) == 0x000000, "Member 'BackendSubsystem_BuyProLicenseWithExp::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.BuySpecialLicenseExp
// 0x0008 (0x0008 - 0x0000)
struct BackendSubsystem_BuySpecialLicenseExp final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_BuySpecialLicenseExp) == 0x000004, "Wrong alignment on BackendSubsystem_BuySpecialLicenseExp");
static_assert(sizeof(BackendSubsystem_BuySpecialLicenseExp) == 0x000008, "Wrong size on BackendSubsystem_BuySpecialLicenseExp");
static_assert(offsetof(BackendSubsystem_BuySpecialLicenseExp, Count) == 0x000000, "Member 'BackendSubsystem_BuySpecialLicenseExp::Count' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_BuySpecialLicenseExp, ReturnValue) == 0x000004, "Member 'BackendSubsystem_BuySpecialLicenseExp::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.CancelApplyGuild
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_CancelApplyGuild final
{
public:
	class FString                                 GuildId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BackendSubsystem_CancelApplyGuild) == 0x000008, "Wrong alignment on BackendSubsystem_CancelApplyGuild");
static_assert(sizeof(BackendSubsystem_CancelApplyGuild) == 0x000018, "Wrong size on BackendSubsystem_CancelApplyGuild");
static_assert(offsetof(BackendSubsystem_CancelApplyGuild, GuildId) == 0x000000, "Member 'BackendSubsystem_CancelApplyGuild::GuildId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_CancelApplyGuild, ReturnValue) == 0x000010, "Member 'BackendSubsystem_CancelApplyGuild::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.CancelApplyGuildImpl
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_CancelApplyGuildImpl final
{
public:
	int32                                         RequestId;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWebApiArg>                     Args;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_CancelApplyGuildImpl) == 0x000008, "Wrong alignment on BackendSubsystem_CancelApplyGuildImpl");
static_assert(sizeof(BackendSubsystem_CancelApplyGuildImpl) == 0x000018, "Wrong size on BackendSubsystem_CancelApplyGuildImpl");
static_assert(offsetof(BackendSubsystem_CancelApplyGuildImpl, RequestId) == 0x000000, "Member 'BackendSubsystem_CancelApplyGuildImpl::RequestId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_CancelApplyGuildImpl, Args) == 0x000008, "Member 'BackendSubsystem_CancelApplyGuildImpl::Args' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.CancelAutoStartBattle
// 0x0001 (0x0001 - 0x0000)
struct BackendSubsystem_CancelAutoStartBattle final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_CancelAutoStartBattle) == 0x000001, "Wrong alignment on BackendSubsystem_CancelAutoStartBattle");
static_assert(sizeof(BackendSubsystem_CancelAutoStartBattle) == 0x000001, "Wrong size on BackendSubsystem_CancelAutoStartBattle");
static_assert(offsetof(BackendSubsystem_CancelAutoStartBattle, ReturnValue) == 0x000000, "Member 'BackendSubsystem_CancelAutoStartBattle::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.CancelCustomLobbyMatching
// 0x0001 (0x0001 - 0x0000)
struct BackendSubsystem_CancelCustomLobbyMatching final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_CancelCustomLobbyMatching) == 0x000001, "Wrong alignment on BackendSubsystem_CancelCustomLobbyMatching");
static_assert(sizeof(BackendSubsystem_CancelCustomLobbyMatching) == 0x000001, "Wrong size on BackendSubsystem_CancelCustomLobbyMatching");
static_assert(offsetof(BackendSubsystem_CancelCustomLobbyMatching, ReturnValue) == 0x000000, "Member 'BackendSubsystem_CancelCustomLobbyMatching::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.CancelFriendshipProposal
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_CancelFriendshipProposal final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BackendSubsystem_CancelFriendshipProposal) == 0x000008, "Wrong alignment on BackendSubsystem_CancelFriendshipProposal");
static_assert(sizeof(BackendSubsystem_CancelFriendshipProposal) == 0x000018, "Wrong size on BackendSubsystem_CancelFriendshipProposal");
static_assert(offsetof(BackendSubsystem_CancelFriendshipProposal, PlayerId) == 0x000000, "Member 'BackendSubsystem_CancelFriendshipProposal::PlayerId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_CancelFriendshipProposal, ReturnValue) == 0x000010, "Member 'BackendSubsystem_CancelFriendshipProposal::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.CancelFriendshipProposalImpl
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_CancelFriendshipProposalImpl final
{
public:
	int32                                         RequestId;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWebApiArg>                     Args;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_CancelFriendshipProposalImpl) == 0x000008, "Wrong alignment on BackendSubsystem_CancelFriendshipProposalImpl");
static_assert(sizeof(BackendSubsystem_CancelFriendshipProposalImpl) == 0x000018, "Wrong size on BackendSubsystem_CancelFriendshipProposalImpl");
static_assert(offsetof(BackendSubsystem_CancelFriendshipProposalImpl, RequestId) == 0x000000, "Member 'BackendSubsystem_CancelFriendshipProposalImpl::RequestId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_CancelFriendshipProposalImpl, Args) == 0x000008, "Member 'BackendSubsystem_CancelFriendshipProposalImpl::Args' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.CancelLobbyMatching
// 0x0001 (0x0001 - 0x0000)
struct BackendSubsystem_CancelLobbyMatching final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_CancelLobbyMatching) == 0x000001, "Wrong alignment on BackendSubsystem_CancelLobbyMatching");
static_assert(sizeof(BackendSubsystem_CancelLobbyMatching) == 0x000001, "Wrong size on BackendSubsystem_CancelLobbyMatching");
static_assert(offsetof(BackendSubsystem_CancelLobbyMatching, ReturnValue) == 0x000000, "Member 'BackendSubsystem_CancelLobbyMatching::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.CancelMergeSquad
// 0x0001 (0x0001 - 0x0000)
struct BackendSubsystem_CancelMergeSquad final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_CancelMergeSquad) == 0x000001, "Wrong alignment on BackendSubsystem_CancelMergeSquad");
static_assert(sizeof(BackendSubsystem_CancelMergeSquad) == 0x000001, "Wrong size on BackendSubsystem_CancelMergeSquad");
static_assert(offsetof(BackendSubsystem_CancelMergeSquad, ReturnValue) == 0x000000, "Member 'BackendSubsystem_CancelMergeSquad::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.CancelPurchase
// 0x0028 (0x0028 - 0x0000)
struct BackendSubsystem_CancelPurchase final
{
public:
	class FString                                 ErrorID;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ErrorMessage;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BackendSubsystem_CancelPurchase) == 0x000008, "Wrong alignment on BackendSubsystem_CancelPurchase");
static_assert(sizeof(BackendSubsystem_CancelPurchase) == 0x000028, "Wrong size on BackendSubsystem_CancelPurchase");
static_assert(offsetof(BackendSubsystem_CancelPurchase, ErrorID) == 0x000000, "Member 'BackendSubsystem_CancelPurchase::ErrorID' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_CancelPurchase, ErrorMessage) == 0x000010, "Member 'BackendSubsystem_CancelPurchase::ErrorMessage' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_CancelPurchase, ReturnValue) == 0x000020, "Member 'BackendSubsystem_CancelPurchase::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.CancelPurchaseImpl
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_CancelPurchaseImpl final
{
public:
	int32                                         RequestId;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWebApiArg>                     Args;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_CancelPurchaseImpl) == 0x000008, "Wrong alignment on BackendSubsystem_CancelPurchaseImpl");
static_assert(sizeof(BackendSubsystem_CancelPurchaseImpl) == 0x000018, "Wrong size on BackendSubsystem_CancelPurchaseImpl");
static_assert(offsetof(BackendSubsystem_CancelPurchaseImpl, RequestId) == 0x000000, "Member 'BackendSubsystem_CancelPurchaseImpl::RequestId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_CancelPurchaseImpl, Args) == 0x000008, "Member 'BackendSubsystem_CancelPurchaseImpl::Args' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.CancelSquadInvitation
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_CancelSquadInvitation final
{
public:
	class FString                                 InvitationId;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BackendSubsystem_CancelSquadInvitation) == 0x000008, "Wrong alignment on BackendSubsystem_CancelSquadInvitation");
static_assert(sizeof(BackendSubsystem_CancelSquadInvitation) == 0x000018, "Wrong size on BackendSubsystem_CancelSquadInvitation");
static_assert(offsetof(BackendSubsystem_CancelSquadInvitation, InvitationId) == 0x000000, "Member 'BackendSubsystem_CancelSquadInvitation::InvitationId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_CancelSquadInvitation, ReturnValue) == 0x000010, "Member 'BackendSubsystem_CancelSquadInvitation::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.CancelSquadInvitationImpl
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_CancelSquadInvitationImpl final
{
public:
	int32                                         RequestId;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWebApiArg>                     Args;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_CancelSquadInvitationImpl) == 0x000008, "Wrong alignment on BackendSubsystem_CancelSquadInvitationImpl");
static_assert(sizeof(BackendSubsystem_CancelSquadInvitationImpl) == 0x000018, "Wrong size on BackendSubsystem_CancelSquadInvitationImpl");
static_assert(offsetof(BackendSubsystem_CancelSquadInvitationImpl, RequestId) == 0x000000, "Member 'BackendSubsystem_CancelSquadInvitationImpl::RequestId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_CancelSquadInvitationImpl, Args) == 0x000008, "Member 'BackendSubsystem_CancelSquadInvitationImpl::Args' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.CanStartBattle
// 0x0001 (0x0001 - 0x0000)
struct BackendSubsystem_CanStartBattle final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_CanStartBattle) == 0x000001, "Wrong alignment on BackendSubsystem_CanStartBattle");
static_assert(sizeof(BackendSubsystem_CanStartBattle) == 0x000001, "Wrong size on BackendSubsystem_CanStartBattle");
static_assert(offsetof(BackendSubsystem_CanStartBattle, ReturnValue) == 0x000000, "Member 'BackendSubsystem_CanStartBattle::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.ChangePlayMode
// 0x0008 (0x0008 - 0x0000)
struct BackendSubsystem_ChangePlayMode final
{
public:
	int32                                         NewPlayMode;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BackendSubsystem_ChangePlayMode) == 0x000004, "Wrong alignment on BackendSubsystem_ChangePlayMode");
static_assert(sizeof(BackendSubsystem_ChangePlayMode) == 0x000008, "Wrong size on BackendSubsystem_ChangePlayMode");
static_assert(offsetof(BackendSubsystem_ChangePlayMode, NewPlayMode) == 0x000000, "Member 'BackendSubsystem_ChangePlayMode::NewPlayMode' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_ChangePlayMode, ReturnValue) == 0x000004, "Member 'BackendSubsystem_ChangePlayMode::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.CheckBnidStatus
// 0x0004 (0x0004 - 0x0000)
struct BackendSubsystem_CheckBnidStatus final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_CheckBnidStatus) == 0x000004, "Wrong alignment on BackendSubsystem_CheckBnidStatus");
static_assert(sizeof(BackendSubsystem_CheckBnidStatus) == 0x000004, "Wrong size on BackendSubsystem_CheckBnidStatus");
static_assert(offsetof(BackendSubsystem_CheckBnidStatus, ReturnValue) == 0x000000, "Member 'BackendSubsystem_CheckBnidStatus::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.CheckBnidStatusImpl
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_CheckBnidStatusImpl final
{
public:
	int32                                         RequestId;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWebApiArg>                     Args;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_CheckBnidStatusImpl) == 0x000008, "Wrong alignment on BackendSubsystem_CheckBnidStatusImpl");
static_assert(sizeof(BackendSubsystem_CheckBnidStatusImpl) == 0x000018, "Wrong size on BackendSubsystem_CheckBnidStatusImpl");
static_assert(offsetof(BackendSubsystem_CheckBnidStatusImpl, RequestId) == 0x000000, "Member 'BackendSubsystem_CheckBnidStatusImpl::RequestId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_CheckBnidStatusImpl, Args) == 0x000008, "Member 'BackendSubsystem_CheckBnidStatusImpl::Args' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.CheckedLeaveSquad
// 0x0001 (0x0001 - 0x0000)
struct BackendSubsystem_CheckedLeaveSquad final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_CheckedLeaveSquad) == 0x000001, "Wrong alignment on BackendSubsystem_CheckedLeaveSquad");
static_assert(sizeof(BackendSubsystem_CheckedLeaveSquad) == 0x000001, "Wrong size on BackendSubsystem_CheckedLeaveSquad");
static_assert(offsetof(BackendSubsystem_CheckedLeaveSquad, ReturnValue) == 0x000000, "Member 'BackendSubsystem_CheckedLeaveSquad::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.CheckNumKpiPlayerBattleLog_DS
// 0x0001 (0x0001 - 0x0000)
struct BackendSubsystem_CheckNumKpiPlayerBattleLog_DS final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_CheckNumKpiPlayerBattleLog_DS) == 0x000001, "Wrong alignment on BackendSubsystem_CheckNumKpiPlayerBattleLog_DS");
static_assert(sizeof(BackendSubsystem_CheckNumKpiPlayerBattleLog_DS) == 0x000001, "Wrong size on BackendSubsystem_CheckNumKpiPlayerBattleLog_DS");
static_assert(offsetof(BackendSubsystem_CheckNumKpiPlayerBattleLog_DS, ReturnValue) == 0x000000, "Member 'BackendSubsystem_CheckNumKpiPlayerBattleLog_DS::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.ConfirmPurchase
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_ConfirmPurchase final
{
public:
	class FString                                 OrderId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BackendSubsystem_ConfirmPurchase) == 0x000008, "Wrong alignment on BackendSubsystem_ConfirmPurchase");
static_assert(sizeof(BackendSubsystem_ConfirmPurchase) == 0x000018, "Wrong size on BackendSubsystem_ConfirmPurchase");
static_assert(offsetof(BackendSubsystem_ConfirmPurchase, OrderId) == 0x000000, "Member 'BackendSubsystem_ConfirmPurchase::OrderId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_ConfirmPurchase, ReturnValue) == 0x000010, "Member 'BackendSubsystem_ConfirmPurchase::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.ConfirmPurchaseImpl
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_ConfirmPurchaseImpl final
{
public:
	int32                                         RequestId;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWebApiArg>                     Args;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_ConfirmPurchaseImpl) == 0x000008, "Wrong alignment on BackendSubsystem_ConfirmPurchaseImpl");
static_assert(sizeof(BackendSubsystem_ConfirmPurchaseImpl) == 0x000018, "Wrong size on BackendSubsystem_ConfirmPurchaseImpl");
static_assert(offsetof(BackendSubsystem_ConfirmPurchaseImpl, RequestId) == 0x000000, "Member 'BackendSubsystem_ConfirmPurchaseImpl::RequestId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_ConfirmPurchaseImpl, Args) == 0x000008, "Member 'BackendSubsystem_ConfirmPurchaseImpl::Args' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.ConfirmRetryLottery
// 0x0004 (0x0004 - 0x0000)
struct BackendSubsystem_ConfirmRetryLottery final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_ConfirmRetryLottery) == 0x000004, "Wrong alignment on BackendSubsystem_ConfirmRetryLottery");
static_assert(sizeof(BackendSubsystem_ConfirmRetryLottery) == 0x000004, "Wrong size on BackendSubsystem_ConfirmRetryLottery");
static_assert(offsetof(BackendSubsystem_ConfirmRetryLottery, ReturnValue) == 0x000000, "Member 'BackendSubsystem_ConfirmRetryLottery::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.ConfirmRetryLotteryImpl
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_ConfirmRetryLotteryImpl final
{
public:
	int32                                         RequestId;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWebApiArg>                     Args;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackendSubsystem_ConfirmRetryLotteryImpl) == 0x000008, "Wrong alignment on BackendSubsystem_ConfirmRetryLotteryImpl");
static_assert(sizeof(BackendSubsystem_ConfirmRetryLotteryImpl) == 0x000018, "Wrong size on BackendSubsystem_ConfirmRetryLotteryImpl");
static_assert(offsetof(BackendSubsystem_ConfirmRetryLotteryImpl, RequestId) == 0x000000, "Member 'BackendSubsystem_ConfirmRetryLotteryImpl::RequestId' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_ConfirmRetryLotteryImpl, Args) == 0x000008, "Member 'BackendSubsystem_ConfirmRetryLotteryImpl::Args' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.ConsumeRentalPoint_DS
// 0x0058 (0x0058 - 0x0000)
struct BackendSubsystem_ConsumeRentalPoint_DS final
{
public:
	TMap<class FString, int32>                    ConsumeDataList;                                   // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0050(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BackendSubsystem_ConsumeRentalPoint_DS) == 0x000008, "Wrong alignment on BackendSubsystem_ConsumeRentalPoint_DS");
static_assert(sizeof(BackendSubsystem_ConsumeRentalPoint_DS) == 0x000058, "Wrong size on BackendSubsystem_ConsumeRentalPoint_DS");
static_assert(offsetof(BackendSubsystem_ConsumeRentalPoint_DS, ConsumeDataList) == 0x000000, "Member 'BackendSubsystem_ConsumeRentalPoint_DS::ConsumeDataList' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_ConsumeRentalPoint_DS, ReturnValue) == 0x000050, "Member 'BackendSubsystem_ConsumeRentalPoint_DS::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.CreateCustomMatchRoomID
// 0x000C (0x000C - 0x0000)
struct BackendSubsystem_CreateCustomMatchRoomID final
{
public:
	bool                                          bHiddenIdFlag;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayModeCode;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BackendSubsystem_CreateCustomMatchRoomID) == 0x000004, "Wrong alignment on BackendSubsystem_CreateCustomMatchRoomID");
static_assert(sizeof(BackendSubsystem_CreateCustomMatchRoomID) == 0x00000C, "Wrong size on BackendSubsystem_CreateCustomMatchRoomID");
static_assert(offsetof(BackendSubsystem_CreateCustomMatchRoomID, bHiddenIdFlag) == 0x000000, "Member 'BackendSubsystem_CreateCustomMatchRoomID::bHiddenIdFlag' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_CreateCustomMatchRoomID, PlayModeCode) == 0x000004, "Member 'BackendSubsystem_CreateCustomMatchRoomID::PlayModeCode' has a wrong offset!");
static_assert(offsetof(BackendSubsystem_CreateCustomMatchRoomID, ReturnValue) == 0x000008, "Member 'BackendSubsystem_CreateCustomMatchRoomID::ReturnValue' has a wrong offset!");

// Function BackendSubsystem.BackendSubsystem.CreateCustomMatchRoomIDImpl
// 0x0018 (0x0018 - 0x0000)
struct BackendSubsystem_CreateCustomMatchRoomIDImpl final
{
public:
	int32                                         RequestId;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
