#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionAirJumpBeginForward

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameModule_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionAirJumpBeginForward.BP_ActionAirJumpBeginForward_C.ExecuteUbergraph_BP_ActionAirJumpBeginForward
// 0x0120 (0x0120 - 0x0000)
struct BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue_1;                // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterCommandComponent*             CallFunc_BP_GetCommandComponent_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  Temp_byte_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue;          // 0x004C(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  Temp_byte_Variable_1;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_1; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorLocalOffset_SweepHitResult;    // 0x0070(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue_1;           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsGiant_ReturnValue;                   // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsAimingMode_ReturnValue;              // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_Event_nextAction;                           // 0x0104(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_1;            // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  K2Node_Select_Default;                             // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward) == 0x000008, "Wrong alignment on BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward");
static_assert(sizeof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward) == 0x000120, "Wrong size on BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, EntryPoint) == 0x000000, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, CallFunc_BP_GetParam_ReturnValue) == 0x000008, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::CallFunc_BP_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000010, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, CallFunc_BP_GetParam_ReturnValue_1) == 0x000018, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::CallFunc_BP_GetParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, CallFunc_BP_GetAnimation_ReturnValue) == 0x000020, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::CallFunc_BP_GetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, K2Node_Event_prevAction) == 0x000028, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::K2Node_Event_prevAction' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000030, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue) == 0x000038, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, CallFunc_BP_GetCommandComponent_ReturnValue) == 0x000040, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::CallFunc_BP_GetCommandComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, Temp_byte_Variable) == 0x000048, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, CallFunc_BP_GetMoveDirection_ReturnValue) == 0x00004C, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::CallFunc_BP_GetMoveDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, CallFunc_BP_GetOwnerState_ReturnValue) == 0x000058, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, Temp_byte_Variable_1) == 0x000060, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_1) == 0x000068, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, CallFunc_K2_AddActorLocalOffset_SweepHitResult) == 0x000070, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::CallFunc_K2_AddActorLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, CallFunc_BP_GetOwnerState_ReturnValue_1) == 0x0000F8, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::CallFunc_BP_GetOwnerState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, CallFunc_BP_IsGiant_ReturnValue) == 0x000100, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::CallFunc_BP_IsGiant_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, CallFunc_BP_IsAimingMode_ReturnValue) == 0x000101, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::CallFunc_BP_IsAimingMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, Temp_bool_Variable) == 0x000102, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, CallFunc_BooleanOR_ReturnValue) == 0x000103, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, K2Node_Event_nextAction) == 0x000104, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::K2Node_Event_nextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, CallFunc_BP_GetAnimation_ReturnValue_1) == 0x000110, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::CallFunc_BP_GetAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward, K2Node_Select_Default) == 0x000118, "Member 'BP_ActionAirJumpBeginForward_C_ExecuteUbergraph_BP_ActionAirJumpBeginForward::K2Node_Select_Default' has a wrong offset!");

// Function BP_ActionAirJumpBeginForward.BP_ActionAirJumpBeginForward_C.BP_OnEndAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionAirJumpBeginForward_C_BP_OnEndAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionAirJumpBeginForward_C_BP_OnEndAction) == 0x000004, "Wrong alignment on BP_ActionAirJumpBeginForward_C_BP_OnEndAction");
static_assert(sizeof(BP_ActionAirJumpBeginForward_C_BP_OnEndAction) == 0x000008, "Wrong size on BP_ActionAirJumpBeginForward_C_BP_OnEndAction");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_BP_OnEndAction, NextAction) == 0x000000, "Member 'BP_ActionAirJumpBeginForward_C_BP_OnEndAction::NextAction' has a wrong offset!");

// Function BP_ActionAirJumpBeginForward.BP_ActionAirJumpBeginForward_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionAirJumpBeginForward_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionAirJumpBeginForward_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionAirJumpBeginForward_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionAirJumpBeginForward_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionAirJumpBeginForward_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionAirJumpBeginForward_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionAirJumpBeginForward_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

}

