#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionCarried

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionCarried.BP_ActionCarried_C.ExecuteUbergraph_BP_ActionCarried
// 0x00B0 (0x00B0 - 0x0000)
struct BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_nextAction;                           // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterConditionControlComponent*    CallFunc_BP_GetConditionControlComponent_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBattle*                     K2Node_DynamicCast_AsPlayer_State_Battle;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterCommandComponent*             CallFunc_BP_GetOwnerCommand_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsSatisfiedCommand_ReturnValue;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsSatisfiedCommand_ReturnValue_1;      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsSatisfiedCommand_ReturnValue_2;      // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsSatisfiedCommand_ReturnValue_3;      // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsSatisfiedCommand_ReturnValue_4;      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPInGameActorUtilityComponent*         CallFunc_BP_GetUBPInGameActorUtilityComponent_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomParticleSystemComponent*         CallFunc_BP_SpawnEmitterAtLocation_ReturnValue;    // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried) == 0x000010, "Wrong alignment on BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried");
static_assert(sizeof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried) == 0x0000B0, "Wrong size on BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, EntryPoint) == 0x000000, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, CallFunc_BP_GetOwnerState_ReturnValue) == 0x000008, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, K2Node_Event_prevAction) == 0x000010, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::K2Node_Event_prevAction' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue) == 0x000018, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, K2Node_Event_nextAction) == 0x000020, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::K2Node_Event_nextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, CallFunc_BP_GetConditionControlComponent_ReturnValue) == 0x000028, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::CallFunc_BP_GetConditionControlComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, K2Node_DynamicCast_AsPlayer_State_Battle) == 0x000030, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::K2Node_DynamicCast_AsPlayer_State_Battle' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, CallFunc_BP_GetOwnerCommand_ReturnValue) == 0x000040, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::CallFunc_BP_GetOwnerCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, CallFunc_BP_IsSatisfiedCommand_ReturnValue) == 0x000048, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::CallFunc_BP_IsSatisfiedCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, CallFunc_BP_IsSatisfiedCommand_ReturnValue_1) == 0x000049, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::CallFunc_BP_IsSatisfiedCommand_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, CallFunc_BP_IsSatisfiedCommand_ReturnValue_2) == 0x00004A, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::CallFunc_BP_IsSatisfiedCommand_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, CallFunc_BP_IsSatisfiedCommand_ReturnValue_3) == 0x00004B, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::CallFunc_BP_IsSatisfiedCommand_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, CallFunc_BP_IsSatisfiedCommand_ReturnValue_4) == 0x00004C, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::CallFunc_BP_IsSatisfiedCommand_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_1) == 0x000050, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, CallFunc_BooleanOR_ReturnValue) == 0x000058, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, CallFunc_BooleanOR_ReturnValue_1) == 0x000059, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, CallFunc_GetSocketTransform_ReturnValue) == 0x000060, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, CallFunc_BooleanOR_ReturnValue_2) == 0x000090, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, CallFunc_BP_GetUBPInGameActorUtilityComponent_ReturnValue) == 0x000098, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::CallFunc_BP_GetUBPInGameActorUtilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, CallFunc_BooleanOR_ReturnValue_3) == 0x0000A0, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried, CallFunc_BP_SpawnEmitterAtLocation_ReturnValue) == 0x0000A8, "Member 'BP_ActionCarried_C_ExecuteUbergraph_BP_ActionCarried::CallFunc_BP_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function BP_ActionCarried.BP_ActionCarried_C.BP_OnEndAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionCarried_C_BP_OnEndAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionCarried_C_BP_OnEndAction) == 0x000004, "Wrong alignment on BP_ActionCarried_C_BP_OnEndAction");
static_assert(sizeof(BP_ActionCarried_C_BP_OnEndAction) == 0x000008, "Wrong size on BP_ActionCarried_C_BP_OnEndAction");
static_assert(offsetof(BP_ActionCarried_C_BP_OnEndAction, NextAction) == 0x000000, "Member 'BP_ActionCarried_C_BP_OnEndAction::NextAction' has a wrong offset!");

// Function BP_ActionCarried.BP_ActionCarried_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionCarried_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionCarried_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionCarried_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionCarried_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionCarried_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionCarried_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionCarried_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

// Function BP_ActionCarried.BP_ActionCarried_C.BP_IsEnableShiftAction
// 0x000C (0x000C - 0x0000)
struct BP_ActionCarried_C_BP_IsEnableShiftAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionCarried_C_BP_IsEnableShiftAction) == 0x000004, "Wrong alignment on BP_ActionCarried_C_BP_IsEnableShiftAction");
static_assert(sizeof(BP_ActionCarried_C_BP_IsEnableShiftAction) == 0x00000C, "Wrong size on BP_ActionCarried_C_BP_IsEnableShiftAction");
static_assert(offsetof(BP_ActionCarried_C_BP_IsEnableShiftAction, NextAction) == 0x000000, "Member 'BP_ActionCarried_C_BP_IsEnableShiftAction::NextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionCarried_C_BP_IsEnableShiftAction, ReturnValue) == 0x000008, "Member 'BP_ActionCarried_C_BP_IsEnableShiftAction::ReturnValue' has a wrong offset!");

}

