#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionDashBegin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionDashBegin.BP_ActionDashBegin_C.ExecuteUbergraph_BP_ActionDashBegin
// 0x0078 (0x0078 - 0x0000)
struct BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1;  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_nextAction;                           // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue_1;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue_1;                // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterCommandComponent*             CallFunc_BP_GetOwnerCommand_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_1;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue_2;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x0060(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsOnGround_ReturnValue;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue_3;           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin) == 0x000008, "Wrong alignment on BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin");
static_assert(sizeof(BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin) == 0x000078, "Wrong size on BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin");
static_assert(offsetof(BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin, EntryPoint) == 0x000000, "Member 'BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000008, "Member 'BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin, CallFunc_BP_GetParam_ReturnValue) == 0x000010, "Member 'BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin::CallFunc_BP_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1) == 0x000018, "Member 'BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin, K2Node_Event_nextAction) == 0x000020, "Member 'BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin::K2Node_Event_nextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin, CallFunc_BP_GetOwnerState_ReturnValue) == 0x000028, "Member 'BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin, CallFunc_BP_GetOwnerState_ReturnValue_1) == 0x000030, "Member 'BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin::CallFunc_BP_GetOwnerState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin, CallFunc_BP_GetAnimation_ReturnValue) == 0x000038, "Member 'BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin::CallFunc_BP_GetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin, CallFunc_BP_GetParam_ReturnValue_1) == 0x000040, "Member 'BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin::CallFunc_BP_GetParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin, CallFunc_BP_GetOwnerCommand_ReturnValue) == 0x000048, "Member 'BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin::CallFunc_BP_GetOwnerCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin, CallFunc_BP_GetAnimation_ReturnValue_1) == 0x000050, "Member 'BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin::CallFunc_BP_GetAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin, CallFunc_BP_GetOwnerState_ReturnValue_2) == 0x000058, "Member 'BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin::CallFunc_BP_GetOwnerState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin, K2Node_Event_prevAction) == 0x000060, "Member 'BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin::K2Node_Event_prevAction' has a wrong offset!");
static_assert(offsetof(BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin, CallFunc_BP_IsOnGround_ReturnValue) == 0x000068, "Member 'BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin::CallFunc_BP_IsOnGround_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin, CallFunc_BP_GetOwnerState_ReturnValue_3) == 0x000070, "Member 'BP_ActionDashBegin_C_ExecuteUbergraph_BP_ActionDashBegin::CallFunc_BP_GetOwnerState_ReturnValue_3' has a wrong offset!");

// Function BP_ActionDashBegin.BP_ActionDashBegin_C.BP_OnEndAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionDashBegin_C_BP_OnEndAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDashBegin_C_BP_OnEndAction) == 0x000004, "Wrong alignment on BP_ActionDashBegin_C_BP_OnEndAction");
static_assert(sizeof(BP_ActionDashBegin_C_BP_OnEndAction) == 0x000008, "Wrong size on BP_ActionDashBegin_C_BP_OnEndAction");
static_assert(offsetof(BP_ActionDashBegin_C_BP_OnEndAction, NextAction) == 0x000000, "Member 'BP_ActionDashBegin_C_BP_OnEndAction::NextAction' has a wrong offset!");

// Function BP_ActionDashBegin.BP_ActionDashBegin_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionDashBegin_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDashBegin_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionDashBegin_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionDashBegin_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionDashBegin_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionDashBegin_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionDashBegin_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

// Function BP_ActionDashBegin.BP_ActionDashBegin_C.UpdateMoveDirection
// 0x0020 (0x0020 - 0x0000)
struct BP_ActionDashBegin_C_UpdateMoveDirection final
{
public:
	class UCharacterCommandComponent*             CallFunc_BP_GetOwnerCommand_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue;          // 0x0010(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BP_GetDeltaSeconds_ReturnValue;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDashBegin_C_UpdateMoveDirection) == 0x000008, "Wrong alignment on BP_ActionDashBegin_C_UpdateMoveDirection");
static_assert(sizeof(BP_ActionDashBegin_C_UpdateMoveDirection) == 0x000020, "Wrong size on BP_ActionDashBegin_C_UpdateMoveDirection");
static_assert(offsetof(BP_ActionDashBegin_C_UpdateMoveDirection, CallFunc_BP_GetOwnerCommand_ReturnValue) == 0x000000, "Member 'BP_ActionDashBegin_C_UpdateMoveDirection::CallFunc_BP_GetOwnerCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashBegin_C_UpdateMoveDirection, CallFunc_BP_GetParam_ReturnValue) == 0x000008, "Member 'BP_ActionDashBegin_C_UpdateMoveDirection::CallFunc_BP_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashBegin_C_UpdateMoveDirection, CallFunc_BP_GetMoveDirection_ReturnValue) == 0x000010, "Member 'BP_ActionDashBegin_C_UpdateMoveDirection::CallFunc_BP_GetMoveDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashBegin_C_UpdateMoveDirection, CallFunc_BP_GetDeltaSeconds_ReturnValue) == 0x00001C, "Member 'BP_ActionDashBegin_C_UpdateMoveDirection::CallFunc_BP_GetDeltaSeconds_ReturnValue' has a wrong offset!");

// Function BP_ActionDashBegin.BP_ActionDashBegin_C.UpdateCharacterDirection
// 0x0018 (0x0018 - 0x0000)
struct BP_ActionDashBegin_C_UpdateCharacterDirection final
{
public:
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue;          // 0x0008(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDashBegin_C_UpdateCharacterDirection) == 0x000008, "Wrong alignment on BP_ActionDashBegin_C_UpdateCharacterDirection");
static_assert(sizeof(BP_ActionDashBegin_C_UpdateCharacterDirection) == 0x000018, "Wrong size on BP_ActionDashBegin_C_UpdateCharacterDirection");
static_assert(offsetof(BP_ActionDashBegin_C_UpdateCharacterDirection, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000000, "Member 'BP_ActionDashBegin_C_UpdateCharacterDirection::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashBegin_C_UpdateCharacterDirection, CallFunc_BP_GetMoveDirection_ReturnValue) == 0x000008, "Member 'BP_ActionDashBegin_C_UpdateCharacterDirection::CallFunc_BP_GetMoveDirection_ReturnValue' has a wrong offset!");

// Function BP_ActionDashBegin.BP_ActionDashBegin_C.UpdateSpeedRate
// 0x0018 (0x0018 - 0x0000)
struct BP_ActionDashBegin_C_UpdateSpeedRate final
{
public:
	class UCharacterCommandComponent*             CallFunc_BP_GetOwnerCommand_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BP_GetMoveRate_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDashBegin_C_UpdateSpeedRate) == 0x000008, "Wrong alignment on BP_ActionDashBegin_C_UpdateSpeedRate");
static_assert(sizeof(BP_ActionDashBegin_C_UpdateSpeedRate) == 0x000018, "Wrong size on BP_ActionDashBegin_C_UpdateSpeedRate");
static_assert(offsetof(BP_ActionDashBegin_C_UpdateSpeedRate, CallFunc_BP_GetOwnerCommand_ReturnValue) == 0x000000, "Member 'BP_ActionDashBegin_C_UpdateSpeedRate::CallFunc_BP_GetOwnerCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashBegin_C_UpdateSpeedRate, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000008, "Member 'BP_ActionDashBegin_C_UpdateSpeedRate::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashBegin_C_UpdateSpeedRate, CallFunc_BP_GetMoveRate_ReturnValue) == 0x000010, "Member 'BP_ActionDashBegin_C_UpdateSpeedRate::CallFunc_BP_GetMoveRate_ReturnValue' has a wrong offset!");

}

