#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionWallJump

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionWallJump.BP_ActionWallJump_C.ExecuteUbergraph_BP_ActionWallJump
// 0x00B8 (0x00B8 - 0x0000)
struct BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1;  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue_1;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_2;  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue;          // 0x0040(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue_2;                // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetForwardDirectionForBaseActionMovement_ReturnValue; // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x0064(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue_3;                // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBattle*                     CallFunc_BP_GetPlayerStateBattle_ReturnValue;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBuffParam*                             CallFunc_BP_GetBuffParam_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BP_GetJumpAdjustRate_ReturnValue;         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_3;  // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetCurrentWallNormal_ReturnValue;      // 0x00A0(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Normal2D_ReturnValue;              // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump) == 0x000008, "Wrong alignment on BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump");
static_assert(sizeof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump) == 0x0000B8, "Wrong size on BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump");
static_assert(offsetof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump, EntryPoint) == 0x000000, "Member 'BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump, CallFunc_BP_GetParam_ReturnValue) == 0x000008, "Member 'BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump::CallFunc_BP_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump, CallFunc_BP_GetOwnerState_ReturnValue) == 0x000010, "Member 'BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000018, "Member 'BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1) == 0x000020, "Member 'BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump, CallFunc_BP_GetParam_ReturnValue_1) == 0x000028, "Member 'BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump::CallFunc_BP_GetParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump, CallFunc_BP_GetAnimation_ReturnValue) == 0x000030, "Member 'BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump::CallFunc_BP_GetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_2) == 0x000038, "Member 'BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump, CallFunc_BP_GetMoveDirection_ReturnValue) == 0x000040, "Member 'BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump::CallFunc_BP_GetMoveDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump, CallFunc_BP_GetParam_ReturnValue_2) == 0x000050, "Member 'BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump::CallFunc_BP_GetParam_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump, CallFunc_BP_GetForwardDirectionForBaseActionMovement_ReturnValue) == 0x000058, "Member 'BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump::CallFunc_BP_GetForwardDirectionForBaseActionMovement_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump, K2Node_Event_prevAction) == 0x000064, "Member 'BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump::K2Node_Event_prevAction' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump, CallFunc_BP_GetParam_ReturnValue_3) == 0x000070, "Member 'BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump::CallFunc_BP_GetParam_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump, CallFunc_BP_GetPlayerStateBattle_ReturnValue) == 0x000078, "Member 'BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump::CallFunc_BP_GetPlayerStateBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump, CallFunc_BP_GetBuffParam_ReturnValue) == 0x000080, "Member 'BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump::CallFunc_BP_GetBuffParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump, CallFunc_BP_GetJumpAdjustRate_ReturnValue) == 0x000088, "Member 'BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump::CallFunc_BP_GetJumpAdjustRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00008C, "Member 'BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000090, "Member 'BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_3) == 0x000098, "Member 'BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump, CallFunc_BP_GetCurrentWallNormal_ReturnValue) == 0x0000A0, "Member 'BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump::CallFunc_BP_GetCurrentWallNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump, CallFunc_Vector_Normal2D_ReturnValue) == 0x0000AC, "Member 'BP_ActionWallJump_C_ExecuteUbergraph_BP_ActionWallJump::CallFunc_Vector_Normal2D_ReturnValue' has a wrong offset!");

// Function BP_ActionWallJump.BP_ActionWallJump_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionWallJump_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionWallJump_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionWallJump_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionWallJump_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionWallJump_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionWallJump_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionWallJump_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

// Function BP_ActionWallJump.BP_ActionWallJump_C.BP_IsEnableShiftAction
// 0x000C (0x000C - 0x0000)
struct BP_ActionWallJump_C_BP_IsEnableShiftAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionWallJump_C_BP_IsEnableShiftAction) == 0x000004, "Wrong alignment on BP_ActionWallJump_C_BP_IsEnableShiftAction");
static_assert(sizeof(BP_ActionWallJump_C_BP_IsEnableShiftAction) == 0x00000C, "Wrong size on BP_ActionWallJump_C_BP_IsEnableShiftAction");
static_assert(offsetof(BP_ActionWallJump_C_BP_IsEnableShiftAction, NextAction) == 0x000000, "Member 'BP_ActionWallJump_C_BP_IsEnableShiftAction::NextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_BP_IsEnableShiftAction, ReturnValue) == 0x000008, "Member 'BP_ActionWallJump_C_BP_IsEnableShiftAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallJump_C_BP_IsEnableShiftAction, K2Node_SwitchName_CmpSuccess) == 0x000009, "Member 'BP_ActionWallJump_C_BP_IsEnableShiftAction::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

}

