#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionThrowned

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionThrowned.BP_ActionThrowned_C.ExecuteUbergraph_BP_ActionThrowned
// 0x00D8 (0x00D8 - 0x0000)
struct BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1;  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_2;  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_1;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue;          // 0x0038(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetForwardDirectionForBaseActionMovement_ReturnValue; // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue_1;                // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_nextAction;                           // 0x0058(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_3;  // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterCommandComponent*             CallFunc_BP_GetOwnerCommand_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue_2;                // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue_1;        // 0x0078(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_2;            // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_3;            // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_4;            // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetThrownedDirection_ReturnValue;      // 0x00A8(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_4;  // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue_3;                // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_5;  // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x00D0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned) == 0x000008, "Wrong alignment on BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned");
static_assert(sizeof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned) == 0x0000D8, "Wrong size on BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, EntryPoint) == 0x000000, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, CallFunc_BP_GetAnimation_ReturnValue) == 0x000008, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::CallFunc_BP_GetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000010, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1) == 0x000018, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, CallFunc_BP_GetParam_ReturnValue) == 0x000020, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::CallFunc_BP_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_2) == 0x000028, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, CallFunc_BP_GetAnimation_ReturnValue_1) == 0x000030, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::CallFunc_BP_GetAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, CallFunc_BP_GetMoveDirection_ReturnValue) == 0x000038, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::CallFunc_BP_GetMoveDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, CallFunc_BP_GetForwardDirectionForBaseActionMovement_ReturnValue) == 0x000044, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::CallFunc_BP_GetForwardDirectionForBaseActionMovement_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, CallFunc_BP_GetParam_ReturnValue_1) == 0x000050, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::CallFunc_BP_GetParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, K2Node_Event_nextAction) == 0x000058, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::K2Node_Event_nextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_3) == 0x000060, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, CallFunc_BP_GetOwnerCommand_ReturnValue) == 0x000068, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::CallFunc_BP_GetOwnerCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, CallFunc_BP_GetParam_ReturnValue_2) == 0x000070, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::CallFunc_BP_GetParam_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, CallFunc_BP_GetMoveDirection_ReturnValue_1) == 0x000078, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::CallFunc_BP_GetMoveDirection_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, CallFunc_BP_GetOwnerState_ReturnValue) == 0x000088, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, CallFunc_BP_GetAnimation_ReturnValue_2) == 0x000090, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::CallFunc_BP_GetAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, CallFunc_BP_GetAnimation_ReturnValue_3) == 0x000098, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::CallFunc_BP_GetAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, CallFunc_BP_GetAnimation_ReturnValue_4) == 0x0000A0, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::CallFunc_BP_GetAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, CallFunc_BP_GetThrownedDirection_ReturnValue) == 0x0000A8, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::CallFunc_BP_GetThrownedDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_4) == 0x0000B8, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, CallFunc_BP_GetParam_ReturnValue_3) == 0x0000C0, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::CallFunc_BP_GetParam_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_5) == 0x0000C8, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned, K2Node_Event_prevAction) == 0x0000D0, "Member 'BP_ActionThrowned_C_ExecuteUbergraph_BP_ActionThrowned::K2Node_Event_prevAction' has a wrong offset!");

// Function BP_ActionThrowned.BP_ActionThrowned_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionThrowned_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionThrowned_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionThrowned_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionThrowned_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionThrowned_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionThrowned_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionThrowned_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

// Function BP_ActionThrowned.BP_ActionThrowned_C.BP_OnEndAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionThrowned_C_BP_OnEndAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionThrowned_C_BP_OnEndAction) == 0x000004, "Wrong alignment on BP_ActionThrowned_C_BP_OnEndAction");
static_assert(sizeof(BP_ActionThrowned_C_BP_OnEndAction) == 0x000008, "Wrong size on BP_ActionThrowned_C_BP_OnEndAction");
static_assert(offsetof(BP_ActionThrowned_C_BP_OnEndAction, NextAction) == 0x000000, "Member 'BP_ActionThrowned_C_BP_OnEndAction::NextAction' has a wrong offset!");

}

