#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionDamageGrabbed

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ActionDamageGrabbed.BP_ActionDamageGrabbed_C.ExecuteUbergraph_BP_ActionDamageGrabbed
// 0x0018 (0x0018 - 0x0000)
struct BP_ActionDamageGrabbed_C_ExecuteUbergraph_BP_ActionDamageGrabbed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageGrabbed_C_ExecuteUbergraph_BP_ActionDamageGrabbed) == 0x000008, "Wrong alignment on BP_ActionDamageGrabbed_C_ExecuteUbergraph_BP_ActionDamageGrabbed");
static_assert(sizeof(BP_ActionDamageGrabbed_C_ExecuteUbergraph_BP_ActionDamageGrabbed) == 0x000018, "Wrong size on BP_ActionDamageGrabbed_C_ExecuteUbergraph_BP_ActionDamageGrabbed");
static_assert(offsetof(BP_ActionDamageGrabbed_C_ExecuteUbergraph_BP_ActionDamageGrabbed, EntryPoint) == 0x000000, "Member 'BP_ActionDamageGrabbed_C_ExecuteUbergraph_BP_ActionDamageGrabbed::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageGrabbed_C_ExecuteUbergraph_BP_ActionDamageGrabbed, CallFunc_BP_GetOwnerState_ReturnValue) == 0x000008, "Member 'BP_ActionDamageGrabbed_C_ExecuteUbergraph_BP_ActionDamageGrabbed::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageGrabbed_C_ExecuteUbergraph_BP_ActionDamageGrabbed, K2Node_Event_prevAction) == 0x000010, "Member 'BP_ActionDamageGrabbed_C_ExecuteUbergraph_BP_ActionDamageGrabbed::K2Node_Event_prevAction' has a wrong offset!");

// Function BP_ActionDamageGrabbed.BP_ActionDamageGrabbed_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionDamageGrabbed_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageGrabbed_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionDamageGrabbed_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionDamageGrabbed_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionDamageGrabbed_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionDamageGrabbed_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionDamageGrabbed_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

}

