#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionDamageNoise

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InGameModule_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionDamageNoise.BP_ActionDamageNoise_C.ExecuteUbergraph_BP_ActionDamageNoise
// 0x00F0 (0x00F0 - 0x0000)
struct BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDamageParam                           CallFunc_BP_GetDamageParam_ReturnValue;            // 0x0020(0x00A4)(ConstParm, NoDestructor)
	class FName                                   K2Node_Event_nextAction;                           // 0x00C4(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateBattle*                     CallFunc_BP_GetPlayerStateBattle_ReturnValue;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsDead_ReturnValue;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsDying_ReturnValue;                   // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1;  // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise) == 0x000008, "Wrong alignment on BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise");
static_assert(sizeof(BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise) == 0x0000F0, "Wrong size on BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise");
static_assert(offsetof(BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise, EntryPoint) == 0x000000, "Member 'BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000008, "Member 'BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise, K2Node_Event_prevAction) == 0x000010, "Member 'BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise::K2Node_Event_prevAction' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise, CallFunc_BP_GetAnimation_ReturnValue) == 0x000018, "Member 'BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise::CallFunc_BP_GetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise, CallFunc_BP_GetDamageParam_ReturnValue) == 0x000020, "Member 'BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise::CallFunc_BP_GetDamageParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise, K2Node_Event_nextAction) == 0x0000C4, "Member 'BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise::K2Node_Event_nextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise, CallFunc_BP_GetPlayerStateBattle_ReturnValue) == 0x0000D0, "Member 'BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise::CallFunc_BP_GetPlayerStateBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise, CallFunc_BP_IsDead_ReturnValue) == 0x0000D8, "Member 'BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise::CallFunc_BP_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise, CallFunc_BP_IsDying_ReturnValue) == 0x0000D9, "Member 'BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise::CallFunc_BP_IsDying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise, CallFunc_BooleanOR_ReturnValue) == 0x0000DA, "Member 'BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise, CallFunc_BP_GetOwnerState_ReturnValue) == 0x0000E0, "Member 'BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1) == 0x0000E8, "Member 'BP_ActionDamageNoise_C_ExecuteUbergraph_BP_ActionDamageNoise::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1' has a wrong offset!");

// Function BP_ActionDamageNoise.BP_ActionDamageNoise_C.BP_OnEndAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionDamageNoise_C_BP_OnEndAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageNoise_C_BP_OnEndAction) == 0x000004, "Wrong alignment on BP_ActionDamageNoise_C_BP_OnEndAction");
static_assert(sizeof(BP_ActionDamageNoise_C_BP_OnEndAction) == 0x000008, "Wrong size on BP_ActionDamageNoise_C_BP_OnEndAction");
static_assert(offsetof(BP_ActionDamageNoise_C_BP_OnEndAction, NextAction) == 0x000000, "Member 'BP_ActionDamageNoise_C_BP_OnEndAction::NextAction' has a wrong offset!");

// Function BP_ActionDamageNoise.BP_ActionDamageNoise_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionDamageNoise_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageNoise_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionDamageNoise_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionDamageNoise_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionDamageNoise_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionDamageNoise_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionDamageNoise_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

// Function BP_ActionDamageNoise.BP_ActionDamageNoise_C.UpdateOnce
// 0x00A8 (0x00A8 - 0x0000)
struct BP_ActionDamageNoise_C_UpdateOnce final
{
public:
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue;          // 0x0000(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterDamageComponent*              CallFunc_BP_GetOwnerDamage_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDamageInfo                            CallFunc_BP_GetDamageInfo_ReturnValue;             // 0x0018(0x0080)(ConstParm, NoDestructor)
	struct FVector                                CallFunc_BP_GetDamageDirection_ReturnValue;        // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageNoise_C_UpdateOnce) == 0x000008, "Wrong alignment on BP_ActionDamageNoise_C_UpdateOnce");
static_assert(sizeof(BP_ActionDamageNoise_C_UpdateOnce) == 0x0000A8, "Wrong size on BP_ActionDamageNoise_C_UpdateOnce");
static_assert(offsetof(BP_ActionDamageNoise_C_UpdateOnce, CallFunc_BP_GetMoveDirection_ReturnValue) == 0x000000, "Member 'BP_ActionDamageNoise_C_UpdateOnce::CallFunc_BP_GetMoveDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNoise_C_UpdateOnce, CallFunc_BP_GetOwnerDamage_ReturnValue) == 0x000010, "Member 'BP_ActionDamageNoise_C_UpdateOnce::CallFunc_BP_GetOwnerDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNoise_C_UpdateOnce, CallFunc_BP_GetDamageInfo_ReturnValue) == 0x000018, "Member 'BP_ActionDamageNoise_C_UpdateOnce::CallFunc_BP_GetDamageInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNoise_C_UpdateOnce, CallFunc_BP_GetDamageDirection_ReturnValue) == 0x000098, "Member 'BP_ActionDamageNoise_C_UpdateOnce::CallFunc_BP_GetDamageDirection_ReturnValue' has a wrong offset!");

}

