#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionAttack_Finisher

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InGameModule_structs.hpp"
#include "InGameModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ActionAttack_Finisher.BP_ActionAttack_Finisher_C
// 0x0020 (0x0388 - 0x0368)
class UBP_ActionAttack_Finisher_C final : public UActionAttackFinisher
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TotalDeltaSeconds;                                 // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCompliteAttack;                                   // 0x0374(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCancelAction;                                     // 0x0375(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_376[0x2];                                      // 0x0376(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartCancelSeconds;                                // 0x0378(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateBattle*                     InteractedTarget;                                  // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ActionAttack_Finisher(int32 EntryPoint);
	void BP_OnBootDamage(bool bSuperArmor, bool bZeroDamage);
	void BP_OnHitAttackEvent(const struct FVector& HitLocation, class FName ProjectileName, class ACharacterBattle* HitCharacter);
	void BP_OnEndAction(const class FName& NextAction);
	void BP_OnNotificationAttackDedicatedEvent(EAttackDedicatedEventId ID);
	void RecoverGuardPointEvent_Remote();
	void TickWaitFinishEvent();
	void BP_OnChangeAttackPhase(int32 NextPhase);
	void BP_OnChangeAttackPhaseForRemote(int32 NextPhase);
	void BP_OnBeginAction(const class FName& PrevAction);
	void BP_ActionMain();
	void SetInteractedTarget(bool bInteract);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ActionAttack_Finisher_C">();
	}
	static class UBP_ActionAttack_Finisher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ActionAttack_Finisher_C>();
	}
};
static_assert(alignof(UBP_ActionAttack_Finisher_C) == 0x000008, "Wrong alignment on UBP_ActionAttack_Finisher_C");
static_assert(sizeof(UBP_ActionAttack_Finisher_C) == 0x000388, "Wrong size on UBP_ActionAttack_Finisher_C");
static_assert(offsetof(UBP_ActionAttack_Finisher_C, UberGraphFrame) == 0x000368, "Member 'UBP_ActionAttack_Finisher_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ActionAttack_Finisher_C, TotalDeltaSeconds) == 0x000370, "Member 'UBP_ActionAttack_Finisher_C::TotalDeltaSeconds' has a wrong offset!");
static_assert(offsetof(UBP_ActionAttack_Finisher_C, bCompliteAttack) == 0x000374, "Member 'UBP_ActionAttack_Finisher_C::bCompliteAttack' has a wrong offset!");
static_assert(offsetof(UBP_ActionAttack_Finisher_C, bCancelAction) == 0x000375, "Member 'UBP_ActionAttack_Finisher_C::bCancelAction' has a wrong offset!");
static_assert(offsetof(UBP_ActionAttack_Finisher_C, StartCancelSeconds) == 0x000378, "Member 'UBP_ActionAttack_Finisher_C::StartCancelSeconds' has a wrong offset!");
static_assert(offsetof(UBP_ActionAttack_Finisher_C, InteractedTarget) == 0x000380, "Member 'UBP_ActionAttack_Finisher_C::InteractedTarget' has a wrong offset!");

}

