#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionDamageNagaraWeak

#include "Basic.hpp"

#include "GameModule_structs.hpp"
#include "InGameModule_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionDamageNagaraWeak.BP_ActionDamageNagaraWeak_C.ExecuteUbergraph_BP_ActionDamageNagaraWeak
// 0x0030 (0x0030 - 0x0000)
struct BP_ActionDamageNagaraWeak_C_ExecuteUbergraph_BP_ActionDamageNagaraWeak final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  CallFunc_DecideAnimationId_NagaraAnimationId;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_nextAction;                           // 0x0024(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageNagaraWeak_C_ExecuteUbergraph_BP_ActionDamageNagaraWeak) == 0x000008, "Wrong alignment on BP_ActionDamageNagaraWeak_C_ExecuteUbergraph_BP_ActionDamageNagaraWeak");
static_assert(sizeof(BP_ActionDamageNagaraWeak_C_ExecuteUbergraph_BP_ActionDamageNagaraWeak) == 0x000030, "Wrong size on BP_ActionDamageNagaraWeak_C_ExecuteUbergraph_BP_ActionDamageNagaraWeak");
static_assert(offsetof(BP_ActionDamageNagaraWeak_C_ExecuteUbergraph_BP_ActionDamageNagaraWeak, EntryPoint) == 0x000000, "Member 'BP_ActionDamageNagaraWeak_C_ExecuteUbergraph_BP_ActionDamageNagaraWeak::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraWeak_C_ExecuteUbergraph_BP_ActionDamageNagaraWeak, CallFunc_BP_GetAnimation_ReturnValue) == 0x000008, "Member 'BP_ActionDamageNagaraWeak_C_ExecuteUbergraph_BP_ActionDamageNagaraWeak::CallFunc_BP_GetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraWeak_C_ExecuteUbergraph_BP_ActionDamageNagaraWeak, K2Node_Event_prevAction) == 0x000010, "Member 'BP_ActionDamageNagaraWeak_C_ExecuteUbergraph_BP_ActionDamageNagaraWeak::K2Node_Event_prevAction' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraWeak_C_ExecuteUbergraph_BP_ActionDamageNagaraWeak, CallFunc_BP_GetAnimation_ReturnValue_1) == 0x000018, "Member 'BP_ActionDamageNagaraWeak_C_ExecuteUbergraph_BP_ActionDamageNagaraWeak::CallFunc_BP_GetAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraWeak_C_ExecuteUbergraph_BP_ActionDamageNagaraWeak, CallFunc_DecideAnimationId_NagaraAnimationId) == 0x000020, "Member 'BP_ActionDamageNagaraWeak_C_ExecuteUbergraph_BP_ActionDamageNagaraWeak::CallFunc_DecideAnimationId_NagaraAnimationId' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraWeak_C_ExecuteUbergraph_BP_ActionDamageNagaraWeak, K2Node_Event_nextAction) == 0x000024, "Member 'BP_ActionDamageNagaraWeak_C_ExecuteUbergraph_BP_ActionDamageNagaraWeak::K2Node_Event_nextAction' has a wrong offset!");

// Function BP_ActionDamageNagaraWeak.BP_ActionDamageNagaraWeak_C.BP_OnEndAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionDamageNagaraWeak_C_BP_OnEndAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageNagaraWeak_C_BP_OnEndAction) == 0x000004, "Wrong alignment on BP_ActionDamageNagaraWeak_C_BP_OnEndAction");
static_assert(sizeof(BP_ActionDamageNagaraWeak_C_BP_OnEndAction) == 0x000008, "Wrong size on BP_ActionDamageNagaraWeak_C_BP_OnEndAction");
static_assert(offsetof(BP_ActionDamageNagaraWeak_C_BP_OnEndAction, NextAction) == 0x000000, "Member 'BP_ActionDamageNagaraWeak_C_BP_OnEndAction::NextAction' has a wrong offset!");

// Function BP_ActionDamageNagaraWeak.BP_ActionDamageNagaraWeak_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionDamageNagaraWeak_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageNagaraWeak_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionDamageNagaraWeak_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionDamageNagaraWeak_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionDamageNagaraWeak_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionDamageNagaraWeak_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionDamageNagaraWeak_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

// Function BP_ActionDamageNagaraWeak.BP_ActionDamageNagaraWeak_C.DecideAnimationId
// 0x0090 (0x0090 - 0x0000)
struct BP_ActionDamageNagaraWeak_C_DecideAnimationId final
{
public:
	EAnimationId                                  NagaraAnimationId;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDamageDirection                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  Temp_byte_Variable_4;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  Temp_byte_Variable_5;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  Temp_byte_Variable_6;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDamageInfo                            CallFunc_BP_GetDamageInfo_ReturnValue;             // 0x0008(0x0080)(ConstParm, NoDestructor)
	EAnimationId                                  K2Node_Select_Default;                             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageNagaraWeak_C_DecideAnimationId) == 0x000008, "Wrong alignment on BP_ActionDamageNagaraWeak_C_DecideAnimationId");
static_assert(sizeof(BP_ActionDamageNagaraWeak_C_DecideAnimationId) == 0x000090, "Wrong size on BP_ActionDamageNagaraWeak_C_DecideAnimationId");
static_assert(offsetof(BP_ActionDamageNagaraWeak_C_DecideAnimationId, NagaraAnimationId) == 0x000000, "Member 'BP_ActionDamageNagaraWeak_C_DecideAnimationId::NagaraAnimationId' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraWeak_C_DecideAnimationId, Temp_byte_Variable) == 0x000001, "Member 'BP_ActionDamageNagaraWeak_C_DecideAnimationId::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraWeak_C_DecideAnimationId, Temp_byte_Variable_1) == 0x000002, "Member 'BP_ActionDamageNagaraWeak_C_DecideAnimationId::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraWeak_C_DecideAnimationId, Temp_byte_Variable_2) == 0x000003, "Member 'BP_ActionDamageNagaraWeak_C_DecideAnimationId::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraWeak_C_DecideAnimationId, Temp_byte_Variable_3) == 0x000004, "Member 'BP_ActionDamageNagaraWeak_C_DecideAnimationId::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraWeak_C_DecideAnimationId, Temp_byte_Variable_4) == 0x000005, "Member 'BP_ActionDamageNagaraWeak_C_DecideAnimationId::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraWeak_C_DecideAnimationId, Temp_byte_Variable_5) == 0x000006, "Member 'BP_ActionDamageNagaraWeak_C_DecideAnimationId::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraWeak_C_DecideAnimationId, Temp_byte_Variable_6) == 0x000007, "Member 'BP_ActionDamageNagaraWeak_C_DecideAnimationId::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraWeak_C_DecideAnimationId, CallFunc_BP_GetDamageInfo_ReturnValue) == 0x000008, "Member 'BP_ActionDamageNagaraWeak_C_DecideAnimationId::CallFunc_BP_GetDamageInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraWeak_C_DecideAnimationId, K2Node_Select_Default) == 0x000088, "Member 'BP_ActionDamageNagaraWeak_C_DecideAnimationId::K2Node_Select_Default' has a wrong offset!");

// Function BP_ActionDamageNagaraWeak.BP_ActionDamageNagaraWeak_C.BP_IsEnableShiftAction
// 0x000C (0x000C - 0x0000)
struct BP_ActionDamageNagaraWeak_C_BP_IsEnableShiftAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionDamageNagaraWeak_C_BP_IsEnableShiftAction) == 0x000004, "Wrong alignment on BP_ActionDamageNagaraWeak_C_BP_IsEnableShiftAction");
static_assert(sizeof(BP_ActionDamageNagaraWeak_C_BP_IsEnableShiftAction) == 0x00000C, "Wrong size on BP_ActionDamageNagaraWeak_C_BP_IsEnableShiftAction");
static_assert(offsetof(BP_ActionDamageNagaraWeak_C_BP_IsEnableShiftAction, NextAction) == 0x000000, "Member 'BP_ActionDamageNagaraWeak_C_BP_IsEnableShiftAction::NextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraWeak_C_BP_IsEnableShiftAction, ReturnValue) == 0x000008, "Member 'BP_ActionDamageNagaraWeak_C_BP_IsEnableShiftAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraWeak_C_BP_IsEnableShiftAction, K2Node_SwitchName_CmpSuccess) == 0x000009, "Member 'BP_ActionDamageNagaraWeak_C_BP_IsEnableShiftAction::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

}

