#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionDashLand

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ActionDashLand.BP_ActionDashLand_C.ExecuteUbergraph_BP_ActionDashLand
// 0x0060 (0x0060 - 0x0000)
struct BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetIsEnableAttackDuringDash_ReturnValue; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BP_CalculatePenaltyTimeForLand_ReturnValue; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1;  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x0048(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterCommandComponent*             CallFunc_BP_GetOwnerCommand_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BP_GetMoveRate_ReturnValue;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand) == 0x000008, "Wrong alignment on BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand");
static_assert(sizeof(BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand) == 0x000060, "Wrong size on BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand");
static_assert(offsetof(BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand, EntryPoint) == 0x000000, "Member 'BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue) == 0x000008, "Member 'BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand, CallFunc_BP_GetIsEnableAttackDuringDash_ReturnValue) == 0x000010, "Member 'BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand::CallFunc_BP_GetIsEnableAttackDuringDash_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand, CallFunc_BP_GetAnimation_ReturnValue) == 0x000018, "Member 'BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand::CallFunc_BP_GetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000028, "Member 'BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand, CallFunc_BP_GetOwnerState_ReturnValue) == 0x000030, "Member 'BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand, CallFunc_BP_CalculatePenaltyTimeForLand_ReturnValue) == 0x000038, "Member 'BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand::CallFunc_BP_CalculatePenaltyTimeForLand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1) == 0x000040, "Member 'BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand, K2Node_Event_prevAction) == 0x000048, "Member 'BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand::K2Node_Event_prevAction' has a wrong offset!");
static_assert(offsetof(BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand, CallFunc_BP_GetOwnerCommand_ReturnValue) == 0x000050, "Member 'BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand::CallFunc_BP_GetOwnerCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand, CallFunc_BP_GetMoveRate_ReturnValue) == 0x000058, "Member 'BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand::CallFunc_BP_GetMoveRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00005C, "Member 'BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand, CallFunc_BooleanAND_ReturnValue) == 0x00005D, "Member 'BP_ActionDashLand_C_ExecuteUbergraph_BP_ActionDashLand::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_ActionDashLand.BP_ActionDashLand_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionDashLand_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDashLand_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionDashLand_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionDashLand_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionDashLand_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionDashLand_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionDashLand_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

}

