#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionDamageTeleportWeak

#include "Basic.hpp"

#include "GameModule_structs.hpp"
#include "InGameModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionDamageTeleportWeak.BP_ActionDamageTeleportWeak_C.ExecuteUbergraph_BP_ActionDamageTeleportWeak
// 0x00F8 (0x00F8 - 0x0000)
struct BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  CallFunc_DecideAnimationId_Animation_Id;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateBattle*                     CallFunc_BP_GetPlayerStateBattle_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsDead_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsDying_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_prevAction;                           // 0x001C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_1;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  CallFunc_DecideAnimationId_Animation_Id_1;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue;   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterConditionControlComponent*    CallFunc_BP_GetConditionControlComponent_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDamageParam                           CallFunc_BP_GetDamageParam_ReturnValue;            // 0x0050(0x00A4)(ConstParm, NoDestructor)
};
static_assert(alignof(BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak) == 0x000008, "Wrong alignment on BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak");
static_assert(sizeof(BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak) == 0x0000F8, "Wrong size on BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak, EntryPoint) == 0x000000, "Member 'BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak, CallFunc_DecideAnimationId_Animation_Id) == 0x000004, "Member 'BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak::CallFunc_DecideAnimationId_Animation_Id' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak, CallFunc_BP_GetPlayerStateBattle_ReturnValue) == 0x000008, "Member 'BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak::CallFunc_BP_GetPlayerStateBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak, CallFunc_BP_GetAnimation_ReturnValue) == 0x000010, "Member 'BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak::CallFunc_BP_GetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak, CallFunc_BP_IsDead_ReturnValue) == 0x000018, "Member 'BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak::CallFunc_BP_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak, CallFunc_BP_IsDying_ReturnValue) == 0x000019, "Member 'BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak::CallFunc_BP_IsDying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak, K2Node_Event_prevAction) == 0x00001C, "Member 'BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak::K2Node_Event_prevAction' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak, CallFunc_BooleanOR_ReturnValue) == 0x000024, "Member 'BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak, CallFunc_BP_GetOwnerState_ReturnValue) == 0x000028, "Member 'BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak, CallFunc_BP_GetAnimation_ReturnValue_1) == 0x000030, "Member 'BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak::CallFunc_BP_GetAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak, CallFunc_DecideAnimationId_Animation_Id_1) == 0x000038, "Member 'BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak::CallFunc_DecideAnimationId_Animation_Id_1' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000039, "Member 'BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue) == 0x000040, "Member 'BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak, CallFunc_BP_GetConditionControlComponent_ReturnValue) == 0x000048, "Member 'BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak::CallFunc_BP_GetConditionControlComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak, CallFunc_BP_GetDamageParam_ReturnValue) == 0x000050, "Member 'BP_ActionDamageTeleportWeak_C_ExecuteUbergraph_BP_ActionDamageTeleportWeak::CallFunc_BP_GetDamageParam_ReturnValue' has a wrong offset!");

// Function BP_ActionDamageTeleportWeak.BP_ActionDamageTeleportWeak_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionDamageTeleportWeak_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageTeleportWeak_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionDamageTeleportWeak_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionDamageTeleportWeak_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionDamageTeleportWeak_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionDamageTeleportWeak_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

// Function BP_ActionDamageTeleportWeak.BP_ActionDamageTeleportWeak_C.UpdateOnce
// 0x00A8 (0x00A8 - 0x0000)
struct BP_ActionDamageTeleportWeak_C_UpdateOnce final
{
public:
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue;          // 0x0000(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterDamageComponent*              CallFunc_BP_GetOwnerDamage_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDamageInfo                            CallFunc_BP_GetDamageInfo_ReturnValue;             // 0x0018(0x0080)(ConstParm, NoDestructor)
	struct FVector                                CallFunc_BP_GetDamageDirection_ReturnValue;        // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageTeleportWeak_C_UpdateOnce) == 0x000008, "Wrong alignment on BP_ActionDamageTeleportWeak_C_UpdateOnce");
static_assert(sizeof(BP_ActionDamageTeleportWeak_C_UpdateOnce) == 0x0000A8, "Wrong size on BP_ActionDamageTeleportWeak_C_UpdateOnce");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_UpdateOnce, CallFunc_BP_GetMoveDirection_ReturnValue) == 0x000000, "Member 'BP_ActionDamageTeleportWeak_C_UpdateOnce::CallFunc_BP_GetMoveDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_UpdateOnce, CallFunc_BP_GetOwnerDamage_ReturnValue) == 0x000010, "Member 'BP_ActionDamageTeleportWeak_C_UpdateOnce::CallFunc_BP_GetOwnerDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_UpdateOnce, CallFunc_BP_GetDamageInfo_ReturnValue) == 0x000018, "Member 'BP_ActionDamageTeleportWeak_C_UpdateOnce::CallFunc_BP_GetDamageInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_UpdateOnce, CallFunc_BP_GetDamageDirection_ReturnValue) == 0x000098, "Member 'BP_ActionDamageTeleportWeak_C_UpdateOnce::CallFunc_BP_GetDamageDirection_ReturnValue' has a wrong offset!");

// Function BP_ActionDamageTeleportWeak.BP_ActionDamageTeleportWeak_C.DecideAnimationId
// 0x0090 (0x0090 - 0x0000)
struct BP_ActionDamageTeleportWeak_C_DecideAnimationId final
{
public:
	EAnimationId                                  Animation_Id;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDamageDirection                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  Temp_byte_Variable_4;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  Temp_byte_Variable_5;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  Temp_byte_Variable_6;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDamageInfo                            CallFunc_BP_GetDamageInfo_ReturnValue;             // 0x0008(0x0080)(ConstParm, NoDestructor)
	EAnimationId                                  K2Node_Select_Default;                             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageTeleportWeak_C_DecideAnimationId) == 0x000008, "Wrong alignment on BP_ActionDamageTeleportWeak_C_DecideAnimationId");
static_assert(sizeof(BP_ActionDamageTeleportWeak_C_DecideAnimationId) == 0x000090, "Wrong size on BP_ActionDamageTeleportWeak_C_DecideAnimationId");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_DecideAnimationId, Animation_Id) == 0x000000, "Member 'BP_ActionDamageTeleportWeak_C_DecideAnimationId::Animation_Id' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_DecideAnimationId, Temp_byte_Variable) == 0x000001, "Member 'BP_ActionDamageTeleportWeak_C_DecideAnimationId::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_DecideAnimationId, Temp_byte_Variable_1) == 0x000002, "Member 'BP_ActionDamageTeleportWeak_C_DecideAnimationId::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_DecideAnimationId, Temp_byte_Variable_2) == 0x000003, "Member 'BP_ActionDamageTeleportWeak_C_DecideAnimationId::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_DecideAnimationId, Temp_byte_Variable_3) == 0x000004, "Member 'BP_ActionDamageTeleportWeak_C_DecideAnimationId::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_DecideAnimationId, Temp_byte_Variable_4) == 0x000005, "Member 'BP_ActionDamageTeleportWeak_C_DecideAnimationId::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_DecideAnimationId, Temp_byte_Variable_5) == 0x000006, "Member 'BP_ActionDamageTeleportWeak_C_DecideAnimationId::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_DecideAnimationId, Temp_byte_Variable_6) == 0x000007, "Member 'BP_ActionDamageTeleportWeak_C_DecideAnimationId::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_DecideAnimationId, CallFunc_BP_GetDamageInfo_ReturnValue) == 0x000008, "Member 'BP_ActionDamageTeleportWeak_C_DecideAnimationId::CallFunc_BP_GetDamageInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageTeleportWeak_C_DecideAnimationId, K2Node_Select_Default) == 0x000088, "Member 'BP_ActionDamageTeleportWeak_C_DecideAnimationId::K2Node_Select_Default' has a wrong offset!");

}

