#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionGuard

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CommonModule_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionGuard.BP_ActionGuard_C.ExecuteUbergraph_BP_ActionGuard
// 0x0070 (0x0070 - 0x0000)
struct BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterAttackComponent*              CallFunc_BP_GetAttackComponent_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetAttackTargetLocation_ReturnValue;   // 0x0020(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_nextAction;                           // 0x002C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_1;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsAimingMode_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_2;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BP_GetCurrentPlayLength_ReturnValue;      // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterId                                  CallFunc_BP_GetCharacterId_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard) == 0x000008, "Wrong alignment on BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard");
static_assert(sizeof(BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard) == 0x000070, "Wrong size on BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard");
static_assert(offsetof(BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard, EntryPoint) == 0x000000, "Member 'BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard, CallFunc_BP_GetAnimation_ReturnValue) == 0x000008, "Member 'BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard::CallFunc_BP_GetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard, K2Node_Event_prevAction) == 0x000010, "Member 'BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard::K2Node_Event_prevAction' has a wrong offset!");
static_assert(offsetof(BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard, CallFunc_BP_GetAttackComponent_ReturnValue) == 0x000018, "Member 'BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard::CallFunc_BP_GetAttackComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard, CallFunc_BP_GetAttackTargetLocation_ReturnValue) == 0x000020, "Member 'BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard::CallFunc_BP_GetAttackTargetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard, K2Node_Event_nextAction) == 0x00002C, "Member 'BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard::K2Node_Event_nextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard, CallFunc_BP_GetAnimation_ReturnValue_1) == 0x000038, "Member 'BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard::CallFunc_BP_GetAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard, CallFunc_BP_GetOwnerState_ReturnValue) == 0x000040, "Member 'BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard, CallFunc_BP_IsAimingMode_ReturnValue) == 0x000048, "Member 'BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard::CallFunc_BP_IsAimingMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard, CallFunc_BP_GetAnimation_ReturnValue_2) == 0x000050, "Member 'BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard::CallFunc_BP_GetAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard, CallFunc_BP_GetCurrentPlayLength_ReturnValue) == 0x000058, "Member 'BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard::CallFunc_BP_GetCurrentPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue) == 0x000060, "Member 'BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard, CallFunc_BP_GetCharacterId_ReturnValue) == 0x000068, "Member 'BP_ActionGuard_C_ExecuteUbergraph_BP_ActionGuard::CallFunc_BP_GetCharacterId_ReturnValue' has a wrong offset!");

// Function BP_ActionGuard.BP_ActionGuard_C.BP_OnEndAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionGuard_C_BP_OnEndAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionGuard_C_BP_OnEndAction) == 0x000004, "Wrong alignment on BP_ActionGuard_C_BP_OnEndAction");
static_assert(sizeof(BP_ActionGuard_C_BP_OnEndAction) == 0x000008, "Wrong size on BP_ActionGuard_C_BP_OnEndAction");
static_assert(offsetof(BP_ActionGuard_C_BP_OnEndAction, NextAction) == 0x000000, "Member 'BP_ActionGuard_C_BP_OnEndAction::NextAction' has a wrong offset!");

// Function BP_ActionGuard.BP_ActionGuard_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionGuard_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionGuard_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionGuard_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionGuard_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionGuard_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionGuard_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionGuard_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

}

