#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionDamageNagaraGuard

#include "Basic.hpp"

#include "CommonModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InGameModule_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionDamageNagaraGuard.BP_ActionDamageNagaraGuard_C.ExecuteUbergraph_BP_ActionDamageNagaraGuard
// 0x0120 (0x0120 - 0x0000)
struct BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x0014(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_1;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterId                                  CallFunc_BP_GetCharacterId_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_nextAction;                           // 0x003C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterDamageComponent*              CallFunc_BP_GetOwnerDamage_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetDamageDirection_ReturnValue;        // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_2;            // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageInfo                            CallFunc_BP_GetDamageInfo_ReturnValue;             // 0x0098(0x0080)(ConstParm, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard) == 0x000008, "Wrong alignment on BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard");
static_assert(sizeof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard) == 0x000120, "Wrong size on BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard, EntryPoint) == 0x000000, "Member 'BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard, CallFunc_BP_GetAnimation_ReturnValue) == 0x000008, "Member 'BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard::CallFunc_BP_GetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard, Temp_float_Variable) == 0x000010, "Member 'BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard, K2Node_Event_prevAction) == 0x000014, "Member 'BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard::K2Node_Event_prevAction' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue) == 0x000020, "Member 'BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard, CallFunc_BP_GetAnimation_ReturnValue_1) == 0x000028, "Member 'BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard::CallFunc_BP_GetAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard, CallFunc_BP_GetCharacterId_ReturnValue) == 0x000030, "Member 'BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard::CallFunc_BP_GetCharacterId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard, Temp_float_Variable_1) == 0x000034, "Member 'BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard, Temp_bool_Variable) == 0x000038, "Member 'BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard, K2Node_Event_nextAction) == 0x00003C, "Member 'BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard::K2Node_Event_nextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard, CallFunc_BP_GetOwnerDamage_ReturnValue) == 0x000048, "Member 'BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard::CallFunc_BP_GetOwnerDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_1) == 0x000050, "Member 'BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard, CallFunc_BP_GetDamageDirection_ReturnValue) == 0x000058, "Member 'BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard::CallFunc_BP_GetDamageDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000064, "Member 'BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000070, "Member 'BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard, CallFunc_BP_GetAnimation_ReturnValue_2) == 0x000080, "Member 'BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard::CallFunc_BP_GetAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard, CallFunc_Add_VectorVector_ReturnValue) == 0x000088, "Member 'BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard, CallFunc_BP_GetDamageInfo_ReturnValue) == 0x000098, "Member 'BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard::CallFunc_BP_GetDamageInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000118, "Member 'BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard, K2Node_Select_Default) == 0x00011C, "Member 'BP_ActionDamageNagaraGuard_C_ExecuteUbergraph_BP_ActionDamageNagaraGuard::K2Node_Select_Default' has a wrong offset!");

// Function BP_ActionDamageNagaraGuard.BP_ActionDamageNagaraGuard_C.BP_OnEndAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionDamageNagaraGuard_C_BP_OnEndAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageNagaraGuard_C_BP_OnEndAction) == 0x000004, "Wrong alignment on BP_ActionDamageNagaraGuard_C_BP_OnEndAction");
static_assert(sizeof(BP_ActionDamageNagaraGuard_C_BP_OnEndAction) == 0x000008, "Wrong size on BP_ActionDamageNagaraGuard_C_BP_OnEndAction");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_BP_OnEndAction, NextAction) == 0x000000, "Member 'BP_ActionDamageNagaraGuard_C_BP_OnEndAction::NextAction' has a wrong offset!");

// Function BP_ActionDamageNagaraGuard.BP_ActionDamageNagaraGuard_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionDamageNagaraGuard_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageNagaraGuard_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionDamageNagaraGuard_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionDamageNagaraGuard_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionDamageNagaraGuard_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionDamageNagaraGuard_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

// Function BP_ActionDamageNagaraGuard.BP_ActionDamageNagaraGuard_C.BP_IsEnableShiftAction
// 0x000C (0x000C - 0x0000)
struct BP_ActionDamageNagaraGuard_C_BP_IsEnableShiftAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionDamageNagaraGuard_C_BP_IsEnableShiftAction) == 0x000004, "Wrong alignment on BP_ActionDamageNagaraGuard_C_BP_IsEnableShiftAction");
static_assert(sizeof(BP_ActionDamageNagaraGuard_C_BP_IsEnableShiftAction) == 0x00000C, "Wrong size on BP_ActionDamageNagaraGuard_C_BP_IsEnableShiftAction");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_BP_IsEnableShiftAction, NextAction) == 0x000000, "Member 'BP_ActionDamageNagaraGuard_C_BP_IsEnableShiftAction::NextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_BP_IsEnableShiftAction, ReturnValue) == 0x000008, "Member 'BP_ActionDamageNagaraGuard_C_BP_IsEnableShiftAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageNagaraGuard_C_BP_IsEnableShiftAction, K2Node_SwitchName_CmpSuccess) == 0x000009, "Member 'BP_ActionDamageNagaraGuard_C_BP_IsEnableShiftAction::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

}

