#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionDamageDyingWeak

#include "Basic.hpp"

#include "GameModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionDamageDyingWeak.BP_ActionDamageDyingWeak_C.ExecuteUbergraph_BP_ActionDamageDyingWeak
// 0x0030 (0x0030 - 0x0000)
struct BP_ActionDamageDyingWeak_C_ExecuteUbergraph_BP_ActionDamageDyingWeak final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_1;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  CallFunc_DecideAnimationId_Animation_Id;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageDyingWeak_C_ExecuteUbergraph_BP_ActionDamageDyingWeak) == 0x000008, "Wrong alignment on BP_ActionDamageDyingWeak_C_ExecuteUbergraph_BP_ActionDamageDyingWeak");
static_assert(sizeof(BP_ActionDamageDyingWeak_C_ExecuteUbergraph_BP_ActionDamageDyingWeak) == 0x000030, "Wrong size on BP_ActionDamageDyingWeak_C_ExecuteUbergraph_BP_ActionDamageDyingWeak");
static_assert(offsetof(BP_ActionDamageDyingWeak_C_ExecuteUbergraph_BP_ActionDamageDyingWeak, EntryPoint) == 0x000000, "Member 'BP_ActionDamageDyingWeak_C_ExecuteUbergraph_BP_ActionDamageDyingWeak::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageDyingWeak_C_ExecuteUbergraph_BP_ActionDamageDyingWeak, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000008, "Member 'BP_ActionDamageDyingWeak_C_ExecuteUbergraph_BP_ActionDamageDyingWeak::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageDyingWeak_C_ExecuteUbergraph_BP_ActionDamageDyingWeak, K2Node_Event_prevAction) == 0x000010, "Member 'BP_ActionDamageDyingWeak_C_ExecuteUbergraph_BP_ActionDamageDyingWeak::K2Node_Event_prevAction' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageDyingWeak_C_ExecuteUbergraph_BP_ActionDamageDyingWeak, CallFunc_BP_GetAnimation_ReturnValue) == 0x000018, "Member 'BP_ActionDamageDyingWeak_C_ExecuteUbergraph_BP_ActionDamageDyingWeak::CallFunc_BP_GetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageDyingWeak_C_ExecuteUbergraph_BP_ActionDamageDyingWeak, CallFunc_BP_GetAnimation_ReturnValue_1) == 0x000020, "Member 'BP_ActionDamageDyingWeak_C_ExecuteUbergraph_BP_ActionDamageDyingWeak::CallFunc_BP_GetAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageDyingWeak_C_ExecuteUbergraph_BP_ActionDamageDyingWeak, CallFunc_DecideAnimationId_Animation_Id) == 0x000028, "Member 'BP_ActionDamageDyingWeak_C_ExecuteUbergraph_BP_ActionDamageDyingWeak::CallFunc_DecideAnimationId_Animation_Id' has a wrong offset!");

// Function BP_ActionDamageDyingWeak.BP_ActionDamageDyingWeak_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionDamageDyingWeak_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageDyingWeak_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionDamageDyingWeak_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionDamageDyingWeak_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionDamageDyingWeak_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionDamageDyingWeak_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionDamageDyingWeak_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

// Function BP_ActionDamageDyingWeak.BP_ActionDamageDyingWeak_C.UpdateOnce
// 0x0020 (0x0020 - 0x0000)
struct BP_ActionDamageDyingWeak_C_UpdateOnce final
{
public:
	class UCharacterDamageComponent*              CallFunc_BP_GetOwnerDamage_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue;          // 0x0008(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetDamageDirection_ReturnValue;        // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageDyingWeak_C_UpdateOnce) == 0x000008, "Wrong alignment on BP_ActionDamageDyingWeak_C_UpdateOnce");
static_assert(sizeof(BP_ActionDamageDyingWeak_C_UpdateOnce) == 0x000020, "Wrong size on BP_ActionDamageDyingWeak_C_UpdateOnce");
static_assert(offsetof(BP_ActionDamageDyingWeak_C_UpdateOnce, CallFunc_BP_GetOwnerDamage_ReturnValue) == 0x000000, "Member 'BP_ActionDamageDyingWeak_C_UpdateOnce::CallFunc_BP_GetOwnerDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageDyingWeak_C_UpdateOnce, CallFunc_BP_GetMoveDirection_ReturnValue) == 0x000008, "Member 'BP_ActionDamageDyingWeak_C_UpdateOnce::CallFunc_BP_GetMoveDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageDyingWeak_C_UpdateOnce, CallFunc_BP_GetDamageDirection_ReturnValue) == 0x000014, "Member 'BP_ActionDamageDyingWeak_C_UpdateOnce::CallFunc_BP_GetDamageDirection_ReturnValue' has a wrong offset!");

// Function BP_ActionDamageDyingWeak.BP_ActionDamageDyingWeak_C.DecideAnimationId
// 0x0001 (0x0001 - 0x0000)
struct BP_ActionDamageDyingWeak_C_DecideAnimationId final
{
public:
	EAnimationId                                  Animation_Id;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageDyingWeak_C_DecideAnimationId) == 0x000001, "Wrong alignment on BP_ActionDamageDyingWeak_C_DecideAnimationId");
static_assert(sizeof(BP_ActionDamageDyingWeak_C_DecideAnimationId) == 0x000001, "Wrong size on BP_ActionDamageDyingWeak_C_DecideAnimationId");
static_assert(offsetof(BP_ActionDamageDyingWeak_C_DecideAnimationId, Animation_Id) == 0x000000, "Member 'BP_ActionDamageDyingWeak_C_DecideAnimationId::Animation_Id' has a wrong offset!");

}

