#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionSuperJumpFall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InGameModule_classes.hpp"
#include "GameModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ActionSuperJumpFall.BP_ActionSuperJumpFall_C
// 0x0018 (0x01C8 - 0x01B0)
class UBP_ActionSuperJumpFall_C final : public UActionNormalBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         BlendInTime;                                       // 0x01B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                JumpPadNormal;                                     // 0x01BC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ActionSuperJumpFall(int32 EntryPoint);
	void BP_OnLandingEvent();
	void BP_ActionMain();
	void BP_OnBeginAction(const class FName& PrevAction);
	void UpdateCoMinusRoutine();
	void BP_OnEndAction(const class FName& NextAction);

	bool BP_IsEnableShiftAction(const class FName& NextAction) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ActionSuperJumpFall_C">();
	}
	static class UBP_ActionSuperJumpFall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ActionSuperJumpFall_C>();
	}
};
static_assert(alignof(UBP_ActionSuperJumpFall_C) == 0x000008, "Wrong alignment on UBP_ActionSuperJumpFall_C");
static_assert(sizeof(UBP_ActionSuperJumpFall_C) == 0x0001C8, "Wrong size on UBP_ActionSuperJumpFall_C");
static_assert(offsetof(UBP_ActionSuperJumpFall_C, UberGraphFrame) == 0x0001B0, "Member 'UBP_ActionSuperJumpFall_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ActionSuperJumpFall_C, BlendInTime) == 0x0001B8, "Member 'UBP_ActionSuperJumpFall_C::BlendInTime' has a wrong offset!");
static_assert(offsetof(UBP_ActionSuperJumpFall_C, JumpPadNormal) == 0x0001BC, "Member 'UBP_ActionSuperJumpFall_C::JumpPadNormal' has a wrong offset!");

}

