#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionAttack

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionAttack.BP_ActionAttack_C.ExecuteUbergraph_BP_ActionAttack
// 0x0060 (0x0060 - 0x0000)
struct BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BP_GetCurrentPlayLength_ReturnValue;      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterAttackComponent*              CallFunc_BP_GetAttackComponent_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetAttackTargetLocation_ReturnValue;   // 0x0030(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_nextAction;                           // 0x003C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_2;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsAimingMode_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack) == 0x000008, "Wrong alignment on BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack");
static_assert(sizeof(BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack) == 0x000060, "Wrong size on BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack");
static_assert(offsetof(BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack, EntryPoint) == 0x000000, "Member 'BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack, CallFunc_BP_GetAnimation_ReturnValue) == 0x000008, "Member 'BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack::CallFunc_BP_GetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack, CallFunc_BP_GetCurrentPlayLength_ReturnValue) == 0x000010, "Member 'BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack::CallFunc_BP_GetCurrentPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack, CallFunc_BP_GetAnimation_ReturnValue_1) == 0x000018, "Member 'BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack::CallFunc_BP_GetAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack, K2Node_Event_prevAction) == 0x000020, "Member 'BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack::K2Node_Event_prevAction' has a wrong offset!");
static_assert(offsetof(BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack, CallFunc_BP_GetAttackComponent_ReturnValue) == 0x000028, "Member 'BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack::CallFunc_BP_GetAttackComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack, CallFunc_BP_GetAttackTargetLocation_ReturnValue) == 0x000030, "Member 'BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack::CallFunc_BP_GetAttackTargetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack, K2Node_Event_nextAction) == 0x00003C, "Member 'BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack::K2Node_Event_nextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack, CallFunc_BP_GetAnimation_ReturnValue_2) == 0x000048, "Member 'BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack::CallFunc_BP_GetAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack, CallFunc_BP_GetOwnerState_ReturnValue) == 0x000050, "Member 'BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack, CallFunc_BP_IsAimingMode_ReturnValue) == 0x000058, "Member 'BP_ActionAttack_C_ExecuteUbergraph_BP_ActionAttack::CallFunc_BP_IsAimingMode_ReturnValue' has a wrong offset!");

// Function BP_ActionAttack.BP_ActionAttack_C.BP_OnEndAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionAttack_C_BP_OnEndAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionAttack_C_BP_OnEndAction) == 0x000004, "Wrong alignment on BP_ActionAttack_C_BP_OnEndAction");
static_assert(sizeof(BP_ActionAttack_C_BP_OnEndAction) == 0x000008, "Wrong size on BP_ActionAttack_C_BP_OnEndAction");
static_assert(offsetof(BP_ActionAttack_C_BP_OnEndAction, NextAction) == 0x000000, "Member 'BP_ActionAttack_C_BP_OnEndAction::NextAction' has a wrong offset!");

// Function BP_ActionAttack.BP_ActionAttack_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionAttack_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionAttack_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionAttack_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionAttack_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionAttack_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionAttack_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionAttack_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

}

