#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionDamageGuard

#include "Basic.hpp"

#include "GameModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionDamageGuard.BP_ActionDamageGuard_C.ExecuteUbergraph_BP_ActionDamageGuard
// 0x0028 (0x0028 - 0x0000)
struct BP_ActionDamageGuard_C_ExecuteUbergraph_BP_ActionDamageGuard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  CallFunc_DecideAnimationId_Animation_Id;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageGuard_C_ExecuteUbergraph_BP_ActionDamageGuard) == 0x000008, "Wrong alignment on BP_ActionDamageGuard_C_ExecuteUbergraph_BP_ActionDamageGuard");
static_assert(sizeof(BP_ActionDamageGuard_C_ExecuteUbergraph_BP_ActionDamageGuard) == 0x000028, "Wrong size on BP_ActionDamageGuard_C_ExecuteUbergraph_BP_ActionDamageGuard");
static_assert(offsetof(BP_ActionDamageGuard_C_ExecuteUbergraph_BP_ActionDamageGuard, EntryPoint) == 0x000000, "Member 'BP_ActionDamageGuard_C_ExecuteUbergraph_BP_ActionDamageGuard::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageGuard_C_ExecuteUbergraph_BP_ActionDamageGuard, CallFunc_BP_GetOwnerState_ReturnValue) == 0x000008, "Member 'BP_ActionDamageGuard_C_ExecuteUbergraph_BP_ActionDamageGuard::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageGuard_C_ExecuteUbergraph_BP_ActionDamageGuard, K2Node_Event_prevAction) == 0x000010, "Member 'BP_ActionDamageGuard_C_ExecuteUbergraph_BP_ActionDamageGuard::K2Node_Event_prevAction' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageGuard_C_ExecuteUbergraph_BP_ActionDamageGuard, CallFunc_BP_GetAnimation_ReturnValue) == 0x000018, "Member 'BP_ActionDamageGuard_C_ExecuteUbergraph_BP_ActionDamageGuard::CallFunc_BP_GetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageGuard_C_ExecuteUbergraph_BP_ActionDamageGuard, CallFunc_DecideAnimationId_Animation_Id) == 0x000020, "Member 'BP_ActionDamageGuard_C_ExecuteUbergraph_BP_ActionDamageGuard::CallFunc_DecideAnimationId_Animation_Id' has a wrong offset!");

// Function BP_ActionDamageGuard.BP_ActionDamageGuard_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionDamageGuard_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageGuard_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionDamageGuard_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionDamageGuard_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionDamageGuard_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionDamageGuard_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionDamageGuard_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

// Function BP_ActionDamageGuard.BP_ActionDamageGuard_C.UpdateOnce
// 0x000C (0x000C - 0x0000)
struct BP_ActionDamageGuard_C_UpdateOnce final
{
public:
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue;          // 0x0000(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageGuard_C_UpdateOnce) == 0x000004, "Wrong alignment on BP_ActionDamageGuard_C_UpdateOnce");
static_assert(sizeof(BP_ActionDamageGuard_C_UpdateOnce) == 0x00000C, "Wrong size on BP_ActionDamageGuard_C_UpdateOnce");
static_assert(offsetof(BP_ActionDamageGuard_C_UpdateOnce, CallFunc_BP_GetMoveDirection_ReturnValue) == 0x000000, "Member 'BP_ActionDamageGuard_C_UpdateOnce::CallFunc_BP_GetMoveDirection_ReturnValue' has a wrong offset!");

// Function BP_ActionDamageGuard.BP_ActionDamageGuard_C.DecideAnimationId
// 0x0018 (0x0018 - 0x0000)
struct BP_ActionDamageGuard_C_DecideAnimationId final
{
public:
	EAnimationId                                  Animation_Id;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAnimationId                                  Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsOnGround_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAnimationId                                  K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageGuard_C_DecideAnimationId) == 0x000008, "Wrong alignment on BP_ActionDamageGuard_C_DecideAnimationId");
static_assert(sizeof(BP_ActionDamageGuard_C_DecideAnimationId) == 0x000018, "Wrong size on BP_ActionDamageGuard_C_DecideAnimationId");
static_assert(offsetof(BP_ActionDamageGuard_C_DecideAnimationId, Animation_Id) == 0x000000, "Member 'BP_ActionDamageGuard_C_DecideAnimationId::Animation_Id' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageGuard_C_DecideAnimationId, Temp_bool_Variable) == 0x000001, "Member 'BP_ActionDamageGuard_C_DecideAnimationId::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageGuard_C_DecideAnimationId, Temp_byte_Variable) == 0x000002, "Member 'BP_ActionDamageGuard_C_DecideAnimationId::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageGuard_C_DecideAnimationId, Temp_byte_Variable_1) == 0x000003, "Member 'BP_ActionDamageGuard_C_DecideAnimationId::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageGuard_C_DecideAnimationId, CallFunc_BP_GetOwnerState_ReturnValue) == 0x000008, "Member 'BP_ActionDamageGuard_C_DecideAnimationId::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageGuard_C_DecideAnimationId, CallFunc_BP_IsOnGround_ReturnValue) == 0x000010, "Member 'BP_ActionDamageGuard_C_DecideAnimationId::CallFunc_BP_IsOnGround_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageGuard_C_DecideAnimationId, K2Node_Select_Default) == 0x000011, "Member 'BP_ActionDamageGuard_C_DecideAnimationId::K2Node_Select_Default' has a wrong offset!");

}

