#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionRunEnd

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ActionRunEnd.BP_ActionRunEnd_C.ExecuteUbergraph_BP_ActionRunEnd
// 0x0030 (0x0030 - 0x0000)
struct BP_ActionRunEnd_C_ExecuteUbergraph_BP_ActionRunEnd final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionRunEnd_C_ExecuteUbergraph_BP_ActionRunEnd) == 0x000008, "Wrong alignment on BP_ActionRunEnd_C_ExecuteUbergraph_BP_ActionRunEnd");
static_assert(sizeof(BP_ActionRunEnd_C_ExecuteUbergraph_BP_ActionRunEnd) == 0x000030, "Wrong size on BP_ActionRunEnd_C_ExecuteUbergraph_BP_ActionRunEnd");
static_assert(offsetof(BP_ActionRunEnd_C_ExecuteUbergraph_BP_ActionRunEnd, EntryPoint) == 0x000000, "Member 'BP_ActionRunEnd_C_ExecuteUbergraph_BP_ActionRunEnd::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionRunEnd_C_ExecuteUbergraph_BP_ActionRunEnd, CallFunc_BP_GetOwnerState_ReturnValue) == 0x000008, "Member 'BP_ActionRunEnd_C_ExecuteUbergraph_BP_ActionRunEnd::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionRunEnd_C_ExecuteUbergraph_BP_ActionRunEnd, K2Node_Event_prevAction) == 0x000010, "Member 'BP_ActionRunEnd_C_ExecuteUbergraph_BP_ActionRunEnd::K2Node_Event_prevAction' has a wrong offset!");
static_assert(offsetof(BP_ActionRunEnd_C_ExecuteUbergraph_BP_ActionRunEnd, CallFunc_BP_GetAnimation_ReturnValue) == 0x000018, "Member 'BP_ActionRunEnd_C_ExecuteUbergraph_BP_ActionRunEnd::CallFunc_BP_GetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionRunEnd_C_ExecuteUbergraph_BP_ActionRunEnd, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000020, "Member 'BP_ActionRunEnd_C_ExecuteUbergraph_BP_ActionRunEnd::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionRunEnd_C_ExecuteUbergraph_BP_ActionRunEnd, CallFunc_BP_GetParam_ReturnValue) == 0x000028, "Member 'BP_ActionRunEnd_C_ExecuteUbergraph_BP_ActionRunEnd::CallFunc_BP_GetParam_ReturnValue' has a wrong offset!");

// Function BP_ActionRunEnd.BP_ActionRunEnd_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionRunEnd_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionRunEnd_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionRunEnd_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionRunEnd_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionRunEnd_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionRunEnd_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionRunEnd_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

// Function BP_ActionRunEnd.BP_ActionRunEnd_C.BP_IsEnableShiftAction
// 0x000C (0x000C - 0x0000)
struct BP_ActionRunEnd_C_BP_IsEnableShiftAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionRunEnd_C_BP_IsEnableShiftAction) == 0x000004, "Wrong alignment on BP_ActionRunEnd_C_BP_IsEnableShiftAction");
static_assert(sizeof(BP_ActionRunEnd_C_BP_IsEnableShiftAction) == 0x00000C, "Wrong size on BP_ActionRunEnd_C_BP_IsEnableShiftAction");
static_assert(offsetof(BP_ActionRunEnd_C_BP_IsEnableShiftAction, NextAction) == 0x000000, "Member 'BP_ActionRunEnd_C_BP_IsEnableShiftAction::NextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionRunEnd_C_BP_IsEnableShiftAction, ReturnValue) == 0x000008, "Member 'BP_ActionRunEnd_C_BP_IsEnableShiftAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionRunEnd_C_BP_IsEnableShiftAction, K2Node_SwitchName_CmpSuccess) == 0x000009, "Member 'BP_ActionRunEnd_C_BP_IsEnableShiftAction::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

}

