#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionDamageRecover

#include "Basic.hpp"

#include "InGameModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionDamageRecover.BP_ActionDamageRecover_C.ExecuteUbergraph_BP_ActionDamageRecover
// 0x00F0 (0x00F0 - 0x0000)
struct BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageInfo                            CallFunc_BP_GetDamageInfo_ReturnValue;             // 0x0008(0x0080)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterCommandComponent*             CallFunc_BP_GetOwnerCommand_ReturnValue;           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue;          // 0x00A8(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x00C8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterDamageComponent*              CallFunc_BP_GetOwnerDamage_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_nextAction;                           // 0x00D8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue_1;           // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_1;            // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover) == 0x000008, "Wrong alignment on BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover");
static_assert(sizeof(BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover) == 0x0000F0, "Wrong size on BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover");
static_assert(offsetof(BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover, EntryPoint) == 0x000000, "Member 'BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover, CallFunc_BP_GetDamageInfo_ReturnValue) == 0x000008, "Member 'BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover::CallFunc_BP_GetDamageInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00008C, "Member 'BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover, CallFunc_BP_GetOwnerCommand_ReturnValue) == 0x000098, "Member 'BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover::CallFunc_BP_GetOwnerCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x0000A0, "Member 'BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover, CallFunc_BP_GetMoveDirection_ReturnValue) == 0x0000A8, "Member 'BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover::CallFunc_BP_GetMoveDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover, CallFunc_BP_GetAnimation_ReturnValue) == 0x0000B8, "Member 'BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover::CallFunc_BP_GetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover, CallFunc_BP_GetOwnerState_ReturnValue) == 0x0000C0, "Member 'BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover, K2Node_Event_prevAction) == 0x0000C8, "Member 'BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover::K2Node_Event_prevAction' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover, CallFunc_BP_GetOwnerDamage_ReturnValue) == 0x0000D0, "Member 'BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover::CallFunc_BP_GetOwnerDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover, K2Node_Event_nextAction) == 0x0000D8, "Member 'BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover::K2Node_Event_nextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover, CallFunc_BP_GetOwnerState_ReturnValue_1) == 0x0000E0, "Member 'BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover::CallFunc_BP_GetOwnerState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover, CallFunc_BP_GetAnimation_ReturnValue_1) == 0x0000E8, "Member 'BP_ActionDamageRecover_C_ExecuteUbergraph_BP_ActionDamageRecover::CallFunc_BP_GetAnimation_ReturnValue_1' has a wrong offset!");

// Function BP_ActionDamageRecover.BP_ActionDamageRecover_C.BP_OnEndAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionDamageRecover_C_BP_OnEndAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageRecover_C_BP_OnEndAction) == 0x000004, "Wrong alignment on BP_ActionDamageRecover_C_BP_OnEndAction");
static_assert(sizeof(BP_ActionDamageRecover_C_BP_OnEndAction) == 0x000008, "Wrong size on BP_ActionDamageRecover_C_BP_OnEndAction");
static_assert(offsetof(BP_ActionDamageRecover_C_BP_OnEndAction, NextAction) == 0x000000, "Member 'BP_ActionDamageRecover_C_BP_OnEndAction::NextAction' has a wrong offset!");

// Function BP_ActionDamageRecover.BP_ActionDamageRecover_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionDamageRecover_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDamageRecover_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionDamageRecover_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionDamageRecover_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionDamageRecover_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionDamageRecover_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionDamageRecover_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

}

