#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionDyingIdle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionDyingIdle.BP_ActionDyingIdle_C.ExecuteUbergraph_BP_ActionDyingIdle
// 0x0028 (0x0028 - 0x0000)
struct BP_ActionDyingIdle_C_ExecuteUbergraph_BP_ActionDyingIdle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDyingIdle_C_ExecuteUbergraph_BP_ActionDyingIdle) == 0x000008, "Wrong alignment on BP_ActionDyingIdle_C_ExecuteUbergraph_BP_ActionDyingIdle");
static_assert(sizeof(BP_ActionDyingIdle_C_ExecuteUbergraph_BP_ActionDyingIdle) == 0x000028, "Wrong size on BP_ActionDyingIdle_C_ExecuteUbergraph_BP_ActionDyingIdle");
static_assert(offsetof(BP_ActionDyingIdle_C_ExecuteUbergraph_BP_ActionDyingIdle, EntryPoint) == 0x000000, "Member 'BP_ActionDyingIdle_C_ExecuteUbergraph_BP_ActionDyingIdle::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionDyingIdle_C_ExecuteUbergraph_BP_ActionDyingIdle, CallFunc_BP_GetOwnerState_ReturnValue) == 0x000008, "Member 'BP_ActionDyingIdle_C_ExecuteUbergraph_BP_ActionDyingIdle::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDyingIdle_C_ExecuteUbergraph_BP_ActionDyingIdle, K2Node_Event_prevAction) == 0x000010, "Member 'BP_ActionDyingIdle_C_ExecuteUbergraph_BP_ActionDyingIdle::K2Node_Event_prevAction' has a wrong offset!");
static_assert(offsetof(BP_ActionDyingIdle_C_ExecuteUbergraph_BP_ActionDyingIdle, CallFunc_BP_GetAnimation_ReturnValue) == 0x000018, "Member 'BP_ActionDyingIdle_C_ExecuteUbergraph_BP_ActionDyingIdle::CallFunc_BP_GetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDyingIdle_C_ExecuteUbergraph_BP_ActionDyingIdle, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000020, "Member 'BP_ActionDyingIdle_C_ExecuteUbergraph_BP_ActionDyingIdle::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");

// Function BP_ActionDyingIdle.BP_ActionDyingIdle_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionDyingIdle_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDyingIdle_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionDyingIdle_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionDyingIdle_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionDyingIdle_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionDyingIdle_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionDyingIdle_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

// Function BP_ActionDyingIdle.BP_ActionDyingIdle_C.UpdateMoveDirection
// 0x0020 (0x0020 - 0x0000)
struct BP_ActionDyingIdle_C_UpdateMoveDirection final
{
public:
	class UCharacterCommandComponent*             CallFunc_BP_GetOwnerCommand_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue;          // 0x0010(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BP_GetDeltaSeconds_ReturnValue;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDyingIdle_C_UpdateMoveDirection) == 0x000008, "Wrong alignment on BP_ActionDyingIdle_C_UpdateMoveDirection");
static_assert(sizeof(BP_ActionDyingIdle_C_UpdateMoveDirection) == 0x000020, "Wrong size on BP_ActionDyingIdle_C_UpdateMoveDirection");
static_assert(offsetof(BP_ActionDyingIdle_C_UpdateMoveDirection, CallFunc_BP_GetOwnerCommand_ReturnValue) == 0x000000, "Member 'BP_ActionDyingIdle_C_UpdateMoveDirection::CallFunc_BP_GetOwnerCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDyingIdle_C_UpdateMoveDirection, CallFunc_BP_GetParam_ReturnValue) == 0x000008, "Member 'BP_ActionDyingIdle_C_UpdateMoveDirection::CallFunc_BP_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDyingIdle_C_UpdateMoveDirection, CallFunc_BP_GetMoveDirection_ReturnValue) == 0x000010, "Member 'BP_ActionDyingIdle_C_UpdateMoveDirection::CallFunc_BP_GetMoveDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDyingIdle_C_UpdateMoveDirection, CallFunc_BP_GetDeltaSeconds_ReturnValue) == 0x00001C, "Member 'BP_ActionDyingIdle_C_UpdateMoveDirection::CallFunc_BP_GetDeltaSeconds_ReturnValue' has a wrong offset!");

// Function BP_ActionDyingIdle.BP_ActionDyingIdle_C.UpdateSpeedRate
// 0x0018 (0x0018 - 0x0000)
struct BP_ActionDyingIdle_C_UpdateSpeedRate final
{
public:
	class UCharacterCommandComponent*             CallFunc_BP_GetOwnerCommand_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BP_GetMoveRate_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDyingIdle_C_UpdateSpeedRate) == 0x000008, "Wrong alignment on BP_ActionDyingIdle_C_UpdateSpeedRate");
static_assert(sizeof(BP_ActionDyingIdle_C_UpdateSpeedRate) == 0x000018, "Wrong size on BP_ActionDyingIdle_C_UpdateSpeedRate");
static_assert(offsetof(BP_ActionDyingIdle_C_UpdateSpeedRate, CallFunc_BP_GetOwnerCommand_ReturnValue) == 0x000000, "Member 'BP_ActionDyingIdle_C_UpdateSpeedRate::CallFunc_BP_GetOwnerCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDyingIdle_C_UpdateSpeedRate, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000008, "Member 'BP_ActionDyingIdle_C_UpdateSpeedRate::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDyingIdle_C_UpdateSpeedRate, CallFunc_BP_GetMoveRate_ReturnValue) == 0x000010, "Member 'BP_ActionDyingIdle_C_UpdateSpeedRate::CallFunc_BP_GetMoveRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDyingIdle_C_UpdateSpeedRate, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_ActionDyingIdle_C_UpdateSpeedRate::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_ActionDyingIdle.BP_ActionDyingIdle_C.UpdateCharacterDirection
// 0x0018 (0x0018 - 0x0000)
struct BP_ActionDyingIdle_C_UpdateCharacterDirection final
{
public:
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue;          // 0x0008(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionDyingIdle_C_UpdateCharacterDirection) == 0x000008, "Wrong alignment on BP_ActionDyingIdle_C_UpdateCharacterDirection");
static_assert(sizeof(BP_ActionDyingIdle_C_UpdateCharacterDirection) == 0x000018, "Wrong size on BP_ActionDyingIdle_C_UpdateCharacterDirection");
static_assert(offsetof(BP_ActionDyingIdle_C_UpdateCharacterDirection, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000000, "Member 'BP_ActionDyingIdle_C_UpdateCharacterDirection::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDyingIdle_C_UpdateCharacterDirection, CallFunc_BP_GetMoveDirection_ReturnValue) == 0x000008, "Member 'BP_ActionDyingIdle_C_UpdateCharacterDirection::CallFunc_BP_GetMoveDirection_ReturnValue' has a wrong offset!");

// Function BP_ActionDyingIdle.BP_ActionDyingIdle_C.BP_IsEnableShiftAction
// 0x0020 (0x0020 - 0x0000)
struct BP_ActionDyingIdle_C_BP_IsEnableShiftAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateBattle*                     CallFunc_BP_GetPlayerStateBattle_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsDyingInteracted_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionDyingIdle_C_BP_IsEnableShiftAction) == 0x000008, "Wrong alignment on BP_ActionDyingIdle_C_BP_IsEnableShiftAction");
static_assert(sizeof(BP_ActionDyingIdle_C_BP_IsEnableShiftAction) == 0x000020, "Wrong size on BP_ActionDyingIdle_C_BP_IsEnableShiftAction");
static_assert(offsetof(BP_ActionDyingIdle_C_BP_IsEnableShiftAction, NextAction) == 0x000000, "Member 'BP_ActionDyingIdle_C_BP_IsEnableShiftAction::NextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionDyingIdle_C_BP_IsEnableShiftAction, ReturnValue) == 0x000008, "Member 'BP_ActionDyingIdle_C_BP_IsEnableShiftAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDyingIdle_C_BP_IsEnableShiftAction, CallFunc_BP_GetPlayerStateBattle_ReturnValue) == 0x000010, "Member 'BP_ActionDyingIdle_C_BP_IsEnableShiftAction::CallFunc_BP_GetPlayerStateBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDyingIdle_C_BP_IsEnableShiftAction, K2Node_SwitchName_CmpSuccess) == 0x000018, "Member 'BP_ActionDyingIdle_C_BP_IsEnableShiftAction::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActionDyingIdle_C_BP_IsEnableShiftAction, CallFunc_BP_IsDyingInteracted_ReturnValue) == 0x000019, "Member 'BP_ActionDyingIdle_C_BP_IsEnableShiftAction::CallFunc_BP_IsDyingInteracted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionDyingIdle_C_BP_IsEnableShiftAction, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'BP_ActionDyingIdle_C_BP_IsEnableShiftAction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

