#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionAirDash

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionAirDash.BP_ActionAirDash_C.ExecuteUbergraph_BP_ActionAirDash
// 0x00B8 (0x00B8 - 0x0000)
struct BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterCommandComponent*             CallFunc_BP_GetOwnerCommand_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue;          // 0x0010(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_nextAction;                           // 0x0038(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue_1;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1;  // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_2;  // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x0058(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_1;            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_2;            // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue_1;                // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_3;  // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_3;            // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_4;            // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue_2;                // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMagazineManagementComponent*           CallFunc_BP_GetMagazine_ReturnValue;               // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMagazineManagementComponent*           CallFunc_BP_GetMagazine_ReturnValue_1;             // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BP_Consume_ReturnValue;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash) == 0x000008, "Wrong alignment on BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash");
static_assert(sizeof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash) == 0x0000B8, "Wrong size on BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, EntryPoint) == 0x000000, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, CallFunc_BP_GetOwnerCommand_ReturnValue) == 0x000008, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::CallFunc_BP_GetOwnerCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, CallFunc_BP_GetMoveDirection_ReturnValue) == 0x000010, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::CallFunc_BP_GetMoveDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000020, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, CallFunc_BP_GetParam_ReturnValue) == 0x000028, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::CallFunc_BP_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, CallFunc_BP_GetOwnerState_ReturnValue) == 0x000030, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, K2Node_Event_nextAction) == 0x000038, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::K2Node_Event_nextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, CallFunc_BP_GetOwnerState_ReturnValue_1) == 0x000040, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::CallFunc_BP_GetOwnerState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1) == 0x000048, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_2) == 0x000050, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, K2Node_Event_prevAction) == 0x000058, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::K2Node_Event_prevAction' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, CallFunc_BP_GetAnimation_ReturnValue) == 0x000060, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::CallFunc_BP_GetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, CallFunc_BP_GetAnimation_ReturnValue_1) == 0x000068, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::CallFunc_BP_GetAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, CallFunc_BP_GetAnimation_ReturnValue_2) == 0x000070, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::CallFunc_BP_GetAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, CallFunc_BP_GetParam_ReturnValue_1) == 0x000078, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::CallFunc_BP_GetParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_3) == 0x000080, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, CallFunc_BP_GetAnimation_ReturnValue_3) == 0x000088, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::CallFunc_BP_GetAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, CallFunc_BP_GetAnimation_ReturnValue_4) == 0x000090, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::CallFunc_BP_GetAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, CallFunc_BP_GetParam_ReturnValue_2) == 0x000098, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::CallFunc_BP_GetParam_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, CallFunc_BP_GetMagazine_ReturnValue) == 0x0000A0, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::CallFunc_BP_GetMagazine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, CallFunc_BP_GetMagazine_ReturnValue_1) == 0x0000A8, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::CallFunc_BP_GetMagazine_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash, CallFunc_BP_Consume_ReturnValue) == 0x0000B0, "Member 'BP_ActionAirDash_C_ExecuteUbergraph_BP_ActionAirDash::CallFunc_BP_Consume_ReturnValue' has a wrong offset!");

// Function BP_ActionAirDash.BP_ActionAirDash_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionAirDash_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionAirDash_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionAirDash_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionAirDash_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionAirDash_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionAirDash_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionAirDash_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

// Function BP_ActionAirDash.BP_ActionAirDash_C.BP_OnEndAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionAirDash_C_BP_OnEndAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionAirDash_C_BP_OnEndAction) == 0x000004, "Wrong alignment on BP_ActionAirDash_C_BP_OnEndAction");
static_assert(sizeof(BP_ActionAirDash_C_BP_OnEndAction) == 0x000008, "Wrong size on BP_ActionAirDash_C_BP_OnEndAction");
static_assert(offsetof(BP_ActionAirDash_C_BP_OnEndAction, NextAction) == 0x000000, "Member 'BP_ActionAirDash_C_BP_OnEndAction::NextAction' has a wrong offset!");

// Function BP_ActionAirDash.BP_ActionAirDash_C.UpdateMoveDirection
// 0x0048 (0x0048 - 0x0000)
struct BP_ActionAirDash_C_UpdateMoveDirection final
{
public:
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         CallFunc_BP_GetOwnerCharacter_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterCommandComponent*             CallFunc_BP_GetOwnerCommand_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BP_GetDeltaSeconds_ReturnValue;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue;          // 0x0034(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionAirDash_C_UpdateMoveDirection) == 0x000008, "Wrong alignment on BP_ActionAirDash_C_UpdateMoveDirection");
static_assert(sizeof(BP_ActionAirDash_C_UpdateMoveDirection) == 0x000048, "Wrong size on BP_ActionAirDash_C_UpdateMoveDirection");
static_assert(offsetof(BP_ActionAirDash_C_UpdateMoveDirection, CallFunc_BP_GetParam_ReturnValue) == 0x000000, "Member 'BP_ActionAirDash_C_UpdateMoveDirection::CallFunc_BP_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_UpdateMoveDirection, CallFunc_BP_GetOwnerCharacter_ReturnValue) == 0x000008, "Member 'BP_ActionAirDash_C_UpdateMoveDirection::CallFunc_BP_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_UpdateMoveDirection, CallFunc_GetActorForwardVector_ReturnValue) == 0x000010, "Member 'BP_ActionAirDash_C_UpdateMoveDirection::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_UpdateMoveDirection, CallFunc_Normal_ReturnValue) == 0x00001C, "Member 'BP_ActionAirDash_C_UpdateMoveDirection::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_UpdateMoveDirection, CallFunc_BP_GetOwnerCommand_ReturnValue) == 0x000028, "Member 'BP_ActionAirDash_C_UpdateMoveDirection::CallFunc_BP_GetOwnerCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_UpdateMoveDirection, CallFunc_BP_GetDeltaSeconds_ReturnValue) == 0x000030, "Member 'BP_ActionAirDash_C_UpdateMoveDirection::CallFunc_BP_GetDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_UpdateMoveDirection, CallFunc_BP_GetMoveDirection_ReturnValue) == 0x000034, "Member 'BP_ActionAirDash_C_UpdateMoveDirection::CallFunc_BP_GetMoveDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_UpdateMoveDirection, CallFunc_VSizeSquared_ReturnValue) == 0x000040, "Member 'BP_ActionAirDash_C_UpdateMoveDirection::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_UpdateMoveDirection, CallFunc_Less_FloatFloat_ReturnValue) == 0x000044, "Member 'BP_ActionAirDash_C_UpdateMoveDirection::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_ActionAirDash.BP_ActionAirDash_C.UpdateCharacterDirection
// 0x0020 (0x0020 - 0x0000)
struct BP_ActionAirDash_C_UpdateCharacterDirection final
{
public:
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue;          // 0x0008(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetForwardDirectionForBaseActionMovement_ReturnValue; // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionAirDash_C_UpdateCharacterDirection) == 0x000008, "Wrong alignment on BP_ActionAirDash_C_UpdateCharacterDirection");
static_assert(sizeof(BP_ActionAirDash_C_UpdateCharacterDirection) == 0x000020, "Wrong size on BP_ActionAirDash_C_UpdateCharacterDirection");
static_assert(offsetof(BP_ActionAirDash_C_UpdateCharacterDirection, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000000, "Member 'BP_ActionAirDash_C_UpdateCharacterDirection::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_UpdateCharacterDirection, CallFunc_BP_GetMoveDirection_ReturnValue) == 0x000008, "Member 'BP_ActionAirDash_C_UpdateCharacterDirection::CallFunc_BP_GetMoveDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_UpdateCharacterDirection, CallFunc_BP_GetForwardDirectionForBaseActionMovement_ReturnValue) == 0x000014, "Member 'BP_ActionAirDash_C_UpdateCharacterDirection::CallFunc_BP_GetForwardDirectionForBaseActionMovement_ReturnValue' has a wrong offset!");

// Function BP_ActionAirDash.BP_ActionAirDash_C.UpdateSmallAction
// 0x0018 (0x0018 - 0x0000)
struct BP_ActionAirDash_C_UpdateSmallAction final
{
public:
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsAttacking_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BP_GetDeltaSeconds_ReturnValue;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionAirDash_C_UpdateSmallAction) == 0x000008, "Wrong alignment on BP_ActionAirDash_C_UpdateSmallAction");
static_assert(sizeof(BP_ActionAirDash_C_UpdateSmallAction) == 0x000018, "Wrong size on BP_ActionAirDash_C_UpdateSmallAction");
static_assert(offsetof(BP_ActionAirDash_C_UpdateSmallAction, CallFunc_BP_GetOwnerState_ReturnValue) == 0x000000, "Member 'BP_ActionAirDash_C_UpdateSmallAction::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_UpdateSmallAction, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_ActionAirDash_C_UpdateSmallAction::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_UpdateSmallAction, CallFunc_BP_IsAttacking_ReturnValue) == 0x000009, "Member 'BP_ActionAirDash_C_UpdateSmallAction::CallFunc_BP_IsAttacking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_UpdateSmallAction, CallFunc_BP_GetDeltaSeconds_ReturnValue) == 0x00000C, "Member 'BP_ActionAirDash_C_UpdateSmallAction::CallFunc_BP_GetDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_UpdateSmallAction, CallFunc_Add_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_ActionAirDash_C_UpdateSmallAction::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_ActionAirDash.BP_ActionAirDash_C.BP_IsEnableShiftAction
// 0x000C (0x000C - 0x0000)
struct BP_ActionAirDash_C_BP_IsEnableShiftAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionAirDash_C_BP_IsEnableShiftAction) == 0x000004, "Wrong alignment on BP_ActionAirDash_C_BP_IsEnableShiftAction");
static_assert(sizeof(BP_ActionAirDash_C_BP_IsEnableShiftAction) == 0x00000C, "Wrong size on BP_ActionAirDash_C_BP_IsEnableShiftAction");
static_assert(offsetof(BP_ActionAirDash_C_BP_IsEnableShiftAction, NextAction) == 0x000000, "Member 'BP_ActionAirDash_C_BP_IsEnableShiftAction::NextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_BP_IsEnableShiftAction, ReturnValue) == 0x000008, "Member 'BP_ActionAirDash_C_BP_IsEnableShiftAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirDash_C_BP_IsEnableShiftAction, K2Node_SwitchName_CmpSuccess) == 0x000009, "Member 'BP_ActionAirDash_C_BP_IsEnableShiftAction::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

}

