#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionWallDash

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionWallDash.BP_ActionWallDash_C.ExecuteUbergraph_BP_ActionWallDash
// 0x00F8 (0x00F8 - 0x0000)
struct BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_nextAction;                           // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1;  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue_1;                // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_2;  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue_1;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_3;  // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x0058(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue_2;                // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_4;  // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue_2;           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetTouchWallNormal_ReturnValue;        // 0x0088(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue;          // 0x0094(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_5;  // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDestMoveDirection_DestMoveDirection;   // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetCurrentWallImpactNormal_ReturnValue; // 0x00B4(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x00C0(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_1;            // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue_3;                // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue;   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterState*                        CallFunc_BP_GetState_ReturnValue;                  // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_HasWallDash_ReturnValue;               // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash) == 0x000008, "Wrong alignment on BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash");
static_assert(sizeof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash) == 0x0000F8, "Wrong size on BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, EntryPoint) == 0x000000, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000008, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, K2Node_Event_nextAction) == 0x000010, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::K2Node_Event_nextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_BP_GetOwnerState_ReturnValue) == 0x000018, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_BP_GetAnimation_ReturnValue) == 0x000020, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_BP_GetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1) == 0x000028, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_BP_GetParam_ReturnValue) == 0x000030, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_BP_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_BP_GetParam_ReturnValue_1) == 0x000038, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_BP_GetParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_2) == 0x000040, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_BP_GetOwnerState_ReturnValue_1) == 0x000048, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_BP_GetOwnerState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_3) == 0x000050, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, K2Node_Event_prevAction) == 0x000058, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::K2Node_Event_prevAction' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_BP_GetParam_ReturnValue_2) == 0x000060, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_BP_GetParam_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000068, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_4) == 0x000070, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, Temp_bool_Variable) == 0x000078, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_BP_GetOwnerState_ReturnValue_2) == 0x000080, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_BP_GetOwnerState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_BP_GetTouchWallNormal_ReturnValue) == 0x000088, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_BP_GetTouchWallNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_BP_GetMoveDirection_ReturnValue) == 0x000094, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_BP_GetMoveDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_5) == 0x0000A0, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_GetDestMoveDirection_DestMoveDirection) == 0x0000A8, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_GetDestMoveDirection_DestMoveDirection' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_BP_GetCurrentWallImpactNormal_ReturnValue) == 0x0000B4, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_BP_GetCurrentWallImpactNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, K2Node_Select_Default) == 0x0000C0, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_BP_GetAnimation_ReturnValue_1) == 0x0000D0, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_BP_GetAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_BP_GetParam_ReturnValue_3) == 0x0000D8, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_BP_GetParam_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue) == 0x0000E0, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_BP_GetState_ReturnValue) == 0x0000E8, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_BP_GetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash, CallFunc_BP_HasWallDash_ReturnValue) == 0x0000F0, "Member 'BP_ActionWallDash_C_ExecuteUbergraph_BP_ActionWallDash::CallFunc_BP_HasWallDash_ReturnValue' has a wrong offset!");

// Function BP_ActionWallDash.BP_ActionWallDash_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionWallDash_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionWallDash_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionWallDash_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionWallDash_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionWallDash_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionWallDash_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionWallDash_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

// Function BP_ActionWallDash.BP_ActionWallDash_C.BP_OnEndAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionWallDash_C_BP_OnEndAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionWallDash_C_BP_OnEndAction) == 0x000004, "Wrong alignment on BP_ActionWallDash_C_BP_OnEndAction");
static_assert(sizeof(BP_ActionWallDash_C_BP_OnEndAction) == 0x000008, "Wrong size on BP_ActionWallDash_C_BP_OnEndAction");
static_assert(offsetof(BP_ActionWallDash_C_BP_OnEndAction, NextAction) == 0x000000, "Member 'BP_ActionWallDash_C_BP_OnEndAction::NextAction' has a wrong offset!");

// Function BP_ActionWallDash.BP_ActionWallDash_C.UpdateMoveDirection
// 0x0020 (0x0020 - 0x0000)
struct BP_ActionWallDash_C_UpdateMoveDirection final
{
public:
	struct FVector                                CallFunc_GetDestMoveDirection_DestMoveDirection;   // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BP_GetDeltaSeconds_ReturnValue;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionWallDash_C_UpdateMoveDirection) == 0x000008, "Wrong alignment on BP_ActionWallDash_C_UpdateMoveDirection");
static_assert(sizeof(BP_ActionWallDash_C_UpdateMoveDirection) == 0x000020, "Wrong size on BP_ActionWallDash_C_UpdateMoveDirection");
static_assert(offsetof(BP_ActionWallDash_C_UpdateMoveDirection, CallFunc_GetDestMoveDirection_DestMoveDirection) == 0x000000, "Member 'BP_ActionWallDash_C_UpdateMoveDirection::CallFunc_GetDestMoveDirection_DestMoveDirection' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_UpdateMoveDirection, CallFunc_BP_GetParam_ReturnValue) == 0x000010, "Member 'BP_ActionWallDash_C_UpdateMoveDirection::CallFunc_BP_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_UpdateMoveDirection, CallFunc_BP_GetDeltaSeconds_ReturnValue) == 0x000018, "Member 'BP_ActionWallDash_C_UpdateMoveDirection::CallFunc_BP_GetDeltaSeconds_ReturnValue' has a wrong offset!");

// Function BP_ActionWallDash.BP_ActionWallDash_C.UpdateSpeedRate
// 0x0018 (0x0018 - 0x0000)
struct BP_ActionWallDash_C_UpdateSpeedRate final
{
public:
	class UCharacterCommandComponent*             CallFunc_BP_GetOwnerCommand_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BP_GetMoveRate_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionWallDash_C_UpdateSpeedRate) == 0x000008, "Wrong alignment on BP_ActionWallDash_C_UpdateSpeedRate");
static_assert(sizeof(BP_ActionWallDash_C_UpdateSpeedRate) == 0x000018, "Wrong size on BP_ActionWallDash_C_UpdateSpeedRate");
static_assert(offsetof(BP_ActionWallDash_C_UpdateSpeedRate, CallFunc_BP_GetOwnerCommand_ReturnValue) == 0x000000, "Member 'BP_ActionWallDash_C_UpdateSpeedRate::CallFunc_BP_GetOwnerCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_UpdateSpeedRate, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000008, "Member 'BP_ActionWallDash_C_UpdateSpeedRate::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_UpdateSpeedRate, CallFunc_BP_GetMoveRate_ReturnValue) == 0x000010, "Member 'BP_ActionWallDash_C_UpdateSpeedRate::CallFunc_BP_GetMoveRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_UpdateSpeedRate, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_ActionWallDash_C_UpdateSpeedRate::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_ActionWallDash.BP_ActionWallDash_C.UpdateCharacterDirection
// 0x0018 (0x0018 - 0x0000)
struct BP_ActionWallDash_C_UpdateCharacterDirection final
{
public:
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue;          // 0x0000(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionWallDash_C_UpdateCharacterDirection) == 0x000008, "Wrong alignment on BP_ActionWallDash_C_UpdateCharacterDirection");
static_assert(sizeof(BP_ActionWallDash_C_UpdateCharacterDirection) == 0x000018, "Wrong size on BP_ActionWallDash_C_UpdateCharacterDirection");
static_assert(offsetof(BP_ActionWallDash_C_UpdateCharacterDirection, CallFunc_BP_GetMoveDirection_ReturnValue) == 0x000000, "Member 'BP_ActionWallDash_C_UpdateCharacterDirection::CallFunc_BP_GetMoveDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_UpdateCharacterDirection, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000010, "Member 'BP_ActionWallDash_C_UpdateCharacterDirection::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");

// Function BP_ActionWallDash.BP_ActionWallDash_C.UpdateCharacterVertical
// 0x0018 (0x0018 - 0x0000)
struct BP_ActionWallDash_C_UpdateCharacterVertical final
{
public:
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetCurrentWallImpactNormal_ReturnValue; // 0x0008(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionWallDash_C_UpdateCharacterVertical) == 0x000008, "Wrong alignment on BP_ActionWallDash_C_UpdateCharacterVertical");
static_assert(sizeof(BP_ActionWallDash_C_UpdateCharacterVertical) == 0x000018, "Wrong size on BP_ActionWallDash_C_UpdateCharacterVertical");
static_assert(offsetof(BP_ActionWallDash_C_UpdateCharacterVertical, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000000, "Member 'BP_ActionWallDash_C_UpdateCharacterVertical::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_UpdateCharacterVertical, CallFunc_BP_GetCurrentWallImpactNormal_ReturnValue) == 0x000008, "Member 'BP_ActionWallDash_C_UpdateCharacterVertical::CallFunc_BP_GetCurrentWallImpactNormal_ReturnValue' has a wrong offset!");

// Function BP_ActionWallDash.BP_ActionWallDash_C.GetDestMoveDirection
// 0x0050 (0x0050 - 0x0000)
struct BP_ActionWallDash_C_GetDestMoveDirection final
{
public:
	struct FVector                                DestMoveDirection;                                 // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterCommandComponent*             CallFunc_BP_GetOwnerCommand_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BP_GetMoveRate_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetMoveDirectionForWall_ReturnValue;   // 0x0030(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default;                             // 0x0040(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionWallDash_C_GetDestMoveDirection) == 0x000008, "Wrong alignment on BP_ActionWallDash_C_GetDestMoveDirection");
static_assert(sizeof(BP_ActionWallDash_C_GetDestMoveDirection) == 0x000050, "Wrong size on BP_ActionWallDash_C_GetDestMoveDirection");
static_assert(offsetof(BP_ActionWallDash_C_GetDestMoveDirection, DestMoveDirection) == 0x000000, "Member 'BP_ActionWallDash_C_GetDestMoveDirection::DestMoveDirection' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_GetDestMoveDirection, Temp_bool_Variable) == 0x00000C, "Member 'BP_ActionWallDash_C_GetDestMoveDirection::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_GetDestMoveDirection, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue) == 0x000010, "Member 'BP_ActionWallDash_C_GetDestMoveDirection::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_GetDestMoveDirection, CallFunc_BP_GetOwnerCommand_ReturnValue) == 0x000018, "Member 'BP_ActionWallDash_C_GetDestMoveDirection::CallFunc_BP_GetOwnerCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_GetDestMoveDirection, CallFunc_GetActorForwardVector_ReturnValue) == 0x000020, "Member 'BP_ActionWallDash_C_GetDestMoveDirection::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_GetDestMoveDirection, CallFunc_BP_GetMoveRate_ReturnValue) == 0x00002C, "Member 'BP_ActionWallDash_C_GetDestMoveDirection::CallFunc_BP_GetMoveRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_GetDestMoveDirection, CallFunc_BP_GetMoveDirectionForWall_ReturnValue) == 0x000030, "Member 'BP_ActionWallDash_C_GetDestMoveDirection::CallFunc_BP_GetMoveDirectionForWall_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_GetDestMoveDirection, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00003C, "Member 'BP_ActionWallDash_C_GetDestMoveDirection::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_GetDestMoveDirection, K2Node_Select_Default) == 0x000040, "Member 'BP_ActionWallDash_C_GetDestMoveDirection::K2Node_Select_Default' has a wrong offset!");

// Function BP_ActionWallDash.BP_ActionWallDash_C.BP_IsEnableShiftAction
// 0x000C (0x000C - 0x0000)
struct BP_ActionWallDash_C_BP_IsEnableShiftAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionWallDash_C_BP_IsEnableShiftAction) == 0x000004, "Wrong alignment on BP_ActionWallDash_C_BP_IsEnableShiftAction");
static_assert(sizeof(BP_ActionWallDash_C_BP_IsEnableShiftAction) == 0x00000C, "Wrong size on BP_ActionWallDash_C_BP_IsEnableShiftAction");
static_assert(offsetof(BP_ActionWallDash_C_BP_IsEnableShiftAction, NextAction) == 0x000000, "Member 'BP_ActionWallDash_C_BP_IsEnableShiftAction::NextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_BP_IsEnableShiftAction, ReturnValue) == 0x000008, "Member 'BP_ActionWallDash_C_BP_IsEnableShiftAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionWallDash_C_BP_IsEnableShiftAction, K2Node_SwitchName_CmpSuccess) == 0x000009, "Member 'BP_ActionWallDash_C_BP_IsEnableShiftAction::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

}

