#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionSuperJumpFall

#include "Basic.hpp"

#include "GameModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionSuperJumpFall.BP_ActionSuperJumpFall_C.ExecuteUbergraph_BP_ActionSuperJumpFall
// 0x0188 (0x0188 - 0x0000)
struct BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetJumpPadDirection_ReturnValue;       // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  Temp_byte_Variable_1;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsGiant_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsAimingMode_ReturnValue;              // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsForwardJump_ReturnValue;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_nextAction;                           // 0x0048(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue_2;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsDashJump_ReturnValue;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue_3;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsForwardJump_ReturnValue_1;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BP_GetDeltaSeconds_ReturnValue;           // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x0090(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterCommandComponent*             CallFunc_BP_GetOwnerCommand_ReturnValue;           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue;          // 0x00A0(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue_1;        // 0x00AC(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetForwardDirectionForBaseActionMovement_ReturnValue; // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Vector_IsNearlyZero_ReturnValue;          // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1;  // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_1;            // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_1; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue_4;           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsForwardJump_ReturnValue_2;           // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_2;  // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterCommandComponent*             CallFunc_BP_GetOwnerCommand_ReturnValue_1;         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  K2Node_Select_Default_1;                           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue_2;        // 0x0114(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue;                  // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue_1;                // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall) == 0x000008, "Wrong alignment on BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall");
static_assert(sizeof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall) == 0x000188, "Wrong size on BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, EntryPoint) == 0x000000, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue) == 0x000008, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetJumpPadDirection_ReturnValue) == 0x000010, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetJumpPadDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_IsLocallyControlled_ReturnValue) == 0x00001C, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, Temp_bool_Variable) == 0x00001D, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, Temp_float_Variable) == 0x000020, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, Temp_float_Variable_1) == 0x000024, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetOwnerState_ReturnValue) == 0x000028, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, Temp_byte_Variable) == 0x000030, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetOwnerState_ReturnValue_1) == 0x000038, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetOwnerState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, Temp_byte_Variable_1) == 0x000040, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_IsGiant_ReturnValue) == 0x000041, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_IsGiant_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_Not_PreBool_ReturnValue) == 0x000042, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_IsAimingMode_ReturnValue) == 0x000043, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_IsAimingMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_IsForwardJump_ReturnValue) == 0x000044, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_IsForwardJump_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_Not_PreBool_ReturnValue_1) == 0x000045, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, K2Node_Event_nextAction) == 0x000048, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::K2Node_Event_nextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BooleanAND_ReturnValue) == 0x000050, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetAnimation_ReturnValue) == 0x000058, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BooleanAND_ReturnValue_1) == 0x000060, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, K2Node_Select_Default) == 0x000064, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetOwnerState_ReturnValue_2) == 0x000068, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetOwnerState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_IsDashJump_ReturnValue) == 0x000070, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_IsDashJump_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetOwnerState_ReturnValue_3) == 0x000078, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetOwnerState_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_IsForwardJump_ReturnValue_1) == 0x000080, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_IsForwardJump_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetDeltaSeconds_ReturnValue) == 0x000084, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000088, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, K2Node_Event_prevAction) == 0x000090, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::K2Node_Event_prevAction' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetOwnerCommand_ReturnValue) == 0x000098, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetOwnerCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetMoveDirection_ReturnValue) == 0x0000A0, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetMoveDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetMoveDirection_ReturnValue_1) == 0x0000AC, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetMoveDirection_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetForwardDirectionForBaseActionMovement_ReturnValue) == 0x0000B8, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetForwardDirectionForBaseActionMovement_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_Vector_IsNearlyZero_ReturnValue) == 0x0000C4, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_Vector_IsNearlyZero_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1) == 0x0000C8, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetAnimation_ReturnValue_1) == 0x0000D0, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_1) == 0x0000D8, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_GetActorForwardVector_ReturnValue) == 0x0000E0, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetOwnerState_ReturnValue_4) == 0x0000F0, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetOwnerState_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_IsForwardJump_ReturnValue_2) == 0x0000F8, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_IsForwardJump_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, Temp_bool_Variable_1) == 0x0000F9, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_2) == 0x000100, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetOwnerCommand_ReturnValue_1) == 0x000108, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetOwnerCommand_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, K2Node_Select_Default_1) == 0x000110, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetMoveDirection_ReturnValue_2) == 0x000114, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetMoveDirection_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BreakVector_X) == 0x000120, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BreakVector_Y) == 0x000124, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BreakVector_Z) == 0x000128, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetParam_ReturnValue) == 0x000130, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BP_GetParam_ReturnValue_1) == 0x000138, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BP_GetParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_Normal_ReturnValue) == 0x000140, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00014C, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BreakVector_X_1) == 0x000158, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BreakVector_Y_1) == 0x00015C, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_BreakVector_Z_1) == 0x000160, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_Add_FloatFloat_ReturnValue) == 0x000164, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_MakeVector_ReturnValue) == 0x000168, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000174, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall, CallFunc_MakeVector_ReturnValue_1) == 0x000178, "Member 'BP_ActionSuperJumpFall_C_ExecuteUbergraph_BP_ActionSuperJumpFall::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");

// Function BP_ActionSuperJumpFall.BP_ActionSuperJumpFall_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionSuperJumpFall_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionSuperJumpFall_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionSuperJumpFall_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionSuperJumpFall_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionSuperJumpFall_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionSuperJumpFall_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionSuperJumpFall_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

// Function BP_ActionSuperJumpFall.BP_ActionSuperJumpFall_C.BP_OnEndAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionSuperJumpFall_C_BP_OnEndAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionSuperJumpFall_C_BP_OnEndAction) == 0x000004, "Wrong alignment on BP_ActionSuperJumpFall_C_BP_OnEndAction");
static_assert(sizeof(BP_ActionSuperJumpFall_C_BP_OnEndAction) == 0x000008, "Wrong size on BP_ActionSuperJumpFall_C_BP_OnEndAction");
static_assert(offsetof(BP_ActionSuperJumpFall_C_BP_OnEndAction, NextAction) == 0x000000, "Member 'BP_ActionSuperJumpFall_C_BP_OnEndAction::NextAction' has a wrong offset!");

// Function BP_ActionSuperJumpFall.BP_ActionSuperJumpFall_C.BP_IsEnableShiftAction
// 0x0030 (0x0030 - 0x0000)
struct BP_ActionSuperJumpFall_C_BP_IsEnableShiftAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMagazineManagementComponent*           CallFunc_BP_GetMagazineManagementComponent_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsEmpty_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionSuperJumpFall_C_BP_IsEnableShiftAction) == 0x000008, "Wrong alignment on BP_ActionSuperJumpFall_C_BP_IsEnableShiftAction");
static_assert(sizeof(BP_ActionSuperJumpFall_C_BP_IsEnableShiftAction) == 0x000030, "Wrong size on BP_ActionSuperJumpFall_C_BP_IsEnableShiftAction");
static_assert(offsetof(BP_ActionSuperJumpFall_C_BP_IsEnableShiftAction, NextAction) == 0x000000, "Member 'BP_ActionSuperJumpFall_C_BP_IsEnableShiftAction::NextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionSuperJumpFall_C_BP_IsEnableShiftAction, ReturnValue) == 0x000008, "Member 'BP_ActionSuperJumpFall_C_BP_IsEnableShiftAction::ReturnValue' has a wrong offset!");
