#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionPlusUltra

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InGameModule_classes.hpp"
#include "GameModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ActionPlusUltra.BP_ActionPlusUltra_C
// 0x0010 (0x01C0 - 0x01B0)
class UBP_ActionPlusUltra_C final : public UActionPlusUltra
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsAction;                                          // 0x01B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsResetPoint;                                      // 0x01B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_ActionPlusUltra(int32 EntryPoint);
	void BP_OnAnimNotify(const class FName& Type, const class FName& Event);
	void BP_OnEndAction(const class FName& NextAction);
	void BP_ActionRemote();
	void BP_OnBeginAction(const class FName& PrevAction);
	void BP_ActionMain();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ActionPlusUltra_C">();
	}
	static class UBP_ActionPlusUltra_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ActionPlusUltra_C>();
	}
};
static_assert(alignof(UBP_ActionPlusUltra_C) == 0x000008, "Wrong alignment on UBP_ActionPlusUltra_C");
static_assert(sizeof(UBP_ActionPlusUltra_C) == 0x0001C0, "Wrong size on UBP_ActionPlusUltra_C");
static_assert(offsetof(UBP_ActionPlusUltra_C, UberGraphFrame) == 0x0001B0, "Member 'UBP_ActionPlusUltra_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ActionPlusUltra_C, IsAction) == 0x0001B8, "Member 'UBP_ActionPlusUltra_C::IsAction' has a wrong offset!");
static_assert(offsetof(UBP_ActionPlusUltra_C, IsResetPoint) == 0x0001B9, "Member 'UBP_ActionPlusUltra_C::IsResetPoint' has a wrong offset!");

}

