#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionFall

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameModule_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionFall.BP_ActionFall_C.ExecuteUbergraph_BP_ActionFall
// 0x0088 (0x0088 - 0x0000)
struct BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsSpeedAcceleration_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1;  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterCommandComponent*             CallFunc_BP_GetOwnerCommand_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetMoveDirection_ReturnValue;          // 0x0050(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationId                                  Temp_byte_Variable_1;                              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_nextAction;                           // 0x0060(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_1;            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue_1;                // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue_1;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsAimingMode_ReturnValue;              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsForwardJump_ReturnValue;             // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAnimationId                                  K2Node_Select_Default;                             // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall) == 0x000008, "Wrong alignment on BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall");
static_assert(sizeof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall) == 0x000088, "Wrong size on BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, EntryPoint) == 0x000000, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, Temp_bool_Variable) == 0x000004, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, CallFunc_BP_GetAnimation_ReturnValue) == 0x000008, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::CallFunc_BP_GetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, K2Node_Event_prevAction) == 0x000010, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::K2Node_Event_prevAction' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000018, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, CallFunc_BP_IsSpeedAcceleration_ReturnValue) == 0x000020, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::CallFunc_BP_IsSpeedAcceleration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, CallFunc_BP_GetOwnerState_ReturnValue) == 0x000028, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, Temp_byte_Variable) == 0x000030, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1) == 0x000038, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::CallFunc_BP_GetOwnerMovementBattle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, CallFunc_BP_GetOwnerCommand_ReturnValue) == 0x000040, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::CallFunc_BP_GetOwnerCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, CallFunc_BP_GetParam_ReturnValue) == 0x000048, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::CallFunc_BP_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, CallFunc_BP_GetMoveDirection_ReturnValue) == 0x000050, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::CallFunc_BP_GetMoveDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, Temp_byte_Variable_1) == 0x00005C, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, K2Node_Event_nextAction) == 0x000060, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::K2Node_Event_nextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, CallFunc_BP_GetAnimation_ReturnValue_1) == 0x000068, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::CallFunc_BP_GetAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, CallFunc_BP_GetParam_ReturnValue_1) == 0x000070, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::CallFunc_BP_GetParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, CallFunc_BP_GetOwnerState_ReturnValue_1) == 0x000078, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::CallFunc_BP_GetOwnerState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, CallFunc_BP_IsAimingMode_ReturnValue) == 0x000080, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::CallFunc_BP_IsAimingMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, CallFunc_BP_IsForwardJump_ReturnValue) == 0x000081, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::CallFunc_BP_IsForwardJump_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, CallFunc_Not_PreBool_ReturnValue) == 0x000082, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, CallFunc_BooleanAND_ReturnValue) == 0x000083, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall, K2Node_Select_Default) == 0x000084, "Member 'BP_ActionFall_C_ExecuteUbergraph_BP_ActionFall::K2Node_Select_Default' has a wrong offset!");

// Function BP_ActionFall.BP_ActionFall_C.BP_OnEndAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionFall_C_BP_OnEndAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionFall_C_BP_OnEndAction) == 0x000004, "Wrong alignment on BP_ActionFall_C_BP_OnEndAction");
static_assert(sizeof(BP_ActionFall_C_BP_OnEndAction) == 0x000008, "Wrong size on BP_ActionFall_C_BP_OnEndAction");
static_assert(offsetof(BP_ActionFall_C_BP_OnEndAction, NextAction) == 0x000000, "Member 'BP_ActionFall_C_BP_OnEndAction::NextAction' has a wrong offset!");

// Function BP_ActionFall.BP_ActionFall_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionFall_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionFall_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionFall_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionFall_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionFall_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionFall_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionFall_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

// Function BP_ActionFall.BP_ActionFall_C.BP_IsEnableShiftAction
// 0x0030 (0x0030 - 0x0000)
struct BP_ActionFall_C_BP_IsEnableShiftAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMagazineManagementComponent*           CallFunc_BP_GetMagazineManagementComponent_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsEmpty_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionFall_C_BP_IsEnableShiftAction) == 0x000008, "Wrong alignment on BP_ActionFall_C_BP_IsEnableShiftAction");
static_assert(sizeof(BP_ActionFall_C_BP_IsEnableShiftAction) == 0x000030, "Wrong size on BP_ActionFall_C_BP_IsEnableShiftAction");
static_assert(offsetof(BP_ActionFall_C_BP_IsEnableShiftAction, NextAction) == 0x000000, "Member 'BP_ActionFall_C_BP_IsEnableShiftAction::NextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_BP_IsEnableShiftAction, ReturnValue) == 0x000008, "Member 'BP_ActionFall_C_BP_IsEnableShiftAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_BP_IsEnableShiftAction, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue) == 0x000010, "Member 'BP_ActionFall_C_BP_IsEnableShiftAction::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_BP_IsEnableShiftAction, K2Node_SwitchName_CmpSuccess) == 0x000018, "Member 'BP_ActionFall_C_BP_IsEnableShiftAction::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_BP_IsEnableShiftAction, CallFunc_BP_GetMagazineManagementComponent_ReturnValue) == 0x000020, "Member 'BP_ActionFall_C_BP_IsEnableShiftAction::CallFunc_BP_GetMagazineManagementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_BP_IsEnableShiftAction, CallFunc_BP_IsEmpty_ReturnValue) == 0x000028, "Member 'BP_ActionFall_C_BP_IsEnableShiftAction::CallFunc_BP_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionFall_C_BP_IsEnableShiftAction, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'BP_ActionFall_C_BP_IsEnableShiftAction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

