#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionAirJumpBegin

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionAirJumpBegin.BP_ActionAirJumpBegin_C.ExecuteUbergraph_BP_ActionAirJumpBegin
// 0x00D8 (0x00D8 - 0x0000)
struct BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovementComponentBattle*               CallFunc_BP_GetOwnerMovementBattle_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_prevAction;                           // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorLocalOffset_SweepHitResult;    // 0x0038(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FName                                   K2Node_Event_nextAction;                           // 0x00C0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimation*                             CallFunc_BP_GetAnimation_ReturnValue_1;            // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBrakeSpan_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin) == 0x000008, "Wrong alignment on BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin");
static_assert(sizeof(BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin) == 0x0000D8, "Wrong size on BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin");
static_assert(offsetof(BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin, EntryPoint) == 0x000000, "Member 'BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin, CallFunc_BP_GetOwnerMovementBattle_ReturnValue) == 0x000008, "Member 'BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin::CallFunc_BP_GetOwnerMovementBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin, CallFunc_BP_GetOwnerState_ReturnValue) == 0x000010, "Member 'BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin, CallFunc_BP_GetAnimation_ReturnValue) == 0x000018, "Member 'BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin::CallFunc_BP_GetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin, K2Node_Event_prevAction) == 0x000020, "Member 'BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin::K2Node_Event_prevAction' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000028, "Member 'BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue) == 0x000030, "Member 'BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin, CallFunc_K2_AddActorLocalOffset_SweepHitResult) == 0x000038, "Member 'BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin::CallFunc_K2_AddActorLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin, K2Node_Event_nextAction) == 0x0000C0, "Member 'BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin::K2Node_Event_nextAction' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin, CallFunc_BP_GetAnimation_ReturnValue_1) == 0x0000C8, "Member 'BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin::CallFunc_BP_GetAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin, CallFunc_GetBrakeSpan_ReturnValue) == 0x0000D0, "Member 'BP_ActionAirJumpBegin_C_ExecuteUbergraph_BP_ActionAirJumpBegin::CallFunc_GetBrakeSpan_ReturnValue' has a wrong offset!");

// Function BP_ActionAirJumpBegin.BP_ActionAirJumpBegin_C.BP_OnEndAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionAirJumpBegin_C_BP_OnEndAction final
{
public:
	class FName                                   NextAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionAirJumpBegin_C_BP_OnEndAction) == 0x000004, "Wrong alignment on BP_ActionAirJumpBegin_C_BP_OnEndAction");
static_assert(sizeof(BP_ActionAirJumpBegin_C_BP_OnEndAction) == 0x000008, "Wrong size on BP_ActionAirJumpBegin_C_BP_OnEndAction");
static_assert(offsetof(BP_ActionAirJumpBegin_C_BP_OnEndAction, NextAction) == 0x000000, "Member 'BP_ActionAirJumpBegin_C_BP_OnEndAction::NextAction' has a wrong offset!");

// Function BP_ActionAirJumpBegin.BP_ActionAirJumpBegin_C.BP_OnBeginAction
// 0x0008 (0x0008 - 0x0000)
struct BP_ActionAirJumpBegin_C_BP_OnBeginAction final
{
public:
	class FName                                   PrevAction;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionAirJumpBegin_C_BP_OnBeginAction) == 0x000004, "Wrong alignment on BP_ActionAirJumpBegin_C_BP_OnBeginAction");
static_assert(sizeof(BP_ActionAirJumpBegin_C_BP_OnBeginAction) == 0x000008, "Wrong size on BP_ActionAirJumpBegin_C_BP_OnBeginAction");
static_assert(offsetof(BP_ActionAirJumpBegin_C_BP_OnBeginAction, PrevAction) == 0x000000, "Member 'BP_ActionAirJumpBegin_C_BP_OnBeginAction::PrevAction' has a wrong offset!");

// Function BP_ActionAirJumpBegin.BP_ActionAirJumpBegin_C.GetBrakeSpan
// 0x0020 (0x0020 - 0x0000)
struct BP_ActionAirJumpBegin_C_GetBrakeSpan final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterParam*                        CallFunc_BP_GetParam_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterState*                        CallFunc_BP_GetOwnerState_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsGiant_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionAirJumpBegin_C_GetBrakeSpan) == 0x000008, "Wrong alignment on BP_ActionAirJumpBegin_C_GetBrakeSpan");
static_assert(sizeof(BP_ActionAirJumpBegin_C_GetBrakeSpan) == 0x000020, "Wrong size on BP_ActionAirJumpBegin_C_GetBrakeSpan");
static_assert(offsetof(BP_ActionAirJumpBegin_C_GetBrakeSpan, ReturnValue) == 0x000000, "Member 'BP_ActionAirJumpBegin_C_GetBrakeSpan::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBegin_C_GetBrakeSpan, Temp_bool_Variable) == 0x000004, "Member 'BP_ActionAirJumpBegin_C_GetBrakeSpan::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBegin_C_GetBrakeSpan, CallFunc_BP_GetParam_ReturnValue) == 0x000008, "Member 'BP_ActionAirJumpBegin_C_GetBrakeSpan::CallFunc_BP_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBegin_C_GetBrakeSpan, CallFunc_BP_GetOwnerState_ReturnValue) == 0x000010, "Member 'BP_ActionAirJumpBegin_C_GetBrakeSpan::CallFunc_BP_GetOwnerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBegin_C_GetBrakeSpan, CallFunc_BP_IsGiant_ReturnValue) == 0x000018, "Member 'BP_ActionAirJumpBegin_C_GetBrakeSpan::CallFunc_BP_IsGiant_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionAirJumpBegin_C_GetBrakeSpan, K2Node_Select_Default) == 0x00001C, "Member 'BP_ActionAirJumpBegin_C_GetBrakeSpan::K2Node_Select_Default' has a wrong offset!");

}

