#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CC_Opticaldazzlepaint

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CC_Opticaldazzlepaint.BP_CC_Opticaldazzlepaint_C.ExecuteUbergraph_BP_CC_Opticaldazzlepaint
// 0x0048 (0x0048 - 0x0000)
struct BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterState*                        CallFunc_BP_GetState_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_1; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsCrouching_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterMaterialControlComponent*     CallFunc_BP_GetCharacterMaterialControl_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_2; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAtomComponent*                         CallFunc_PlaySoundAttached_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint) == 0x000008, "Wrong alignment on BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint");
static_assert(sizeof(BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint) == 0x000048, "Wrong size on BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint");
static_assert(offsetof(BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint, EntryPoint) == 0x000000, "Member 'BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue) == 0x000008, "Member 'BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint, CallFunc_BP_GetState_ReturnValue) == 0x000010, "Member 'BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint::CallFunc_BP_GetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_1) == 0x000018, "Member 'BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint, CallFunc_BP_IsCrouching_ReturnValue) == 0x000020, "Member 'BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint::CallFunc_BP_IsCrouching_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint, CallFunc_BP_GetCharacterMaterialControl_ReturnValue) == 0x000028, "Member 'BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint::CallFunc_BP_GetCharacterMaterialControl_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_2) == 0x000038, "Member 'BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint, CallFunc_PlaySoundAttached_ReturnValue) == 0x000040, "Member 'BP_CC_Opticaldazzlepaint_C_ExecuteUbergraph_BP_CC_Opticaldazzlepaint::CallFunc_PlaySoundAttached_ReturnValue' has a wrong offset!");

}

