#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CC_Skill_SpeedDown

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CC_Skill_SpeedDown.BP_CC_Skill_SpeedDown_C.ExecuteUbergraph_BP_CC_Skill_SpeedDown
// 0x0008 (0x0008 - 0x0000)
struct BP_CC_Skill_SpeedDown_C_ExecuteUbergraph_BP_CC_Skill_SpeedDown final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_value;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CC_Skill_SpeedDown_C_ExecuteUbergraph_BP_CC_Skill_SpeedDown) == 0x000004, "Wrong alignment on BP_CC_Skill_SpeedDown_C_ExecuteUbergraph_BP_CC_Skill_SpeedDown");
static_assert(sizeof(BP_CC_Skill_SpeedDown_C_ExecuteUbergraph_BP_CC_Skill_SpeedDown) == 0x000008, "Wrong size on BP_CC_Skill_SpeedDown_C_ExecuteUbergraph_BP_CC_Skill_SpeedDown");
static_assert(offsetof(BP_CC_Skill_SpeedDown_C_ExecuteUbergraph_BP_CC_Skill_SpeedDown, EntryPoint) == 0x000000, "Member 'BP_CC_Skill_SpeedDown_C_ExecuteUbergraph_BP_CC_Skill_SpeedDown::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CC_Skill_SpeedDown_C_ExecuteUbergraph_BP_CC_Skill_SpeedDown, K2Node_Event_value) == 0x000004, "Member 'BP_CC_Skill_SpeedDown_C_ExecuteUbergraph_BP_CC_Skill_SpeedDown::K2Node_Event_value' has a wrong offset!");

// Function BP_CC_Skill_SpeedDown.BP_CC_Skill_SpeedDown_C.BP_OnUpdateIntervalValue
// 0x0004 (0x0004 - 0x0000)
struct BP_CC_Skill_SpeedDown_C_BP_OnUpdateIntervalValue final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CC_Skill_SpeedDown_C_BP_OnUpdateIntervalValue) == 0x000004, "Wrong alignment on BP_CC_Skill_SpeedDown_C_BP_OnUpdateIntervalValue");
static_assert(sizeof(BP_CC_Skill_SpeedDown_C_BP_OnUpdateIntervalValue) == 0x000004, "Wrong size on BP_CC_Skill_SpeedDown_C_BP_OnUpdateIntervalValue");
static_assert(offsetof(BP_CC_Skill_SpeedDown_C_BP_OnUpdateIntervalValue, Value) == 0x000000, "Member 'BP_CC_Skill_SpeedDown_C_BP_OnUpdateIntervalValue::Value' has a wrong offset!");

}

