#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CC_PlusUltra

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CC_PlusUltra.BP_CC_PlusUltra_C.ExecuteUbergraph_BP_CC_PlusUltra
// 0x0090 (0x0090 - 0x0000)
struct BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_oldLevel;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_newLevel;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_1; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkillManagementComponent*              CallFunc_BP_GetSkillManagementCompnent_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkillManagementComponent*              CallFunc_BP_GetSkillManagementCompnent_ReturnValue_1; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_2; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBattle*                       CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_3; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomParticleSystemComponent*         CallFunc_EnableAuraEffect_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomParticleSystemComponent*         CallFunc_EnableAuraEffect_ReturnValue_1;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetVisualMesh_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetVisualMesh_ReturnValue_1;              // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOutlineSkeletalMeshComponent*          K2Node_DynamicCast_AsOutline_Skeletal_Mesh_Component; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOutlineSkeletalMeshComponent*          K2Node_DynamicCast_AsOutline_Skeletal_Mesh_Component_1; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateBattle*                     CallFunc_BP_GetOwnerPlayerState_ReturnValue;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBuffParam*                             CallFunc_BP_GetBuffParam_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra) == 0x000008, "Wrong alignment on BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra");
static_assert(sizeof(BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra) == 0x000090, "Wrong size on BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra");
static_assert(offsetof(BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra, EntryPoint) == 0x000000, "Member 'BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra, K2Node_Event_oldLevel) == 0x000004, "Member 'BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra::K2Node_Event_oldLevel' has a wrong offset!");
static_assert(offsetof(BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra, K2Node_Event_newLevel) == 0x000008, "Member 'BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra::K2Node_Event_newLevel' has a wrong offset!");
static_assert(offsetof(BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue) == 0x000010, "Member 'BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_1) == 0x000018, "Member 'BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra, CallFunc_BP_GetSkillManagementCompnent_ReturnValue) == 0x000020, "Member 'BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra::CallFunc_BP_GetSkillManagementCompnent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra, CallFunc_BP_GetSkillManagementCompnent_ReturnValue_1) == 0x000028, "Member 'BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra::CallFunc_BP_GetSkillManagementCompnent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_2) == 0x000030, "Member 'BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra, CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_3) == 0x000038, "Member 'BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra::CallFunc_BP_GetOwnerCharacterBattle_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra, CallFunc_EnableAuraEffect_ReturnValue) == 0x000040, "Member 'BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra::CallFunc_EnableAuraEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra, CallFunc_EnableAuraEffect_ReturnValue_1) == 0x000048, "Member 'BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra::CallFunc_EnableAuraEffect_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra, CallFunc_GetVisualMesh_ReturnValue) == 0x000050, "Member 'BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra::CallFunc_GetVisualMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra, CallFunc_GetVisualMesh_ReturnValue_1) == 0x000058, "Member 'BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra::CallFunc_GetVisualMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra, K2Node_DynamicCast_AsOutline_Skeletal_Mesh_Component) == 0x000060, "Member 'BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra::K2Node_DynamicCast_AsOutline_Skeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra, K2Node_DynamicCast_AsOutline_Skeletal_Mesh_Component_1) == 0x000070, "Member 'BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra::K2Node_DynamicCast_AsOutline_Skeletal_Mesh_Component_1' has a wrong offset!");
static_assert(offsetof(BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra, CallFunc_BP_GetOwnerPlayerState_ReturnValue) == 0x000080, "Member 'BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra::CallFunc_BP_GetOwnerPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra, CallFunc_BP_GetBuffParam_ReturnValue) == 0x000088, "Member 'BP_CC_PlusUltra_C_ExecuteUbergraph_BP_CC_PlusUltra::CallFunc_BP_GetBuffParam_ReturnValue' has a wrong offset!");

// Function BP_CC_PlusUltra.BP_CC_PlusUltra_C.BP_OnChangeConditionLevel
// 0x0008 (0x0008 - 0x0000)
struct BP_CC_PlusUltra_C_BP_OnChangeConditionLevel final
{
public:
	int32                                         OldLevel;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewLevel;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CC_PlusUltra_C_BP_OnChangeConditionLevel) == 0x000004, "Wrong alignment on BP_CC_PlusUltra_C_BP_OnChangeConditionLevel");
static_assert(sizeof(BP_CC_PlusUltra_C_BP_OnChangeConditionLevel) == 0x000008, "Wrong size on BP_CC_PlusUltra_C_BP_OnChangeConditionLevel");
static_assert(offsetof(BP_CC_PlusUltra_C_BP_OnChangeConditionLevel, OldLevel) == 0x000000, "Member 'BP_CC_PlusUltra_C_BP_OnChangeConditionLevel::OldLevel' has a wrong offset!");
static_assert(offsetof(BP_CC_PlusUltra_C_BP_OnChangeConditionLevel, NewLevel) == 0x000004, "Member 'BP_CC_PlusUltra_C_BP_OnChangeConditionLevel::NewLevel' has a wrong offset!");

}

