#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GUIFunction

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GUIFunction.BP_GUIFunction_C.OpenLevel
// 0x0080 (0x0080 - 0x0000)
struct BP_GUIFunction_C_OpenLevel final
{
public:
	TSoftObjectPtr<class UWorld>                  Level;                                             // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelStreaming*                        LevelInstance;                                     // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_SoftObjectReferenceToString_ReturnValue; // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GUIFunction_C_OpenLevel) == 0x000008, "Wrong alignment on BP_GUIFunction_C_OpenLevel");
static_assert(sizeof(BP_GUIFunction_C_OpenLevel) == 0x000080, "Wrong size on BP_GUIFunction_C_OpenLevel");
static_assert(offsetof(BP_GUIFunction_C_OpenLevel, Level) == 0x000000, "Member 'BP_GUIFunction_C_OpenLevel::Level' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_OpenLevel, __WorldContext) == 0x000028, "Member 'BP_GUIFunction_C_OpenLevel::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_OpenLevel, LevelInstance) == 0x000030, "Member 'BP_GUIFunction_C_OpenLevel::LevelInstance' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_OpenLevel, CallFunc_Conv_SoftObjectReferenceToString_ReturnValue) == 0x000038, "Member 'BP_GUIFunction_C_OpenLevel::CallFunc_Conv_SoftObjectReferenceToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_OpenLevel, CallFunc_Split_LeftS) == 0x000048, "Member 'BP_GUIFunction_C_OpenLevel::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_OpenLevel, CallFunc_Split_RightS) == 0x000058, "Member 'BP_GUIFunction_C_OpenLevel::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_OpenLevel, CallFunc_Split_ReturnValue) == 0x000068, "Member 'BP_GUIFunction_C_OpenLevel::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_OpenLevel, CallFunc_Conv_StringToName_ReturnValue) == 0x00006C, "Member 'BP_GUIFunction_C_OpenLevel::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_OpenLevel, CallFunc_Contains_ReturnValue) == 0x000074, "Member 'BP_GUIFunction_C_OpenLevel::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_OpenLevel, CallFunc_GetStreamingLevel_ReturnValue) == 0x000078, "Member 'BP_GUIFunction_C_OpenLevel::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");

// Function BP_GUIFunction.BP_GUIFunction_C.CloseLevel
// 0x0020 (0x0020 - 0x0000)
struct BP_GUIFunction_C_CloseLevel final
{
public:
	class FName                                   LevelName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GUIFunction_C_CloseLevel) == 0x000008, "Wrong alignment on BP_GUIFunction_C_CloseLevel");
static_assert(sizeof(BP_GUIFunction_C_CloseLevel) == 0x000020, "Wrong size on BP_GUIFunction_C_CloseLevel");
static_assert(offsetof(BP_GUIFunction_C_CloseLevel, LevelName) == 0x000000, "Member 'BP_GUIFunction_C_CloseLevel::LevelName' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CloseLevel, __WorldContext) == 0x000008, "Member 'BP_GUIFunction_C_CloseLevel::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CloseLevel, CallFunc_GetStreamingLevel_ReturnValue) == 0x000010, "Member 'BP_GUIFunction_C_CloseLevel::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CloseLevel, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_GUIFunction_C_CloseLevel::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_GUIFunction.BP_GUIFunction_C.GetLevelName
// 0x0078 (0x0078 - 0x0000)
struct BP_GUIFunction_C_GetLevelName final
{
public:
	TSoftObjectPtr<class UWorld>                  Level;                                             // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LevelName;                                         // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_SoftObjectReferenceToString_ReturnValue; // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GUIFunction_C_GetLevelName) == 0x000008, "Wrong alignment on BP_GUIFunction_C_GetLevelName");
static_assert(sizeof(BP_GUIFunction_C_GetLevelName) == 0x000078, "Wrong size on BP_GUIFunction_C_GetLevelName");
static_assert(offsetof(BP_GUIFunction_C_GetLevelName, Level) == 0x000000, "Member 'BP_GUIFunction_C_GetLevelName::Level' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_GetLevelName, __WorldContext) == 0x000028, "Member 'BP_GUIFunction_C_GetLevelName::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_GetLevelName, LevelName) == 0x000030, "Member 'BP_GUIFunction_C_GetLevelName::LevelName' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_GetLevelName, CallFunc_Conv_SoftObjectReferenceToString_ReturnValue) == 0x000038, "Member 'BP_GUIFunction_C_GetLevelName::CallFunc_Conv_SoftObjectReferenceToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_GetLevelName, CallFunc_Split_LeftS) == 0x000048, "Member 'BP_GUIFunction_C_GetLevelName::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_GetLevelName, CallFunc_Split_RightS) == 0x000058, "Member 'BP_GUIFunction_C_GetLevelName::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_GetLevelName, CallFunc_Split_ReturnValue) == 0x000068, "Member 'BP_GUIFunction_C_GetLevelName::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_GetLevelName, CallFunc_Conv_StringToName_ReturnValue) == 0x00006C, "Member 'BP_GUIFunction_C_GetLevelName::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

// Function BP_GUIFunction.BP_GUIFunction_C.SetupInputIcon
// 0x0108 (0x0108 - 0x0000)
struct BP_GUIFunction_C_SetupInputIcon final
{
public:
	class UPlatformRichTextBlock*                 MessageIcon;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URichTextBlock*                         Message;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Icon;                                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Style;                                             // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Text;                                              // 0x0040(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0018)()
};
static_assert(alignof(BP_GUIFunction_C_SetupInputIcon) == 0x000008, "Wrong alignment on BP_GUIFunction_C_SetupInputIcon");
static_assert(sizeof(BP_GUIFunction_C_SetupInputIcon) == 0x000108, "Wrong size on BP_GUIFunction_C_SetupInputIcon");
static_assert(offsetof(BP_GUIFunction_C_SetupInputIcon, MessageIcon) == 0x000000, "Member 'BP_GUIFunction_C_SetupInputIcon::MessageIcon' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_SetupInputIcon, Message) == 0x000008, "Member 'BP_GUIFunction_C_SetupInputIcon::Message' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_SetupInputIcon, Icon) == 0x000010, "Member 'BP_GUIFunction_C_SetupInputIcon::Icon' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_SetupInputIcon, Style) == 0x000028, "Member 'BP_GUIFunction_C_SetupInputIcon::Style' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_SetupInputIcon, Text) == 0x000040, "Member 'BP_GUIFunction_C_SetupInputIcon::Text' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_SetupInputIcon, __WorldContext) == 0x000058, "Member 'BP_GUIFunction_C_SetupInputIcon::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_SetupInputIcon, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'BP_GUIFunction_C_SetupInputIcon::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_SetupInputIcon, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A0, "Member 'BP_GUIFunction_C_SetupInputIcon::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_SetupInputIcon, K2Node_MakeArray_Array) == 0x0000E0, "Member 'BP_GUIFunction_C_SetupInputIcon::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_SetupInputIcon, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'BP_GUIFunction_C_SetupInputIcon::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_GUIFunction.BP_GUIFunction_C.CalcAnchors
// 0x00E0 (0x00E0 - 0x0000)
struct BP_GUIFunction_C_CalcAnchors final
{
public:
	struct FAnchors                               OnwerPanelAnchors;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FVector2D                              Pos;                                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               CalcAnchors_0;                                     // 0x0028(0x0010)(Parm, OutParm, NoDestructor)
	struct FAnchors                               LocalAnchor;                                       // 0x0038(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FVector2D                              LocalSize;                                         // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LocalPos;                                          // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ViewSize;                                          // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               ReturnAnchors;                                     // 0x0060(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0070(0x0010)(NoDestructor)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue_1;    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors_1;                       // 0x00D0(0x0010)(NoDestructor)
};
static_assert(alignof(BP_GUIFunction_C_CalcAnchors) == 0x000008, "Wrong alignment on BP_GUIFunction_C_CalcAnchors");
static_assert(sizeof(BP_GUIFunction_C_CalcAnchors) == 0x0000E0, "Wrong size on BP_GUIFunction_C_CalcAnchors");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, OnwerPanelAnchors) == 0x000000, "Member 'BP_GUIFunction_C_CalcAnchors::OnwerPanelAnchors' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, Pos) == 0x000010, "Member 'BP_GUIFunction_C_CalcAnchors::Pos' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, Size) == 0x000018, "Member 'BP_GUIFunction_C_CalcAnchors::Size' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, __WorldContext) == 0x000020, "Member 'BP_GUIFunction_C_CalcAnchors::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, CalcAnchors_0) == 0x000028, "Member 'BP_GUIFunction_C_CalcAnchors::CalcAnchors_0' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, LocalAnchor) == 0x000038, "Member 'BP_GUIFunction_C_CalcAnchors::LocalAnchor' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, LocalSize) == 0x000048, "Member 'BP_GUIFunction_C_CalcAnchors::LocalSize' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, LocalPos) == 0x000050, "Member 'BP_GUIFunction_C_CalcAnchors::LocalPos' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, ViewSize) == 0x000058, "Member 'BP_GUIFunction_C_CalcAnchors::ViewSize' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, ReturnAnchors) == 0x000060, "Member 'BP_GUIFunction_C_CalcAnchors::ReturnAnchors' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, K2Node_MakeStruct_Anchors) == 0x000070, "Member 'BP_GUIFunction_C_CalcAnchors::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, CallFunc_BreakVector2D_X) == 0x000080, "Member 'BP_GUIFunction_C_CalcAnchors::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, CallFunc_BreakVector2D_Y) == 0x000084, "Member 'BP_GUIFunction_C_CalcAnchors::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, CallFunc_BreakVector2D_X_1) == 0x000088, "Member 'BP_GUIFunction_C_CalcAnchors::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, CallFunc_BreakVector2D_Y_1) == 0x00008C, "Member 'BP_GUIFunction_C_CalcAnchors::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, CallFunc_BreakVector2D_X_2) == 0x000090, "Member 'BP_GUIFunction_C_CalcAnchors::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, CallFunc_BreakVector2D_Y_2) == 0x000094, "Member 'BP_GUIFunction_C_CalcAnchors::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000098, "Member 'BP_GUIFunction_C_CalcAnchors::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00009C, "Member 'BP_GUIFunction_C_CalcAnchors::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000A0, "Member 'BP_GUIFunction_C_CalcAnchors::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000A4, "Member 'BP_GUIFunction_C_CalcAnchors::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0000A8, "Member 'BP_GUIFunction_C_CalcAnchors::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0000AC, "Member 'BP_GUIFunction_C_CalcAnchors::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, CallFunc_MakeVector2D_ReturnValue) == 0x0000B0, "Member 'BP_GUIFunction_C_CalcAnchors::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x0000B8, "Member 'BP_GUIFunction_C_CalcAnchors::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, CallFunc_Divide_Vector2DVector2D_ReturnValue) == 0x0000C0, "Member 'BP_GUIFunction_C_CalcAnchors::CallFunc_Divide_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, CallFunc_Divide_Vector2DVector2D_ReturnValue_1) == 0x0000C8, "Member 'BP_GUIFunction_C_CalcAnchors::CallFunc_Divide_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_CalcAnchors, K2Node_MakeStruct_Anchors_1) == 0x0000D0, "Member 'BP_GUIFunction_C_CalcAnchors::K2Node_MakeStruct_Anchors_1' has a wrong offset!");

// Function BP_GUIFunction.BP_GUIFunction_C.LoadDynamicLevel
// 0x0088 (0x0088 - 0x0000)
struct BP_GUIFunction_C_LoadDynamicLevel final
{
public:
	TSoftObjectPtr<class UWorld>                  Level;                                             // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          bVisible;                                          // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelStreamingDynamic*                 LevelInstance;                                     // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_SoftObjectReferenceToString_ReturnValue; // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ULevelLoaderWork*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreamingDynamic*                 CallFunc_LoadStreamLevel_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GUIFunction_C_LoadDynamicLevel) == 0x000008, "Wrong alignment on BP_GUIFunction_C_LoadDynamicLevel");
static_assert(sizeof(BP_GUIFunction_C_LoadDynamicLevel) == 0x000088, "Wrong size on BP_GUIFunction_C_LoadDynamicLevel");
static_assert(offsetof(BP_GUIFunction_C_LoadDynamicLevel, Level) == 0x000000, "Member 'BP_GUIFunction_C_LoadDynamicLevel::Level' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_LoadDynamicLevel, bVisible) == 0x000028, "Member 'BP_GUIFunction_C_LoadDynamicLevel::bVisible' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_LoadDynamicLevel, __WorldContext) == 0x000030, "Member 'BP_GUIFunction_C_LoadDynamicLevel::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_LoadDynamicLevel, LevelInstance) == 0x000038, "Member 'BP_GUIFunction_C_LoadDynamicLevel::LevelInstance' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_LoadDynamicLevel, CallFunc_Conv_SoftObjectReferenceToString_ReturnValue) == 0x000040, "Member 'BP_GUIFunction_C_LoadDynamicLevel::CallFunc_Conv_SoftObjectReferenceToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_LoadDynamicLevel, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000050, "Member 'BP_GUIFunction_C_LoadDynamicLevel::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_LoadDynamicLevel, CallFunc_Split_LeftS) == 0x000058, "Member 'BP_GUIFunction_C_LoadDynamicLevel::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_LoadDynamicLevel, CallFunc_Split_RightS) == 0x000068, "Member 'BP_GUIFunction_C_LoadDynamicLevel::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_LoadDynamicLevel, CallFunc_Split_ReturnValue) == 0x000078, "Member 'BP_GUIFunction_C_LoadDynamicLevel::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_LoadDynamicLevel, CallFunc_LoadStreamLevel_ReturnValue) == 0x000080, "Member 'BP_GUIFunction_C_LoadDynamicLevel::CallFunc_LoadStreamLevel_ReturnValue' has a wrong offset!");

// Function BP_GUIFunction.BP_GUIFunction_C.UnLoadDynamicLevel
// 0x0028 (0x0028 - 0x0000)
struct BP_GUIFunction_C_UnLoadDynamicLevel final
{
public:
	class FName                                   LevelName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ULevelLoaderWork*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GUIFunction_C_UnLoadDynamicLevel) == 0x000008, "Wrong alignment on BP_GUIFunction_C_UnLoadDynamicLevel");
static_assert(sizeof(BP_GUIFunction_C_UnLoadDynamicLevel) == 0x000028, "Wrong size on BP_GUIFunction_C_UnLoadDynamicLevel");
static_assert(offsetof(BP_GUIFunction_C_UnLoadDynamicLevel, LevelName) == 0x000000, "Member 'BP_GUIFunction_C_UnLoadDynamicLevel::LevelName' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_UnLoadDynamicLevel, __WorldContext) == 0x000008, "Member 'BP_GUIFunction_C_UnLoadDynamicLevel::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GUIFunction_C_UnLoadDynamicLevel, CallFunc_Conv_NameToString_ReturnValue) == 0x000010, "Member 'BP_GUIFunction_C_UnLoadDynamicLevel::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
