#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPB_NormalReplicate

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPB_NormalReplicate.BPB_NormalReplicate_C.ExecuteUbergraph_BPB_NormalReplicate
// 0x0008 (0x0008 - 0x0000)
struct BPB_NormalReplicate_C_ExecuteUbergraph_BPB_NormalReplicate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPB_NormalReplicate_C_ExecuteUbergraph_BPB_NormalReplicate) == 0x000004, "Wrong alignment on BPB_NormalReplicate_C_ExecuteUbergraph_BPB_NormalReplicate");
static_assert(sizeof(BPB_NormalReplicate_C_ExecuteUbergraph_BPB_NormalReplicate) == 0x000008, "Wrong size on BPB_NormalReplicate_C_ExecuteUbergraph_BPB_NormalReplicate");
static_assert(offsetof(BPB_NormalReplicate_C_ExecuteUbergraph_BPB_NormalReplicate, EntryPoint) == 0x000000, "Member 'BPB_NormalReplicate_C_ExecuteUbergraph_BPB_NormalReplicate::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPB_NormalReplicate_C_ExecuteUbergraph_BPB_NormalReplicate, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BPB_NormalReplicate_C_ExecuteUbergraph_BPB_NormalReplicate::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BPB_NormalReplicate.BPB_NormalReplicate_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BPB_NormalReplicate_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPB_NormalReplicate_C_ReceiveTick) == 0x000004, "Wrong alignment on BPB_NormalReplicate_C_ReceiveTick");
static_assert(sizeof(BPB_NormalReplicate_C_ReceiveTick) == 0x000004, "Wrong size on BPB_NormalReplicate_C_ReceiveTick");
static_assert(offsetof(BPB_NormalReplicate_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BPB_NormalReplicate_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

