#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPB_CommonShotNormal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InGameModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPB_CommonShotNormal.BPB_CommonShotNormal_C
// 0x0030 (0x1E10 - 0x1DE0)
class ABPB_CommonShotNormal_C final : public ABullet
{
public:
	uint8                                         Pad_1DD8[0x8];                                     // 0x1DD8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1DE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x1DE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      H1;                                                // 0x1DF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       b1;                                                // 0x1DF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x1E00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPB_CommonShotNormal(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPB_CommonShotNormal_C">();
	}
	static class ABPB_CommonShotNormal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPB_CommonShotNormal_C>();
	}
};
static_assert(alignof(ABPB_CommonShotNormal_C) == 0x000010, "Wrong alignment on ABPB_CommonShotNormal_C");
static_assert(sizeof(ABPB_CommonShotNormal_C) == 0x001E10, "Wrong size on ABPB_CommonShotNormal_C");
static_assert(offsetof(ABPB_CommonShotNormal_C, UberGraphFrame) == 0x001DE0, "Member 'ABPB_CommonShotNormal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABPB_CommonShotNormal_C, ParticleSystem) == 0x001DE8, "Member 'ABPB_CommonShotNormal_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABPB_CommonShotNormal_C, H1) == 0x001DF0, "Member 'ABPB_CommonShotNormal_C::H1' has a wrong offset!");
static_assert(offsetof(ABPB_CommonShotNormal_C, b1) == 0x001DF8, "Member 'ABPB_CommonShotNormal_C::b1' has a wrong offset!");
static_assert(offsetof(ABPB_CommonShotNormal_C, ProjectileMovement) == 0x001E00, "Member 'ABPB_CommonShotNormal_C::ProjectileMovement' has a wrong offset!");

}

