#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPB_PlusUltra

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InGameModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPB_PlusUltra.BPB_PlusUltra_C
// 0x0030 (0x1E10 - 0x1DE0)
class ABPB_PlusUltra_C final : public ABullet
{
public:
	uint8                                         Pad_1DD8[0x8];                                     // 0x1DD8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1DE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBulletParticleSystemComponent*         BulletParticleSystem;                              // 0x1DE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHeroSphereComponent*                   H1;                                                // 0x1DF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x1DF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Effect;                                            // 0x1E00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPB_PlusUltra(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPB_PlusUltra_C">();
	}
	static class ABPB_PlusUltra_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPB_PlusUltra_C>();
	}
};
static_assert(alignof(ABPB_PlusUltra_C) == 0x000010, "Wrong alignment on ABPB_PlusUltra_C");
static_assert(sizeof(ABPB_PlusUltra_C) == 0x001E10, "Wrong size on ABPB_PlusUltra_C");
static_assert(offsetof(ABPB_PlusUltra_C, UberGraphFrame) == 0x001DE0, "Member 'ABPB_PlusUltra_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABPB_PlusUltra_C, BulletParticleSystem) == 0x001DE8, "Member 'ABPB_PlusUltra_C::BulletParticleSystem' has a wrong offset!");
static_assert(offsetof(ABPB_PlusUltra_C, H1) == 0x001DF0, "Member 'ABPB_PlusUltra_C::H1' has a wrong offset!");
static_assert(offsetof(ABPB_PlusUltra_C, ProjectileMovement) == 0x001DF8, "Member 'ABPB_PlusUltra_C::ProjectileMovement' has a wrong offset!");
static_assert(offsetof(ABPB_PlusUltra_C, Effect) == 0x001E00, "Member 'ABPB_PlusUltra_C::Effect' has a wrong offset!");

}

