#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPB_CommonAttackLow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InGameModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPB_CommonAttackLow.BPB_CommonAttackLow_C
// 0x0020 (0x1E00 - 0x1DE0)
class ABPB_CommonAttackLow_C final : public ABullet
{
public:
	uint8                                         Pad_1DD8[0x8];                                     // 0x1DD8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1DE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHeroSphereComponent*                   b1;                                                // 0x1DE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHeroSphereComponent*                   H1;                                                // 0x1DF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x1DF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPB_CommonAttackLow(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPB_CommonAttackLow_C">();
	}
	static class ABPB_CommonAttackLow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPB_CommonAttackLow_C>();
	}
};
static_assert(alignof(ABPB_CommonAttackLow_C) == 0x000010, "Wrong alignment on ABPB_CommonAttackLow_C");
static_assert(sizeof(ABPB_CommonAttackLow_C) == 0x001E00, "Wrong size on ABPB_CommonAttackLow_C");
static_assert(offsetof(ABPB_CommonAttackLow_C, UberGraphFrame) == 0x001DE0, "Member 'ABPB_CommonAttackLow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABPB_CommonAttackLow_C, b1) == 0x001DE8, "Member 'ABPB_CommonAttackLow_C::b1' has a wrong offset!");
static_assert(offsetof(ABPB_CommonAttackLow_C, H1) == 0x001DF0, "Member 'ABPB_CommonAttackLow_C::H1' has a wrong offset!");
static_assert(offsetof(ABPB_CommonAttackLow_C, ProjectileMovement) == 0x001DF8, "Member 'ABPB_CommonAttackLow_C::ProjectileMovement' has a wrong offset!");

}

