#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPG_CommonShotReplicate

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPG_CommonShotReplicate.BPG_CommonShotReplicate_C.ExecuteUbergraph_BPG_CommonShotReplicate
// 0x0050 (0x0050 - 0x0000)
struct BPG_CommonShotReplicate_C_ExecuteUbergraph_BPG_CommonShotReplicate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetInitDirection_ReturnValue;             // 0x0004(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class ABullet*                                CallFunc_SpawnBullet_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPG_CommonShotReplicate_C_ExecuteUbergraph_BPG_CommonShotReplicate) == 0x000010, "Wrong alignment on BPG_CommonShotReplicate_C_ExecuteUbergraph_BPG_CommonShotReplicate");
static_assert(sizeof(BPG_CommonShotReplicate_C_ExecuteUbergraph_BPG_CommonShotReplicate) == 0x000050, "Wrong size on BPG_CommonShotReplicate_C_ExecuteUbergraph_BPG_CommonShotReplicate");
static_assert(offsetof(BPG_CommonShotReplicate_C_ExecuteUbergraph_BPG_CommonShotReplicate, EntryPoint) == 0x000000, "Member 'BPG_CommonShotReplicate_C_ExecuteUbergraph_BPG_CommonShotReplicate::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPG_CommonShotReplicate_C_ExecuteUbergraph_BPG_CommonShotReplicate, CallFunc_GetInitDirection_ReturnValue) == 0x000004, "Member 'BPG_CommonShotReplicate_C_ExecuteUbergraph_BPG_CommonShotReplicate::CallFunc_GetInitDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPG_CommonShotReplicate_C_ExecuteUbergraph_BPG_CommonShotReplicate, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'BPG_CommonShotReplicate_C_ExecuteUbergraph_BPG_CommonShotReplicate::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPG_CommonShotReplicate_C_ExecuteUbergraph_BPG_CommonShotReplicate, CallFunc_SpawnBullet_ReturnValue) == 0x000040, "Member 'BPG_CommonShotReplicate_C_ExecuteUbergraph_BPG_CommonShotReplicate::CallFunc_SpawnBullet_ReturnValue' has a wrong offset!");

}

