#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_Navigation

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTS_Navigation.BTS_Navigation_C.ExecuteUbergraph_BTS_Navigation
// 0x0038 (0x0038 - 0x0000)
struct BTS_Navigation_C_ExecuteUbergraph_BTS_Navigation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIControllerBattle*                    K2Node_DynamicCast_AsAIController_Battle;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_PossibleNavigation_ReturnValue;        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTS_Navigation_C_ExecuteUbergraph_BTS_Navigation) == 0x000008, "Wrong alignment on BTS_Navigation_C_ExecuteUbergraph_BTS_Navigation");
static_assert(sizeof(BTS_Navigation_C_ExecuteUbergraph_BTS_Navigation) == 0x000038, "Wrong size on BTS_Navigation_C_ExecuteUbergraph_BTS_Navigation");
static_assert(offsetof(BTS_Navigation_C_ExecuteUbergraph_BTS_Navigation, EntryPoint) == 0x000000, "Member 'BTS_Navigation_C_ExecuteUbergraph_BTS_Navigation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_Navigation_C_ExecuteUbergraph_BTS_Navigation, K2Node_Event_OwnerController) == 0x000008, "Member 'BTS_Navigation_C_ExecuteUbergraph_BTS_Navigation::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_Navigation_C_ExecuteUbergraph_BTS_Navigation, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTS_Navigation_C_ExecuteUbergraph_BTS_Navigation::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_Navigation_C_ExecuteUbergraph_BTS_Navigation, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BTS_Navigation_C_ExecuteUbergraph_BTS_Navigation::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTS_Navigation_C_ExecuteUbergraph_BTS_Navigation, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000020, "Member 'BTS_Navigation_C_ExecuteUbergraph_BTS_Navigation::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_Navigation_C_ExecuteUbergraph_BTS_Navigation, K2Node_DynamicCast_AsAIController_Battle) == 0x000028, "Member 'BTS_Navigation_C_ExecuteUbergraph_BTS_Navigation::K2Node_DynamicCast_AsAIController_Battle' has a wrong offset!");
static_assert(offsetof(BTS_Navigation_C_ExecuteUbergraph_BTS_Navigation, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BTS_Navigation_C_ExecuteUbergraph_BTS_Navigation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTS_Navigation_C_ExecuteUbergraph_BTS_Navigation, CallFunc_BP_PossibleNavigation_ReturnValue) == 0x000031, "Member 'BTS_Navigation_C_ExecuteUbergraph_BTS_Navigation::CallFunc_BP_PossibleNavigation_ReturnValue' has a wrong offset!");

// Function BTS_Navigation.BTS_Navigation_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTS_Navigation_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_Navigation_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTS_Navigation_C_ReceiveTickAI");
static_assert(sizeof(BTS_Navigation_C_ReceiveTickAI) == 0x000018, "Wrong size on BTS_Navigation_C_ReceiveTickAI");
static_assert(offsetof(BTS_Navigation_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTS_Navigation_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_Navigation_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTS_Navigation_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_Navigation_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTS_Navigation_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

