#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_DodgeStart

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_DodgeStart.BTT_DodgeStart_C.ExecuteUbergraph_BTT_DodgeStart
// 0x0030 (0x0030 - 0x0000)
struct BTT_DodgeStart_C_ExecuteUbergraph_BTT_DodgeStart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIControllerBattle*                    K2Node_DynamicCast_AsAIController_Battle;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_DodgeStart_ReturnValue;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BP_GetTargetPoint_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_DodgeStart_C_ExecuteUbergraph_BTT_DodgeStart) == 0x000008, "Wrong alignment on BTT_DodgeStart_C_ExecuteUbergraph_BTT_DodgeStart");
static_assert(sizeof(BTT_DodgeStart_C_ExecuteUbergraph_BTT_DodgeStart) == 0x000030, "Wrong size on BTT_DodgeStart_C_ExecuteUbergraph_BTT_DodgeStart");
static_assert(offsetof(BTT_DodgeStart_C_ExecuteUbergraph_BTT_DodgeStart, EntryPoint) == 0x000000, "Member 'BTT_DodgeStart_C_ExecuteUbergraph_BTT_DodgeStart::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_DodgeStart_C_ExecuteUbergraph_BTT_DodgeStart, K2Node_Event_OwnerController) == 0x000008, "Member 'BTT_DodgeStart_C_ExecuteUbergraph_BTT_DodgeStart::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_DodgeStart_C_ExecuteUbergraph_BTT_DodgeStart, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTT_DodgeStart_C_ExecuteUbergraph_BTT_DodgeStart::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_DodgeStart_C_ExecuteUbergraph_BTT_DodgeStart, K2Node_DynamicCast_AsAIController_Battle) == 0x000018, "Member 'BTT_DodgeStart_C_ExecuteUbergraph_BTT_DodgeStart::K2Node_DynamicCast_AsAIController_Battle' has a wrong offset!");
static_assert(offsetof(BTT_DodgeStart_C_ExecuteUbergraph_BTT_DodgeStart, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTT_DodgeStart_C_ExecuteUbergraph_BTT_DodgeStart::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_DodgeStart_C_ExecuteUbergraph_BTT_DodgeStart, CallFunc_BP_DodgeStart_ReturnValue) == 0x000021, "Member 'BTT_DodgeStart_C_ExecuteUbergraph_BTT_DodgeStart::CallFunc_BP_DodgeStart_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DodgeStart_C_ExecuteUbergraph_BTT_DodgeStart, CallFunc_BP_GetTargetPoint_ReturnValue) == 0x000028, "Member 'BTT_DodgeStart_C_ExecuteUbergraph_BTT_DodgeStart::CallFunc_BP_GetTargetPoint_ReturnValue' has a wrong offset!");

// Function BTT_DodgeStart.BTT_DodgeStart_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_DodgeStart_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_DodgeStart_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_DodgeStart_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_DodgeStart_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_DodgeStart_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_DodgeStart_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_DodgeStart_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_DodgeStart_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_DodgeStart_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

