#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmosManager

#include "Basic.hpp"

#include "CosmosApi_structs.hpp"


namespace SDK::Params
{

// Function CosmosManager.CosmosManager.OnCustomLobbyServerEvent
// 0x0018 (0x0018 - 0x0000)
struct CosmosManager_OnCustomLobbyServerEvent final
{
public:
	struct FCosmosCustomLobbyServerNotify         E;                                                 // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CosmosManager_OnCustomLobbyServerEvent) == 0x000008, "Wrong alignment on CosmosManager_OnCustomLobbyServerEvent");
static_assert(sizeof(CosmosManager_OnCustomLobbyServerEvent) == 0x000018, "Wrong size on CosmosManager_OnCustomLobbyServerEvent");
static_assert(offsetof(CosmosManager_OnCustomLobbyServerEvent, E) == 0x000000, "Member 'CosmosManager_OnCustomLobbyServerEvent::E' has a wrong offset!");

// Function CosmosManager.CosmosManager.OnCustomMatchingChangeSettingsEvent
// 0x0060 (0x0060 - 0x0000)
struct CosmosManager_OnCustomMatchingChangeSettingsEvent final
{
public:
	struct FCosmosChangeCustomRoomSettingsNotify  E;                                                 // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CosmosManager_OnCustomMatchingChangeSettingsEvent) == 0x000008, "Wrong alignment on CosmosManager_OnCustomMatchingChangeSettingsEvent");
static_assert(sizeof(CosmosManager_OnCustomMatchingChangeSettingsEvent) == 0x000060, "Wrong size on CosmosManager_OnCustomMatchingChangeSettingsEvent");
static_assert(offsetof(CosmosManager_OnCustomMatchingChangeSettingsEvent, E) == 0x000000, "Member 'CosmosManager_OnCustomMatchingChangeSettingsEvent::E' has a wrong offset!");

// Function CosmosManager.CosmosManager.OnCustomMatchingEvent
// 0x0008 (0x0008 - 0x0000)
struct CosmosManager_OnCustomMatchingEvent final
{
public:
	ECustomRoomEventId                            E;                                                 // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         S;                                                 // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CosmosManager_OnCustomMatchingEvent) == 0x000004, "Wrong alignment on CosmosManager_OnCustomMatchingEvent");
static_assert(sizeof(CosmosManager_OnCustomMatchingEvent) == 0x000008, "Wrong size on CosmosManager_OnCustomMatchingEvent");
static_assert(offsetof(CosmosManager_OnCustomMatchingEvent, E) == 0x000000, "Member 'CosmosManager_OnCustomMatchingEvent::E' has a wrong offset!");
static_assert(offsetof(CosmosManager_OnCustomMatchingEvent, S) == 0x000004, "Member 'CosmosManager_OnCustomMatchingEvent::S' has a wrong offset!");

// Function CosmosManager.CosmosManager.OnCustomMatchingRoomDataEvent
// 0x0068 (0x0068 - 0x0000)
struct CosmosManager_OnCustomMatchingRoomDataEvent final
{
public:
	struct FCosmosGetCustomRoomDataResponse       E;                                                 // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CosmosManager_OnCustomMatchingRoomDataEvent) == 0x000008, "Wrong alignment on CosmosManager_OnCustomMatchingRoomDataEvent");
static_assert(sizeof(CosmosManager_OnCustomMatchingRoomDataEvent) == 0x000068, "Wrong size on CosmosManager_OnCustomMatchingRoomDataEvent");
static_assert(offsetof(CosmosManager_OnCustomMatchingRoomDataEvent, E) == 0x000000, "Member 'CosmosManager_OnCustomMatchingRoomDataEvent::E' has a wrong offset!");

// Function CosmosManager.CosmosManager.OnCustomRoomReadiedEvent
// 0x0028 (0x0028 - 0x0000)
struct CosmosManager_OnCustomRoomReadiedEvent final
{
public:
	struct FCosmosCustomRoomReadiedNotify         E;                                                 // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CosmosManager_OnCustomRoomReadiedEvent) == 0x000008, "Wrong alignment on CosmosManager_OnCustomRoomReadiedEvent");
static_assert(sizeof(CosmosManager_OnCustomRoomReadiedEvent) == 0x000028, "Wrong size on CosmosManager_OnCustomRoomReadiedEvent");
static_assert(offsetof(CosmosManager_OnCustomRoomReadiedEvent, E) == 0x000000, "Member 'CosmosManager_OnCustomRoomReadiedEvent::E' has a wrong offset!");

// Function CosmosManager.CosmosManager.OnMatchingAppealEvent
// 0x0020 (0x0020 - 0x0000)
struct CosmosManager_OnMatchingAppealEvent final
{
public:
	struct FSquadAppealEvent                      E;                                                 // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CosmosManager_OnMatchingAppealEvent) == 0x000008, "Wrong alignment on CosmosManager_OnMatchingAppealEvent");
static_assert(sizeof(CosmosManager_OnMatchingAppealEvent) == 0x000020, "Wrong size on CosmosManager_OnMatchingAppealEvent");
static_assert(offsetof(CosmosManager_OnMatchingAppealEvent, E) == 0x000000, "Member 'CosmosManager_OnMatchingAppealEvent::E' has a wrong offset!");

// Function CosmosManager.CosmosManager.OnMatchingChatEvent
// 0x0030 (0x0030 - 0x0000)
struct CosmosManager_OnMatchingChatEvent final
{
public:
	struct FSquadChatEvent                        E;                                                 // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CosmosManager_OnMatchingChatEvent) == 0x000008, "Wrong alignment on CosmosManager_OnMatchingChatEvent");
static_assert(sizeof(CosmosManager_OnMatchingChatEvent) == 0x000030, "Wrong size on CosmosManager_OnMatchingChatEvent");
static_assert(offsetof(CosmosManager_OnMatchingChatEvent, E) == 0x000000, "Member 'CosmosManager_OnMatchingChatEvent::E' has a wrong offset!");

// Function CosmosManager.CosmosManager.OnMatchingErrorEvent
// 0x0004 (0x0004 - 0x0000)
struct CosmosManager_OnMatchingErrorEvent final
{
public:
	ECosmosProtocolResponseCode                   E;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CosmosManager_OnMatchingErrorEvent) == 0x000004, "Wrong alignment on CosmosManager_OnMatchingErrorEvent");
static_assert(sizeof(CosmosManager_OnMatchingErrorEvent) == 0x000004, "Wrong size on CosmosManager_OnMatchingErrorEvent");
static_assert(offsetof(CosmosManager_OnMatchingErrorEvent, E) == 0x000000, "Member 'CosmosManager_OnMatchingErrorEvent::E' has a wrong offset!");

// Function CosmosManager.CosmosManager.OnMatchingSquadEvent
// 0x0008 (0x0008 - 0x0000)
struct CosmosManager_OnMatchingSquadEvent final
{
public:
	struct FSquadEvent                            E;                                                 // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CosmosManager_OnMatchingSquadEvent) == 0x000004, "Wrong alignment on CosmosManager_OnMatchingSquadEvent");
static_assert(sizeof(CosmosManager_OnMatchingSquadEvent) == 0x000008, "Wrong size on CosmosManager_OnMatchingSquadEvent");
static_assert(offsetof(CosmosManager_OnMatchingSquadEvent, E) == 0x000000, "Member 'CosmosManager_OnMatchingSquadEvent::E' has a wrong offset!");

// Function CosmosManager.CosmosManager.OnReceiveCustomSquadAppealEvent
// 0x0020 (0x0020 - 0x0000)
struct CosmosManager_OnReceiveCustomSquadAppealEvent final
{
public:
	struct FCosmosCustomSquadAppealedNotify       E;                                                 // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CosmosManager_OnReceiveCustomSquadAppealEvent) == 0x000008, "Wrong alignment on CosmosManager_OnReceiveCustomSquadAppealEvent");
static_assert(sizeof(CosmosManager_OnReceiveCustomSquadAppealEvent) == 0x000020, "Wrong size on CosmosManager_OnReceiveCustomSquadAppealEvent");
static_assert(offsetof(CosmosManager_OnReceiveCustomSquadAppealEvent, E) == 0x000000, "Member 'CosmosManager_OnReceiveCustomSquadAppealEvent::E' has a wrong offset!");

// Function CosmosManager.CosmosManager.OnReceiveCustomSquadChatEvent
// 0x0020 (0x0020 - 0x0000)
struct CosmosManager_OnReceiveCustomSquadChatEvent final
{
public:
	struct FCosmosReceiveCustomSquadChatNotify    E;                                                 // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CosmosManager_OnReceiveCustomSquadChatEvent) == 0x000008, "Wrong alignment on CosmosManager_OnReceiveCustomSquadChatEvent");
static_assert(sizeof(CosmosManager_OnReceiveCustomSquadChatEvent) == 0x000020, "Wrong size on CosmosManager_OnReceiveCustomSquadChatEvent");
static_assert(offsetof(CosmosManager_OnReceiveCustomSquadChatEvent, E) == 0x000000, "Member 'CosmosManager_OnReceiveCustomSquadChatEvent::E' has a wrong offset!");

}

