#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmosWebApi

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CosmosWebApi_structs.hpp"


namespace SDK::Params
{

// Function CosmosWebApi.CosmosBlueprintLibrary.AppendLastSlash
// 0x0010 (0x0010 - 0x0000)
struct CosmosBlueprintLibrary_AppendLastSlash final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CosmosBlueprintLibrary_AppendLastSlash) == 0x000008, "Wrong alignment on CosmosBlueprintLibrary_AppendLastSlash");
static_assert(sizeof(CosmosBlueprintLibrary_AppendLastSlash) == 0x000010, "Wrong size on CosmosBlueprintLibrary_AppendLastSlash");
static_assert(offsetof(CosmosBlueprintLibrary_AppendLastSlash, URL) == 0x000000, "Member 'CosmosBlueprintLibrary_AppendLastSlash::URL' has a wrong offset!");

// Function CosmosWebApi.CosmosBlueprintLibrary.DecodeBase64Url
// 0x0028 (0x0028 - 0x0000)
struct CosmosBlueprintLibrary_DecodeBase64Url final
{
public:
	class FString                                 Source;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 Destination;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CosmosBlueprintLibrary_DecodeBase64Url) == 0x000008, "Wrong alignment on CosmosBlueprintLibrary_DecodeBase64Url");
static_assert(sizeof(CosmosBlueprintLibrary_DecodeBase64Url) == 0x000028, "Wrong size on CosmosBlueprintLibrary_DecodeBase64Url");
static_assert(offsetof(CosmosBlueprintLibrary_DecodeBase64Url, Source) == 0x000000, "Member 'CosmosBlueprintLibrary_DecodeBase64Url::Source' has a wrong offset!");
static_assert(offsetof(CosmosBlueprintLibrary_DecodeBase64Url, Destination) == 0x000010, "Member 'CosmosBlueprintLibrary_DecodeBase64Url::Destination' has a wrong offset!");
static_assert(offsetof(CosmosBlueprintLibrary_DecodeBase64Url, ReturnValue) == 0x000020, "Member 'CosmosBlueprintLibrary_DecodeBase64Url::ReturnValue' has a wrong offset!");

// Function CosmosWebApi.CosmosBlueprintLibrary.EncodeBase64Url
// 0x0028 (0x0028 - 0x0000)
struct CosmosBlueprintLibrary_EncodeBase64Url final
{
public:
	TArray<uint8>                                 Source;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Destination;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CosmosBlueprintLibrary_EncodeBase64Url) == 0x000008, "Wrong alignment on CosmosBlueprintLibrary_EncodeBase64Url");
static_assert(sizeof(CosmosBlueprintLibrary_EncodeBase64Url) == 0x000028, "Wrong size on CosmosBlueprintLibrary_EncodeBase64Url");
static_assert(offsetof(CosmosBlueprintLibrary_EncodeBase64Url, Source) == 0x000000, "Member 'CosmosBlueprintLibrary_EncodeBase64Url::Source' has a wrong offset!");
static_assert(offsetof(CosmosBlueprintLibrary_EncodeBase64Url, Destination) == 0x000010, "Member 'CosmosBlueprintLibrary_EncodeBase64Url::Destination' has a wrong offset!");
static_assert(offsetof(CosmosBlueprintLibrary_EncodeBase64Url, ReturnValue) == 0x000020, "Member 'CosmosBlueprintLibrary_EncodeBase64Url::ReturnValue' has a wrong offset!");

// Function CosmosWebApi.CosmosBlueprintLibrary.GetFormattedCurrentDateString
// 0x0010 (0x0010 - 0x0000)
struct CosmosBlueprintLibrary_GetFormattedCurrentDateString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CosmosBlueprintLibrary_GetFormattedCurrentDateString) == 0x000008, "Wrong alignment on CosmosBlueprintLibrary_GetFormattedCurrentDateString");
static_assert(sizeof(CosmosBlueprintLibrary_GetFormattedCurrentDateString) == 0x000010, "Wrong size on CosmosBlueprintLibrary_GetFormattedCurrentDateString");
static_assert(offsetof(CosmosBlueprintLibrary_GetFormattedCurrentDateString, ReturnValue) == 0x000000, "Member 'CosmosBlueprintLibrary_GetFormattedCurrentDateString::ReturnValue' has a wrong offset!");

// Function CosmosWebApi.CosmosBlueprintLibrary.GetFormattedDateString
// 0x0018 (0x0018 - 0x0000)
struct CosmosBlueprintLibrary_GetFormattedDateString final
{
public:
	struct FDateTime                              DateTime;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CosmosBlueprintLibrary_GetFormattedDateString) == 0x000008, "Wrong alignment on CosmosBlueprintLibrary_GetFormattedDateString");
static_assert(sizeof(CosmosBlueprintLibrary_GetFormattedDateString) == 0x000018, "Wrong size on CosmosBlueprintLibrary_GetFormattedDateString");
static_assert(offsetof(CosmosBlueprintLibrary_GetFormattedDateString, DateTime) == 0x000000, "Member 'CosmosBlueprintLibrary_GetFormattedDateString::DateTime' has a wrong offset!");
static_assert(offsetof(CosmosBlueprintLibrary_GetFormattedDateString, ReturnValue) == 0x000008, "Member 'CosmosBlueprintLibrary_GetFormattedDateString::ReturnValue' has a wrong offset!");

// Function CosmosWebApi.CosmosBlueprintLibrary.ParseFormattedDate
// 0x0020 (0x0020 - 0x0000)
struct CosmosBlueprintLibrary_ParseFormattedDate final
{
public:
	class FString                                 DateString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              OutDateTime;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CosmosBlueprintLibrary_ParseFormattedDate) == 0x000008, "Wrong alignment on CosmosBlueprintLibrary_ParseFormattedDate");
static_assert(sizeof(CosmosBlueprintLibrary_ParseFormattedDate) == 0x000020, "Wrong size on CosmosBlueprintLibrary_ParseFormattedDate");
static_assert(offsetof(CosmosBlueprintLibrary_ParseFormattedDate, DateString) == 0x000000, "Member 'CosmosBlueprintLibrary_ParseFormattedDate::DateString' has a wrong offset!");
static_assert(offsetof(CosmosBlueprintLibrary_ParseFormattedDate, OutDateTime) == 0x000010, "Member 'CosmosBlueprintLibrary_ParseFormattedDate::OutDateTime' has a wrong offset!");
static_assert(offsetof(CosmosBlueprintLibrary_ParseFormattedDate, ReturnValue) == 0x000018, "Member 'CosmosBlueprintLibrary_ParseFormattedDate::ReturnValue' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetCommonResponse
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_GetCommonResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCosmosResponseHeader                  RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCosmosCommonResponseParam             RespParam;                                         // 0x0030(0x0004)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApiConnect_GetCommonResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetCommonResponse");
static_assert(sizeof(WebApiConnect_GetCommonResponse) == 0x000038, "Wrong size on WebApiConnect_GetCommonResponse");
static_assert(offsetof(WebApiConnect_GetCommonResponse, Data) == 0x000000, "Member 'WebApiConnect_GetCommonResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCommonResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetCommonResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCommonResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetCommonResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetSysAgreeKpiResponse
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_GetSysAgreeKpiResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCosmosResponseHeader                  RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCosmosCommonResponseParam             RespParam;                                         // 0x0030(0x0004)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApiConnect_GetSysAgreeKpiResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetSysAgreeKpiResponse");
static_assert(sizeof(WebApiConnect_GetSysAgreeKpiResponse) == 0x000038, "Wrong size on WebApiConnect_GetSysAgreeKpiResponse");
static_assert(offsetof(WebApiConnect_GetSysAgreeKpiResponse, Data) == 0x000000, "Member 'WebApiConnect_GetSysAgreeKpiResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetSysAgreeKpiResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetSysAgreeKpiResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetSysAgreeKpiResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetSysAgreeKpiResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetSysCheckNgwordResponse
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_GetSysCheckNgwordResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCosmosResponseHeader                  RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCosmosCommonResponseParam             RespParam;                                         // 0x0030(0x0004)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApiConnect_GetSysCheckNgwordResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetSysCheckNgwordResponse");
static_assert(sizeof(WebApiConnect_GetSysCheckNgwordResponse) == 0x000038, "Wrong size on WebApiConnect_GetSysCheckNgwordResponse");
static_assert(offsetof(WebApiConnect_GetSysCheckNgwordResponse, Data) == 0x000000, "Member 'WebApiConnect_GetSysCheckNgwordResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetSysCheckNgwordResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetSysCheckNgwordResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetSysCheckNgwordResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetSysCheckNgwordResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetSysCheckNgwordV2Response
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_GetSysCheckNgwordV2Response final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCosmosResponseHeader                  RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCosmosCommonResponseParam             RespParam;                                         // 0x0030(0x0004)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApiConnect_GetSysCheckNgwordV2Response) == 0x000008, "Wrong alignment on WebApiConnect_GetSysCheckNgwordV2Response");
static_assert(sizeof(WebApiConnect_GetSysCheckNgwordV2Response) == 0x000038, "Wrong size on WebApiConnect_GetSysCheckNgwordV2Response");
static_assert(offsetof(WebApiConnect_GetSysCheckNgwordV2Response, Data) == 0x000000, "Member 'WebApiConnect_GetSysCheckNgwordV2Response::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetSysCheckNgwordV2Response, RespHeader) == 0x000008, "Member 'WebApiConnect_GetSysCheckNgwordV2Response::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetSysCheckNgwordV2Response, RespParam) == 0x000030, "Member 'WebApiConnect_GetSysCheckNgwordV2Response::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetSysGetEnvV2Response
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetSysGetEnvV2Response final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCosmosResponseHeader                  RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCosmosSysGetEnvV2ResponseParam        RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetSysGetEnvV2Response) == 0x000008, "Wrong alignment on WebApiConnect_GetSysGetEnvV2Response");
static_assert(sizeof(WebApiConnect_GetSysGetEnvV2Response) == 0x000048, "Wrong size on WebApiConnect_GetSysGetEnvV2Response");
static_assert(offsetof(WebApiConnect_GetSysGetEnvV2Response, Data) == 0x000000, "Member 'WebApiConnect_GetSysGetEnvV2Response::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetSysGetEnvV2Response, RespHeader) == 0x000008, "Member 'WebApiConnect_GetSysGetEnvV2Response::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetSysGetEnvV2Response, RespParam) == 0x000030, "Member 'WebApiConnect_GetSysGetEnvV2Response::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetSysGetEnvV2SeparateProjectResponse
// 0x0058 (0x0058 - 0x0000)
struct WebApiConnect_GetSysGetEnvV2SeparateProjectResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCosmosResponseHeader                  RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCosmosSysGetEnvV2SeparateProjectResponseParam RespParam;                                         // 0x0030(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetSysGetEnvV2SeparateProjectResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetSysGetEnvV2SeparateProjectResponse");
static_assert(sizeof(WebApiConnect_GetSysGetEnvV2SeparateProjectResponse) == 0x000058, "Wrong size on WebApiConnect_GetSysGetEnvV2SeparateProjectResponse");
static_assert(offsetof(WebApiConnect_GetSysGetEnvV2SeparateProjectResponse, Data) == 0x000000, "Member 'WebApiConnect_GetSysGetEnvV2SeparateProjectResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetSysGetEnvV2SeparateProjectResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetSysGetEnvV2SeparateProjectResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetSysGetEnvV2SeparateProjectResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetSysGetEnvV2SeparateProjectResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetSysGetEnvV3Response
// 0x0058 (0x0058 - 0x0000)
struct WebApiConnect_GetSysGetEnvV3Response final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCosmosResponseHeader                  RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCosmosSysGetEnvV3ResponseParam        RespParam;                                         // 0x0030(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetSysGetEnvV3Response) == 0x000008, "Wrong alignment on WebApiConnect_GetSysGetEnvV3Response");
static_assert(sizeof(WebApiConnect_GetSysGetEnvV3Response) == 0x000058, "Wrong size on WebApiConnect_GetSysGetEnvV3Response");
static_assert(offsetof(WebApiConnect_GetSysGetEnvV3Response, Data) == 0x000000, "Member 'WebApiConnect_GetSysGetEnvV3Response::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetSysGetEnvV3Response, RespHeader) == 0x000008, "Member 'WebApiConnect_GetSysGetEnvV3Response::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetSysGetEnvV3Response, RespParam) == 0x000030, "Member 'WebApiConnect_GetSysGetEnvV3Response::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetSysKpiResponse
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_GetSysKpiResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCosmosResponseHeader                  RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCosmosCommonResponseParam             RespParam;                                         // 0x0030(0x0004)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApiConnect_GetSysKpiResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetSysKpiResponse");
static_assert(sizeof(WebApiConnect_GetSysKpiResponse) == 0x000038, "Wrong size on WebApiConnect_GetSysKpiResponse");
static_assert(offsetof(WebApiConnect_GetSysKpiResponse, Data) == 0x000000, "Member 'WebApiConnect_GetSysKpiResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetSysKpiResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetSysKpiResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetSysKpiResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetSysKpiResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetSysOfflineKpiResponse
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_GetSysOfflineKpiResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCosmosResponseHeader                  RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCosmosCommonResponseParam             RespParam;                                         // 0x0030(0x0004)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApiConnect_GetSysOfflineKpiResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetSysOfflineKpiResponse");
static_assert(sizeof(WebApiConnect_GetSysOfflineKpiResponse) == 0x000038, "Wrong size on WebApiConnect_GetSysOfflineKpiResponse");
static_assert(offsetof(WebApiConnect_GetSysOfflineKpiResponse, Data) == 0x000000, "Member 'WebApiConnect_GetSysOfflineKpiResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetSysOfflineKpiResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetSysOfflineKpiResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetSysOfflineKpiResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetSysOfflineKpiResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetTssReadListResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetTssReadListResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCosmosResponseHeader                  RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCosmosTssReadListResponseParam        RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetTssReadListResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetTssReadListResponse");
static_assert(sizeof(WebApiConnect_GetTssReadListResponse) == 0x000048, "Wrong size on WebApiConnect_GetTssReadListResponse");
static_assert(offsetof(WebApiConnect_GetTssReadListResponse, Data) == 0x000000, "Member 'WebApiConnect_GetTssReadListResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetTssReadListResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetTssReadListResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetTssReadListResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetTssReadListResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetTssReadResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetTssReadResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCosmosResponseHeader                  RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCosmosTssReadResponseParam            RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetTssReadResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetTssReadResponse");
static_assert(sizeof(WebApiConnect_GetTssReadResponse) == 0x000048, "Wrong size on WebApiConnect_GetTssReadResponse");
static_assert(offsetof(WebApiConnect_GetTssReadResponse, Data) == 0x000000, "Member 'WebApiConnect_GetTssReadResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetTssReadResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetTssReadResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetTssReadResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetTssReadResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetUserAuthResponse
// 0x0050 (0x0050 - 0x0000)
struct WebApiConnect_GetUserAuthResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCosmosResponseHeader                  RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCosmosUserAuthResponseParam           RespParam;                                         // 0x0030(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetUserAuthResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetUserAuthResponse");
static_assert(sizeof(WebApiConnect_GetUserAuthResponse) == 0x000050, "Wrong size on WebApiConnect_GetUserAuthResponse");
static_assert(offsetof(WebApiConnect_GetUserAuthResponse, Data) == 0x000000, "Member 'WebApiConnect_GetUserAuthResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetUserAuthResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetUserAuthResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetUserAuthResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetUserAuthResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetUserConvertUserIdResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetUserConvertUserIdResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCosmosResponseHeader                  RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCosmosUserConvertUserIdResponseParam  RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetUserConvertUserIdResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetUserConvertUserIdResponse");
static_assert(sizeof(WebApiConnect_GetUserConvertUserIdResponse) == 0x000048, "Wrong size on WebApiConnect_GetUserConvertUserIdResponse");
static_assert(offsetof(WebApiConnect_GetUserConvertUserIdResponse, Data) == 0x000000, "Member 'WebApiConnect_GetUserConvertUserIdResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetUserConvertUserIdResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetUserConvertUserIdResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetUserConvertUserIdResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetUserConvertUserIdResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetUserGetCountryResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetUserGetCountryResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCosmosResponseHeader                  RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCosmosUserGetCountryResponseParam     RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetUserGetCountryResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetUserGetCountryResponse");
static_assert(sizeof(WebApiConnect_GetUserGetCountryResponse) == 0x000048, "Wrong size on WebApiConnect_GetUserGetCountryResponse");
static_assert(offsetof(WebApiConnect_GetUserGetCountryResponse, Data) == 0x000000, "Member 'WebApiConnect_GetUserGetCountryResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetUserGetCountryResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetUserGetCountryResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetUserGetCountryResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetUserGetCountryResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetUserGetTrackingNumResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetUserGetTrackingNumResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCosmosResponseHeader                  RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCosmosUserGetTrackingNumResponseParam RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetUserGetTrackingNumResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetUserGetTrackingNumResponse");
static_assert(sizeof(WebApiConnect_GetUserGetTrackingNumResponse) == 0x000048, "Wrong size on WebApiConnect_GetUserGetTrackingNumResponse");
static_assert(offsetof(WebApiConnect_GetUserGetTrackingNumResponse, Data) == 0x000000, "Member 'WebApiConnect_GetUserGetTrackingNumResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetUserGetTrackingNumResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetUserGetTrackingNumResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetUserGetTrackingNumResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetUserGetTrackingNumResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetUserLinkBnidResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetUserLinkBnidResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCosmosResponseHeader                  RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCosmosUserLinkBnidResponseParam       RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetUserLinkBnidResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetUserLinkBnidResponse");
static_assert(sizeof(WebApiConnect_GetUserLinkBnidResponse) == 0x000048, "Wrong size on WebApiConnect_GetUserLinkBnidResponse");
static_assert(offsetof(WebApiConnect_GetUserLinkBnidResponse, Data) == 0x000000, "Member 'WebApiConnect_GetUserLinkBnidResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetUserLinkBnidResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetUserLinkBnidResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetUserLinkBnidResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetUserLinkBnidResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetUserLoginV2Response
// 0x0050 (0x0050 - 0x0000)
struct WebApiConnect_GetUserLoginV2Response final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCosmosResponseHeader                  RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCosmosUserLoginV2ResponseParam        RespParam;                                         // 0x0030(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetUserLoginV2Response) == 0x000008, "Wrong alignment on WebApiConnect_GetUserLoginV2Response");
static_assert(sizeof(WebApiConnect_GetUserLoginV2Response) == 0x000050, "Wrong size on WebApiConnect_GetUserLoginV2Response");
static_assert(offsetof(WebApiConnect_GetUserLoginV2Response, Data) == 0x000000, "Member 'WebApiConnect_GetUserLoginV2Response::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetUserLoginV2Response, RespHeader) == 0x000008, "Member 'WebApiConnect_GetUserLoginV2Response::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetUserLoginV2Response, RespParam) == 0x000030, "Member 'WebApiConnect_GetUserLoginV2Response::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.Initialize
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_Initialize final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWebApiData*                            InWebApiData;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BaseUrl;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInHasHash;                                        // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LimitSec;                                          // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LocalUserId;                                       // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWebApiConnect*                         ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_Initialize) == 0x000008, "Wrong alignment on WebApiConnect_Initialize");
static_assert(sizeof(WebApiConnect_Initialize) == 0x000038, "Wrong size on WebApiConnect_Initialize");
static_assert(offsetof(WebApiConnect_Initialize, WorldContextObject) == 0x000000, "Member 'WebApiConnect_Initialize::WorldContextObject' has a wrong offset!");
static_assert(offsetof(WebApiConnect_Initialize, InWebApiData) == 0x000008, "Member 'WebApiConnect_Initialize::InWebApiData' has a wrong offset!");
static_assert(offsetof(WebApiConnect_Initialize, BaseUrl) == 0x000010, "Member 'WebApiConnect_Initialize::BaseUrl' has a wrong offset!");
static_assert(offsetof(WebApiConnect_Initialize, bInHasHash) == 0x000020, "Member 'WebApiConnect_Initialize::bInHasHash' has a wrong offset!");
static_assert(offsetof(WebApiConnect_Initialize, LimitSec) == 0x000024, "Member 'WebApiConnect_Initialize::LimitSec' has a wrong offset!");
static_assert(offsetof(WebApiConnect_Initialize, LocalUserId) == 0x000028, "Member 'WebApiConnect_Initialize::LocalUserId' has a wrong offset!");
static_assert(offsetof(WebApiConnect_Initialize, ReturnValue) == 0x000030, "Member 'WebApiConnect_Initialize::ReturnValue' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.SetHashKey
// 0x0018 (0x0018 - 0x0000)
struct WebApiConnect_SetHashKey final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HashKey;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_SetHashKey) == 0x000008, "Wrong alignment on WebApiConnect_SetHashKey");
static_assert(sizeof(WebApiConnect_SetHashKey) == 0x000018, "Wrong size on WebApiConnect_SetHashKey");
static_assert(offsetof(WebApiConnect_SetHashKey, WorldContextObject) == 0x000000, "Member 'WebApiConnect_SetHashKey::WorldContextObject' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SetHashKey, HashKey) == 0x000008, "Member 'WebApiConnect_SetHashKey::HashKey' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.SetHeader
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_SetHeader final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TitleCd;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserId;                                            // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Session;                                           // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Platform;                                          // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWebApiConnect*                         ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_SetHeader) == 0x000008, "Wrong alignment on WebApiConnect_SetHeader");
static_assert(sizeof(WebApiConnect_SetHeader) == 0x000048, "Wrong size on WebApiConnect_SetHeader");
static_assert(offsetof(WebApiConnect_SetHeader, WorldContextObject) == 0x000000, "Member 'WebApiConnect_SetHeader::WorldContextObject' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SetHeader, TitleCd) == 0x000008, "Member 'WebApiConnect_SetHeader::TitleCd' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SetHeader, UserId) == 0x000018, "Member 'WebApiConnect_SetHeader::UserId' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SetHeader, Session) == 0x000028, "Member 'WebApiConnect_SetHeader::Session' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SetHeader, Platform) == 0x000038, "Member 'WebApiConnect_SetHeader::Platform' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SetHeader, ReturnValue) == 0x000040, "Member 'WebApiConnect_SetHeader::ReturnValue' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.SysAgreeKpi
// 0x0018 (0x0018 - 0x0000)
struct WebApiConnect_SysAgreeKpi final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AgreeFlg;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWebApiConnect*                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_SysAgreeKpi) == 0x000008, "Wrong alignment on WebApiConnect_SysAgreeKpi");
static_assert(sizeof(WebApiConnect_SysAgreeKpi) == 0x000018, "Wrong size on WebApiConnect_SysAgreeKpi");
static_assert(offsetof(WebApiConnect_SysAgreeKpi, WorldContextObject) == 0x000000, "Member 'WebApiConnect_SysAgreeKpi::WorldContextObject' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysAgreeKpi, AgreeFlg) == 0x000008, "Member 'WebApiConnect_SysAgreeKpi::AgreeFlg' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysAgreeKpi, ReturnValue) == 0x000010, "Member 'WebApiConnect_SysAgreeKpi::ReturnValue' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.SysCheckNgword
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_SysCheckNgword final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Word;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Language;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CheckType;                                         // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWebApiConnect*                         ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_SysCheckNgword) == 0x000008, "Wrong alignment on WebApiConnect_SysCheckNgword");
static_assert(sizeof(WebApiConnect_SysCheckNgword) == 0x000038, "Wrong size on WebApiConnect_SysCheckNgword");
static_assert(offsetof(WebApiConnect_SysCheckNgword, WorldContextObject) == 0x000000, "Member 'WebApiConnect_SysCheckNgword::WorldContextObject' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysCheckNgword, Word) == 0x000008, "Member 'WebApiConnect_SysCheckNgword::Word' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysCheckNgword, Language) == 0x000018, "Member 'WebApiConnect_SysCheckNgword::Language' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysCheckNgword, CheckType) == 0x000028, "Member 'WebApiConnect_SysCheckNgword::CheckType' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysCheckNgword, ReturnValue) == 0x000030, "Member 'WebApiConnect_SysCheckNgword::ReturnValue' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.SysCheckNgwordV2
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_SysCheckNgwordV2 final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Word;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Language;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CheckType;                                         // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWebApiConnect*                         ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_SysCheckNgwordV2) == 0x000008, "Wrong alignment on WebApiConnect_SysCheckNgwordV2");
static_assert(sizeof(WebApiConnect_SysCheckNgwordV2) == 0x000038, "Wrong size on WebApiConnect_SysCheckNgwordV2");
static_assert(offsetof(WebApiConnect_SysCheckNgwordV2, WorldContextObject) == 0x000000, "Member 'WebApiConnect_SysCheckNgwordV2::WorldContextObject' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysCheckNgwordV2, Word) == 0x000008, "Member 'WebApiConnect_SysCheckNgwordV2::Word' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysCheckNgwordV2, Language) == 0x000018, "Member 'WebApiConnect_SysCheckNgwordV2::Language' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysCheckNgwordV2, CheckType) == 0x000028, "Member 'WebApiConnect_SysCheckNgwordV2::CheckType' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysCheckNgwordV2, ReturnValue) == 0x000030, "Member 'WebApiConnect_SysCheckNgwordV2::ReturnValue' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.SysGetEnvV2
// 0x0030 (0x0030 - 0x0000)
struct WebApiConnect_SysGetEnvV2 final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IssureId;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Token;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Region;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWebApiConnect*                         ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_SysGetEnvV2) == 0x000008, "Wrong alignment on WebApiConnect_SysGetEnvV2");
static_assert(sizeof(WebApiConnect_SysGetEnvV2) == 0x000030, "Wrong size on WebApiConnect_SysGetEnvV2");
static_assert(offsetof(WebApiConnect_SysGetEnvV2, WorldContextObject) == 0x000000, "Member 'WebApiConnect_SysGetEnvV2::WorldContextObject' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysGetEnvV2, IssureId) == 0x000008, "Member 'WebApiConnect_SysGetEnvV2::IssureId' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysGetEnvV2, Token) == 0x000010, "Member 'WebApiConnect_SysGetEnvV2::Token' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysGetEnvV2, Region) == 0x000020, "Member 'WebApiConnect_SysGetEnvV2::Region' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysGetEnvV2, ReturnValue) == 0x000028, "Member 'WebApiConnect_SysGetEnvV2::ReturnValue' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.SysGetEnvV2SeparateProject
// 0x0030 (0x0030 - 0x0000)
struct WebApiConnect_SysGetEnvV2SeparateProject final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IssureId;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Token;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Region;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWebApiConnect*                         ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_SysGetEnvV2SeparateProject) == 0x000008, "Wrong alignment on WebApiConnect_SysGetEnvV2SeparateProject");
static_assert(sizeof(WebApiConnect_SysGetEnvV2SeparateProject) == 0x000030, "Wrong size on WebApiConnect_SysGetEnvV2SeparateProject");
static_assert(offsetof(WebApiConnect_SysGetEnvV2SeparateProject, WorldContextObject) == 0x000000, "Member 'WebApiConnect_SysGetEnvV2SeparateProject::WorldContextObject' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysGetEnvV2SeparateProject, IssureId) == 0x000008, "Member 'WebApiConnect_SysGetEnvV2SeparateProject::IssureId' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysGetEnvV2SeparateProject, Token) == 0x000010, "Member 'WebApiConnect_SysGetEnvV2SeparateProject::Token' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysGetEnvV2SeparateProject, Region) == 0x000020, "Member 'WebApiConnect_SysGetEnvV2SeparateProject::Region' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysGetEnvV2SeparateProject, ReturnValue) == 0x000028, "Member 'WebApiConnect_SysGetEnvV2SeparateProject::ReturnValue' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.SysGetEnvV3
// 0x0040 (0x0040 - 0x0000)
struct WebApiConnect_SysGetEnvV3 final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IssureId;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Token;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Region;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Version;                                           // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWebApiConnect*                         ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_SysGetEnvV3) == 0x000008, "Wrong alignment on WebApiConnect_SysGetEnvV3");
static_assert(sizeof(WebApiConnect_SysGetEnvV3) == 0x000040, "Wrong size on WebApiConnect_SysGetEnvV3");
static_assert(offsetof(WebApiConnect_SysGetEnvV3, WorldContextObject) == 0x000000, "Member 'WebApiConnect_SysGetEnvV3::WorldContextObject' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysGetEnvV3, IssureId) == 0x000008, "Member 'WebApiConnect_SysGetEnvV3::IssureId' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysGetEnvV3, Token) == 0x000010, "Member 'WebApiConnect_SysGetEnvV3::Token' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysGetEnvV3, Region) == 0x000020, "Member 'WebApiConnect_SysGetEnvV3::Region' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysGetEnvV3, Version) == 0x000028, "Member 'WebApiConnect_SysGetEnvV3::Version' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysGetEnvV3, ReturnValue) == 0x000038, "Member 'WebApiConnect_SysGetEnvV3::ReturnValue' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.SysKpi
// 0x0020 (0x0020 - 0x0000)
struct WebApiConnect_SysKpi final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCosmosKpiNoColumnData>         KpiNoColumnData;                                   // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UWebApiConnect*                         ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_SysKpi) == 0x000008, "Wrong alignment on WebApiConnect_SysKpi");
static_assert(sizeof(WebApiConnect_SysKpi) == 0x000020, "Wrong size on WebApiConnect_SysKpi");
static_assert(offsetof(WebApiConnect_SysKpi, WorldContextObject) == 0x000000, "Member 'WebApiConnect_SysKpi::WorldContextObject' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysKpi, KpiNoColumnData) == 0x000008, "Member 'WebApiConnect_SysKpi::KpiNoColumnData' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysKpi, ReturnValue) == 0x000018, "Member 'WebApiConnect_SysKpi::ReturnValue' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.SysOfflineKpi
// 0x0020 (0x0020 - 0x0000)
struct WebApiConnect_SysOfflineKpi final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCosmosKpiNoColumnData>         KpiNoColumnData;                                   // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UWebApiConnect*                         ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_SysOfflineKpi) == 0x000008, "Wrong alignment on WebApiConnect_SysOfflineKpi");
static_assert(sizeof(WebApiConnect_SysOfflineKpi) == 0x000020, "Wrong size on WebApiConnect_SysOfflineKpi");
static_assert(offsetof(WebApiConnect_SysOfflineKpi, WorldContextObject) == 0x000000, "Member 'WebApiConnect_SysOfflineKpi::WorldContextObject' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysOfflineKpi, KpiNoColumnData) == 0x000008, "Member 'WebApiConnect_SysOfflineKpi::KpiNoColumnData' has a wrong offset!");
static_assert(offsetof(WebApiConnect_SysOfflineKpi, ReturnValue) == 0x000018, "Member 'WebApiConnect_SysOfflineKpi::ReturnValue' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.TssRead
// 0x0010 (0x0010 - 0x0000)
struct WebApiConnect_TssRead final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWebApiConnect*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_TssRead) == 0x000008, "Wrong alignment on WebApiConnect_TssRead");
static_assert(sizeof(WebApiConnect_TssRead) == 0x000010, "Wrong size on WebApiConnect_TssRead");
static_assert(offsetof(WebApiConnect_TssRead, WorldContextObject) == 0x000000, "Member 'WebApiConnect_TssRead::WorldContextObject' has a wrong offset!");
static_assert(offsetof(WebApiConnect_TssRead, ReturnValue) == 0x000008, "Member 'WebApiConnect_TssRead::ReturnValue' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.TssReadList
// 0x0010 (0x0010 - 0x0000)
struct WebApiConnect_TssReadList final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
