#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmosWebApi

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class CosmosWebApi.CosmosBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UCosmosBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AppendLastSlash(class FString* URL);
	static bool DecodeBase64Url(const class FString& Source, TArray<uint8>* Destination);
	static int32 EncodeBase64Url(const TArray<uint8>& Source, class FString* Destination);
	static class FString GetFormattedCurrentDateString();
	static class FString GetFormattedDateString(const struct FDateTime& DateTime);
	static bool ParseFormattedDate(const class FString& DateString, struct FDateTime* OutDateTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosBlueprintLibrary">();
	}
	static class UCosmosBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosBlueprintLibrary>();
	}
};
static_assert(alignof(UCosmosBlueprintLibrary) == 0x000008, "Wrong alignment on UCosmosBlueprintLibrary");
static_assert(sizeof(UCosmosBlueprintLibrary) == 0x000028, "Wrong size on UCosmosBlueprintLibrary");

// Class CosmosWebApi.WebApiConnect
// 0x0080 (0x00A8 - 0x0028)
class UWebApiConnect : public UObject
{
public:
	class UWebApiData*                            WebApiData;                                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNetMessage*                            RequestData;                                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x70];                                      // 0x0038(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void GetCommonResponse(class UNetMessage* Data, struct FCosmosResponseHeader* RespHeader, struct FCosmosCommonResponseParam* RespParam);
	static void GetSysAgreeKpiResponse(class UNetMessage* Data, struct FCosmosResponseHeader* RespHeader, struct FCosmosCommonResponseParam* RespParam);
	static void GetSysCheckNgwordResponse(class UNetMessage* Data, struct FCosmosResponseHeader* RespHeader, struct FCosmosCommonResponseParam* RespParam);
	static void GetSysCheckNgwordV2Response(class UNetMessage* Data, struct FCosmosResponseHeader* RespHeader, struct FCosmosCommonResponseParam* RespParam);
	static void GetSysGetEnvV2Response(class UNetMessage* Data, struct FCosmosResponseHeader* RespHeader, struct FCosmosSysGetEnvV2ResponseParam* RespParam);
	static void GetSysGetEnvV2SeparateProjectResponse(class UNetMessage* Data, struct FCosmosResponseHeader* RespHeader, struct FCosmosSysGetEnvV2SeparateProjectResponseParam* RespParam);
	static void GetSysGetEnvV3Response(class UNetMessage* Data, struct FCosmosResponseHeader* RespHeader, struct FCosmosSysGetEnvV3ResponseParam* RespParam);
	static void GetSysKpiResponse(class UNetMessage* Data, struct FCosmosResponseHeader* RespHeader, struct FCosmosCommonResponseParam* RespParam);
	static void GetSysOfflineKpiResponse(class UNetMessage* Data, struct FCosmosResponseHeader* RespHeader, struct FCosmosCommonResponseParam* RespParam);
	static void GetTssReadListResponse(class UNetMessage* Data, struct FCosmosResponseHeader* RespHeader, struct FCosmosTssReadListResponseParam* RespParam);
	static void GetTssReadResponse(class UNetMessage* Data, struct FCosmosResponseHeader* RespHeader, struct FCosmosTssReadResponseParam* RespParam);
	static void GetUserAuthResponse(class UNetMessage* Data, struct FCosmosResponseHeader* RespHeader, struct FCosmosUserAuthResponseParam* RespParam);
	static void GetUserConvertUserIdResponse(class UNetMessage* Data, struct FCosmosResponseHeader* RespHeader, struct FCosmosUserConvertUserIdResponseParam* RespParam);
	static void GetUserGetCountryResponse(class UNetMessage* Data, struct FCosmosResponseHeader* RespHeader, struct FCosmosUserGetCountryResponseParam* RespParam);
	static void GetUserGetTrackingNumResponse(class UNetMessage* Data, struct FCosmosResponseHeader* RespHeader, struct FCosmosUserGetTrackingNumResponseParam* RespParam);
	static void GetUserLinkBnidResponse(class UNetMessage* Data, struct FCosmosResponseHeader* RespHeader, struct FCosmosUserLinkBnidResponseParam* RespParam);
	static void GetUserLoginV2Response(class UNetMessage* Data, struct FCosmosResponseHeader* RespHeader, struct FCosmosUserLoginV2ResponseParam* RespParam);
	static class UWebApiConnect* Initialize(class UObject* WorldContextObject, class UWebApiData* InWebApiData, const class FString& BaseUrl, bool bInHasHash, float LimitSec, int32 LocalUserId);

	void SetHashKey(class UObject* WorldContextObject, const class FString& HashKey);
	class UWebApiConnect* SetHeader(class UObject* WorldContextObject, const class FString& TitleCd, const class FString& UserId, const class FString& Session, int32 Platform);
	class UWebApiConnect* SysAgreeKpi(class UObject* WorldContextObject, int32 AgreeFlg);
	class UWebApiConnect* SysCheckNgword(class UObject* WorldContextObject, const class FString& Word, const class FString& Language, int32 CheckType);
	class UWebApiConnect* SysCheckNgwordV2(class UObject* WorldContextObject, const class FString& Word, const class FString& Language, int32 CheckType);
	class UWebApiConnect* SysGetEnvV2(class UObject* WorldContextObject, int32 IssureId, const class FString& Token, int32 Region);
	class UWebApiConnect* SysGetEnvV2SeparateProject(class UObject* WorldContextObject, int32 IssureId, const class FString& Token, int32 Region);
	class UWebApiConnect* SysGetEnvV3(class UObject* WorldContextObject, int32 IssureId, const class FString& Token, int32 Region, const class FString& Version);
	class UWebApiConnect* SysKpi(class UObject* WorldContextObject, const TArray<struct FCosmosKpiNoColumnData>& KpiNoColumnData);
	class UWebApiConnect* SysOfflineKpi(class UObject* WorldContextObject, const TArray<struct FCosmosKpiNoColumnData>& KpiNoColumnData);
	class UWebApiConnect* TssRead(class UObject* WorldContextObject);
	class UWebApiConnect* TssReadList(class UObject* WorldContextObject);
	class UWebApiConnect* UserAuth(class UObject* WorldContextObject, const class FString& PUserId, const class FString& Token, int32 SkuType);
	class UWebApiConnect* UserConvertUserId(class UObject* WorldContextObject, const TArray<class FString>& PUserId);
	class UWebApiConnect* UserGetCountry(class UObject* WorldContextObject);
	class UWebApiConnect* UserGetTrackingNum(class UObject* WorldContextObject);
	class UWebApiConnect* UserLinkBnid(class UObject* WorldContextObject);
	class UWebApiConnect* UserLoginV2(class UObject* WorldContextObject, const class FString& PUserId, const class FString& Token, int32 SkuType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WebApiConnect">();
	}
	static class UWebApiConnect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWebApiConnect>();
	}
};
static_assert(alignof(UWebApiConnect) == 0x000008, "Wrong alignment on UWebApiConnect");
static_assert(sizeof(UWebApiConnect) == 0x0000A8, "Wrong size on UWebApiConnect");
static_assert(offsetof(UWebApiConnect, WebApiData) == 0x000028, "Member 'UWebApiConnect::WebApiData' has a wrong offset!");
static_assert(offsetof(UWebApiConnect, RequestData) == 0x000030, "Member 'UWebApiConnect::RequestData' has a wrong offset!");

// Class CosmosWebApi.CosmosCommonMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosCommonMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosCommonMessage">();
	}
	static class UCosmosCommonMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosCommonMessage>();
	}
};
static_assert(alignof(UCosmosCommonMessage) == 0x000008, "Wrong alignment on UCosmosCommonMessage");
static_assert(sizeof(UCosmosCommonMessage) == 0x0000B8, "Wrong size on UCosmosCommonMessage");

// Class CosmosWebApi.CosmosUserLoginV2Message
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosUserLoginV2Message final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosUserLoginV2Message">();
	}
	static class UCosmosUserLoginV2Message* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosUserLoginV2Message>();
	}
};
static_assert(alignof(UCosmosUserLoginV2Message) == 0x000008, "Wrong alignment on UCosmosUserLoginV2Message");
static_assert(sizeof(UCosmosUserLoginV2Message) == 0x0000B8, "Wrong size on UCosmosUserLoginV2Message");

// Class CosmosWebApi.CosmosUserAuthMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosUserAuthMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosUserAuthMessage">();
	}
	static class UCosmosUserAuthMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosUserAuthMessage>();
	}
};
static_assert(alignof(UCosmosUserAuthMessage) == 0x000008, "Wrong alignment on UCosmosUserAuthMessage");
static_assert(sizeof(UCosmosUserAuthMessage) == 0x0000B8, "Wrong size on UCosmosUserAuthMessage");

// Class CosmosWebApi.CosmosUserConvertUserIdMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosUserConvertUserIdMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosUserConvertUserIdMessage">();
	}
	static class UCosmosUserConvertUserIdMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosUserConvertUserIdMessage>();
	}
};
static_assert(alignof(UCosmosUserConvertUserIdMessage) == 0x000008, "Wrong alignment on UCosmosUserConvertUserIdMessage");
static_assert(sizeof(UCosmosUserConvertUserIdMessage) == 0x0000B8, "Wrong size on UCosmosUserConvertUserIdMessage");

// Class CosmosWebApi.CosmosUserLinkBnidMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosUserLinkBnidMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosUserLinkBnidMessage">();
	}
	static class UCosmosUserLinkBnidMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosUserLinkBnidMessage>();
	}
};
static_assert(alignof(UCosmosUserLinkBnidMessage) == 0x000008, "Wrong alignment on UCosmosUserLinkBnidMessage");
static_assert(sizeof(UCosmosUserLinkBnidMessage) == 0x0000B8, "Wrong size on UCosmosUserLinkBnidMessage");

// Class CosmosWebApi.CosmosUserGetTrackingNumMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosUserGetTrackingNumMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosUserGetTrackingNumMessage">();
	}
	static class UCosmosUserGetTrackingNumMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosUserGetTrackingNumMessage>();
	}
};
static_assert(alignof(UCosmosUserGetTrackingNumMessage) == 0x000008, "Wrong alignment on UCosmosUserGetTrackingNumMessage");
static_assert(sizeof(UCosmosUserGetTrackingNumMessage) == 0x0000B8, "Wrong size on UCosmosUserGetTrackingNumMessage");

// Class CosmosWebApi.CosmosUserGetCountryMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosUserGetCountryMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosUserGetCountryMessage">();
	}
	static class UCosmosUserGetCountryMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosUserGetCountryMessage>();
	}
};
static_assert(alignof(UCosmosUserGetCountryMessage) == 0x000008, "Wrong alignment on UCosmosUserGetCountryMessage");
static_assert(sizeof(UCosmosUserGetCountryMessage) == 0x0000B8, "Wrong size on UCosmosUserGetCountryMessage");

// Class CosmosWebApi.CosmosSysGetEnvV2Message
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosSysGetEnvV2Message final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosSysGetEnvV2Message">();
	}
	static class UCosmosSysGetEnvV2Message* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosSysGetEnvV2Message>();
	}
};
static_assert(alignof(UCosmosSysGetEnvV2Message) == 0x000008, "Wrong alignment on UCosmosSysGetEnvV2Message");
static_assert(sizeof(UCosmosSysGetEnvV2Message) == 0x0000B8, "Wrong size on UCosmosSysGetEnvV2Message");

// Class CosmosWebApi.CosmosSysGetEnvV2SeparateProjectMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosSysGetEnvV2SeparateProjectMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosSysGetEnvV2SeparateProjectMessage">();
	}
	static class UCosmosSysGetEnvV2SeparateProjectMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosSysGetEnvV2SeparateProjectMessage>();
	}
};
static_assert(alignof(UCosmosSysGetEnvV2SeparateProjectMessage) == 0x000008, "Wrong alignment on UCosmosSysGetEnvV2SeparateProjectMessage");
static_assert(sizeof(UCosmosSysGetEnvV2SeparateProjectMessage) == 0x0000B8, "Wrong size on UCosmosSysGetEnvV2SeparateProjectMessage");

// Class CosmosWebApi.CosmosSysGetEnvV3Message
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosSysGetEnvV3Message final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosSysGetEnvV3Message">();
	}
	static class UCosmosSysGetEnvV3Message* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosSysGetEnvV3Message>();
	}
};
static_assert(alignof(UCosmosSysGetEnvV3Message) == 0x000008, "Wrong alignment on UCosmosSysGetEnvV3Message");
static_assert(sizeof(UCosmosSysGetEnvV3Message) == 0x0000B8, "Wrong size on UCosmosSysGetEnvV3Message");

// Class CosmosWebApi.CosmosTssReadMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosTssReadMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosTssReadMessage">();
	}
	static class UCosmosTssReadMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosTssReadMessage>();
	}
};
static_assert(alignof(UCosmosTssReadMessage) == 0x000008, "Wrong alignment on UCosmosTssReadMessage");
static_assert(sizeof(UCosmosTssReadMessage) == 0x0000B8, "Wrong size on UCosmosTssReadMessage");

// Class CosmosWebApi.CosmosTssReadListMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosTssReadListMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosTssReadListMessage">();
	}
	static class UCosmosTssReadListMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosTssReadListMessage>();
	}
};
static_assert(alignof(UCosmosTssReadListMessage) == 0x000008, "Wrong alignment on UCosmosTssReadListMessage");
static_assert(sizeof(UCosmosTssReadListMessage) == 0x0000B8, "Wrong size on UCosmosTssReadListMessage");

// Class CosmosWebApi.CosmosMainGetMenuMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosMainGetMenuMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosMainGetMenuMessage">();
	}
	static class UCosmosMainGetMenuMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosMainGetMenuMessage>();
	}
};
static_assert(alignof(UCosmosMainGetMenuMessage) == 0x000008, "Wrong alignment on UCosmosMainGetMenuMessage");
static_assert(sizeof(UCosmosMainGetMenuMessage) == 0x0000B8, "Wrong size on UCosmosMainGetMenuMessage");

// Class CosmosWebApi.CosmosMainGetVersionMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosMainGetVersionMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosMainGetVersionMessage">();
	}
	static class UCosmosMainGetVersionMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosMainGetVersionMessage>();
	}
};
static_assert(alignof(UCosmosMainGetVersionMessage) == 0x000008, "Wrong alignment on UCosmosMainGetVersionMessage");
static_assert(sizeof(UCosmosMainGetVersionMessage) == 0x0000B8, "Wrong size on UCosmosMainGetVersionMessage");

// Class CosmosWebApi.CosmosProfileGetProfileMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosProfileGetProfileMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosProfileGetProfileMessage">();
	}
	static class UCosmosProfileGetProfileMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosProfileGetProfileMessage>();
	}
};
static_assert(alignof(UCosmosProfileGetProfileMessage) == 0x000008, "Wrong alignment on UCosmosProfileGetProfileMessage");
static_assert(sizeof(UCosmosProfileGetProfileMessage) == 0x0000B8, "Wrong size on UCosmosProfileGetProfileMessage");

// Class CosmosWebApi.CosmosProfileGetDedprofileMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosProfileGetDedprofileMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosProfileGetDedprofileMessage">();
	}
	static class UCosmosProfileGetDedprofileMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosProfileGetDedprofileMessage>();
	}
};
static_assert(alignof(UCosmosProfileGetDedprofileMessage) == 0x000008, "Wrong alignment on UCosmosProfileGetDedprofileMessage");
static_assert(sizeof(UCosmosProfileGetDedprofileMessage) == 0x0000B8, "Wrong size on UCosmosProfileGetDedprofileMessage");

// Class CosmosWebApi.CosmosPresetGetPresetListMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosPresetGetPresetListMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosPresetGetPresetListMessage">();
	}
	static class UCosmosPresetGetPresetListMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosPresetGetPresetListMessage>();
	}
};
static_assert(alignof(UCosmosPresetGetPresetListMessage) == 0x000008, "Wrong alignment on UCosmosPresetGetPresetListMessage");
static_assert(sizeof(UCosmosPresetGetPresetListMessage) == 0x0000B8, "Wrong size on UCosmosPresetGetPresetListMessage");

// Class CosmosWebApi.CosmosFriendGetFriendshipListMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosFriendGetFriendshipListMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosFriendGetFriendshipListMessage">();
	}
	static class UCosmosFriendGetFriendshipListMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosFriendGetFriendshipListMessage>();
	}
};
static_assert(alignof(UCosmosFriendGetFriendshipListMessage) == 0x000008, "Wrong alignment on UCosmosFriendGetFriendshipListMessage");
static_assert(sizeof(UCosmosFriendGetFriendshipListMessage) == 0x0000B8, "Wrong size on UCosmosFriendGetFriendshipListMessage");

// Class CosmosWebApi.CosmosBattleGetBattleRecordListMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosBattleGetBattleRecordListMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosBattleGetBattleRecordListMessage">();
	}
	static class UCosmosBattleGetBattleRecordListMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosBattleGetBattleRecordListMessage>();
	}
};
static_assert(alignof(UCosmosBattleGetBattleRecordListMessage) == 0x000008, "Wrong alignment on UCosmosBattleGetBattleRecordListMessage");
static_assert(sizeof(UCosmosBattleGetBattleRecordListMessage) == 0x0000B8, "Wrong size on UCosmosBattleGetBattleRecordListMessage");

// Class CosmosWebApi.CosmosBattleUserResultMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosBattleUserResultMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosBattleUserResultMessage">();
	}
	static class UCosmosBattleUserResultMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosBattleUserResultMessage>();
	}
};
static_assert(alignof(UCosmosBattleUserResultMessage) == 0x000008, "Wrong alignment on UCosmosBattleUserResultMessage");
static_assert(sizeof(UCosmosBattleUserResultMessage) == 0x0000B8, "Wrong size on UCosmosBattleUserResultMessage");

// Class CosmosWebApi.CosmosBattleCalcSkillBaseMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosBattleCalcSkillBaseMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosBattleCalcSkillBaseMessage">();
	}
	static class UCosmosBattleCalcSkillBaseMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosBattleCalcSkillBaseMessage>();
	}
};
static_assert(alignof(UCosmosBattleCalcSkillBaseMessage) == 0x000008, "Wrong alignment on UCosmosBattleCalcSkillBaseMessage");
static_assert(sizeof(UCosmosBattleCalcSkillBaseMessage) == 0x0000B8, "Wrong size on UCosmosBattleCalcSkillBaseMessage");

// Class CosmosWebApi.CosmosBattleGameStartMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosBattleGameStartMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosBattleGameStartMessage">();
	}
	static class UCosmosBattleGameStartMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosBattleGameStartMessage>();
	}
};
static_assert(alignof(UCosmosBattleGameStartMessage) == 0x000008, "Wrong alignment on UCosmosBattleGameStartMessage");
static_assert(sizeof(UCosmosBattleGameStartMessage) == 0x0000B8, "Wrong size on UCosmosBattleGameStartMessage");

// Class CosmosWebApi.CosmosGuildGetGuildListMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosGuildGetGuildListMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosGuildGetGuildListMessage">();
	}
	static class UCosmosGuildGetGuildListMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosGuildGetGuildListMessage>();
	}
};
static_assert(alignof(UCosmosGuildGetGuildListMessage) == 0x000008, "Wrong alignment on UCosmosGuildGetGuildListMessage");
static_assert(sizeof(UCosmosGuildGetGuildListMessage) == 0x0000B8, "Wrong size on UCosmosGuildGetGuildListMessage");

// Class CosmosWebApi.CosmosGuildGetGuildInfoMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosGuildGetGuildInfoMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosGuildGetGuildInfoMessage">();
	}
	static class UCosmosGuildGetGuildInfoMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosGuildGetGuildInfoMessage>();
	}
};
static_assert(alignof(UCosmosGuildGetGuildInfoMessage) == 0x000008, "Wrong alignment on UCosmosGuildGetGuildInfoMessage");
static_assert(sizeof(UCosmosGuildGetGuildInfoMessage) == 0x0000B8, "Wrong size on UCosmosGuildGetGuildInfoMessage");

// Class CosmosWebApi.CosmosGuildGuildCreateMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosGuildGuildCreateMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosGuildGuildCreateMessage">();
	}
	static class UCosmosGuildGuildCreateMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosGuildGuildCreateMessage>();
	}
};
static_assert(alignof(UCosmosGuildGuildCreateMessage) == 0x000008, "Wrong alignment on UCosmosGuildGuildCreateMessage");
static_assert(sizeof(UCosmosGuildGuildCreateMessage) == 0x0000B8, "Wrong size on UCosmosGuildGuildCreateMessage");

// Class CosmosWebApi.CosmosGuildSetJoinMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosGuildSetJoinMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosGuildSetJoinMessage">();
	}
	static class UCosmosGuildSetJoinMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosGuildSetJoinMessage>();
	}
};
static_assert(alignof(UCosmosGuildSetJoinMessage) == 0x000008, "Wrong alignment on UCosmosGuildSetJoinMessage");
static_assert(sizeof(UCosmosGuildSetJoinMessage) == 0x0000B8, "Wrong size on UCosmosGuildSetJoinMessage");

// Class CosmosWebApi.CosmosGuildGetMemberListMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosGuildGetMemberListMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosGuildGetMemberListMessage">();
	}
	static class UCosmosGuildGetMemberListMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosGuildGetMemberListMessage>();
	}
};
static_assert(alignof(UCosmosGuildGetMemberListMessage) == 0x000008, "Wrong alignment on UCosmosGuildGetMemberListMessage");
static_assert(sizeof(UCosmosGuildGetMemberListMessage) == 0x0000B8, "Wrong size on UCosmosGuildGetMemberListMessage");

// Class CosmosWebApi.CosmosGuildGetRecordsMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosGuildGetRecordsMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosGuildGetRecordsMessage">();
	}
	static class UCosmosGuildGetRecordsMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosGuildGetRecordsMessage>();
	}
};
static_assert(alignof(UCosmosGuildGetRecordsMessage) == 0x000008, "Wrong alignment on UCosmosGuildGetRecordsMessage");
static_assert(sizeof(UCosmosGuildGetRecordsMessage) == 0x0000B8, "Wrong size on UCosmosGuildGetRecordsMessage");

// Class CosmosWebApi.CosmosGuildSetFundsMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosGuildSetFundsMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosGuildSetFundsMessage">();
	}
	static class UCosmosGuildSetFundsMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosGuildSetFundsMessage>();
	}
};
static_assert(alignof(UCosmosGuildSetFundsMessage) == 0x000008, "Wrong alignment on UCosmosGuildSetFundsMessage");
static_assert(sizeof(UCosmosGuildSetFundsMessage) == 0x0000B8, "Wrong size on UCosmosGuildSetFundsMessage");

// Class CosmosWebApi.CosmosGuildUseBoostMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosGuildUseBoostMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosGuildUseBoostMessage">();
	}
	static class UCosmosGuildUseBoostMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosGuildUseBoostMessage>();
	}
};
static_assert(alignof(UCosmosGuildUseBoostMessage) == 0x000008, "Wrong alignment on UCosmosGuildUseBoostMessage");
static_assert(sizeof(UCosmosGuildUseBoostMessage) == 0x0000B8, "Wrong size on UCosmosGuildUseBoostMessage");

// Class CosmosWebApi.CosmosShopGetShopMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosShopGetShopMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosShopGetShopMessage">();
	}
	static class UCosmosShopGetShopMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosShopGetShopMessage>();
	}
};
static_assert(alignof(UCosmosShopGetShopMessage) == 0x000008, "Wrong alignment on UCosmosShopGetShopMessage");
static_assert(sizeof(UCosmosShopGetShopMessage) == 0x0000B8, "Wrong size on UCosmosShopGetShopMessage");

// Class CosmosWebApi.CosmosShopPurchaseItemMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosShopPurchaseItemMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosShopPurchaseItemMessage">();
	}
	static class UCosmosShopPurchaseItemMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosShopPurchaseItemMessage>();
	}
};
static_assert(alignof(UCosmosShopPurchaseItemMessage) == 0x000008, "Wrong alignment on UCosmosShopPurchaseItemMessage");
static_assert(sizeof(UCosmosShopPurchaseItemMessage) == 0x0000B8, "Wrong size on UCosmosShopPurchaseItemMessage");

// Class CosmosWebApi.CosmosLoginbonusGetListMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosLoginbonusGetListMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosLoginbonusGetListMessage">();
	}
	static class UCosmosLoginbonusGetListMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosLoginbonusGetListMessage>();
	}
};
static_assert(alignof(UCosmosLoginbonusGetListMessage) == 0x000008, "Wrong alignment on UCosmosLoginbonusGetListMessage");
static_assert(sizeof(UCosmosLoginbonusGetListMessage) == 0x0000B8, "Wrong size on UCosmosLoginbonusGetListMessage");

// Class CosmosWebApi.CosmosLoginbonusGetBonusMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosLoginbonusGetBonusMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosLoginbonusGetBonusMessage">();
	}
	static class UCosmosLoginbonusGetBonusMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosLoginbonusGetBonusMessage>();
	}
};
static_assert(alignof(UCosmosLoginbonusGetBonusMessage) == 0x000008, "Wrong alignment on UCosmosLoginbonusGetBonusMessage");
static_assert(sizeof(UCosmosLoginbonusGetBonusMessage) == 0x0000B8, "Wrong size on UCosmosLoginbonusGetBonusMessage");

// Class CosmosWebApi.CosmosLoginbonusPurchasePremiumMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosLoginbonusPurchasePremiumMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosLoginbonusPurchasePremiumMessage">();
	}
	static class UCosmosLoginbonusPurchasePremiumMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosLoginbonusPurchasePremiumMessage>();
	}
};
static_assert(alignof(UCosmosLoginbonusPurchasePremiumMessage) == 0x000008, "Wrong alignment on UCosmosLoginbonusPurchasePremiumMessage");
static_assert(sizeof(UCosmosLoginbonusPurchasePremiumMessage) == 0x0000B8, "Wrong size on UCosmosLoginbonusPurchasePremiumMessage");

// Class CosmosWebApi.CosmosBillboardGetChartListMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosBillboardGetChartListMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosBillboardGetChartListMessage">();
	}
	static class UCosmosBillboardGetChartListMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosBillboardGetChartListMessage>();
	}
};
static_assert(alignof(UCosmosBillboardGetChartListMessage) == 0x000008, "Wrong alignment on UCosmosBillboardGetChartListMessage");
static_assert(sizeof(UCosmosBillboardGetChartListMessage) == 0x0000B8, "Wrong size on UCosmosBillboardGetChartListMessage");

// Class CosmosWebApi.CosmosNoticeGetNoticeListMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosNoticeGetNoticeListMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosNoticeGetNoticeListMessage">();
	}
	static class UCosmosNoticeGetNoticeListMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosNoticeGetNoticeListMessage>();
	}
};
static_assert(alignof(UCosmosNoticeGetNoticeListMessage) == 0x000008, "Wrong alignment on UCosmosNoticeGetNoticeListMessage");
static_assert(sizeof(UCosmosNoticeGetNoticeListMessage) == 0x0000B8, "Wrong size on UCosmosNoticeGetNoticeListMessage");

// Class CosmosWebApi.CosmosNoticeGetNoticeReceiveMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosNoticeGetNoticeReceiveMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosNoticeGetNoticeReceiveMessage">();
	}
	static class UCosmosNoticeGetNoticeReceiveMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosNoticeGetNoticeReceiveMessage>();
	}
};
static_assert(alignof(UCosmosNoticeGetNoticeReceiveMessage) == 0x000008, "Wrong alignment on UCosmosNoticeGetNoticeReceiveMessage");
static_assert(sizeof(UCosmosNoticeGetNoticeReceiveMessage) == 0x0000B8, "Wrong size on UCosmosNoticeGetNoticeReceiveMessage");

// Class CosmosWebApi.CosmosSeasonpassGetMasterListMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosSeasonpassGetMasterListMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosSeasonpassGetMasterListMessage">();
	}
	static class UCosmosSeasonpassGetMasterListMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosSeasonpassGetMasterListMessage>();
	}
};
static_assert(alignof(UCosmosSeasonpassGetMasterListMessage) == 0x000008, "Wrong alignment on UCosmosSeasonpassGetMasterListMessage");
static_assert(sizeof(UCosmosSeasonpassGetMasterListMessage) == 0x0000B8, "Wrong size on UCosmosSeasonpassGetMasterListMessage");

// Class CosmosWebApi.CosmosSeasonpassGetStockInfoMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosSeasonpassGetStockInfoMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosSeasonpassGetStockInfoMessage">();
	}
	static class UCosmosSeasonpassGetStockInfoMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosSeasonpassGetStockInfoMessage>();
	}
};
static_assert(alignof(UCosmosSeasonpassGetStockInfoMessage) == 0x000008, "Wrong alignment on UCosmosSeasonpassGetStockInfoMessage");
static_assert(sizeof(UCosmosSeasonpassGetStockInfoMessage) == 0x0000B8, "Wrong size on UCosmosSeasonpassGetStockInfoMessage");

// Class CosmosWebApi.CosmosSquadInvitedListMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosSquadInvitedListMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosSquadInvitedListMessage">();
	}
	static class UCosmosSquadInvitedListMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosSquadInvitedListMessage>();
	}
};
static_assert(alignof(UCosmosSquadInvitedListMessage) == 0x000008, "Wrong alignment on UCosmosSquadInvitedListMessage");
static_assert(sizeof(UCosmosSquadInvitedListMessage) == 0x0000B8, "Wrong size on UCosmosSquadInvitedListMessage");

// Class CosmosWebApi.CosmosSquadInvitingListMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosSquadInvitingListMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosSquadInvitingListMessage">();
	}
	static class UCosmosSquadInvitingListMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosSquadInvitingListMessage>();
	}
};
static_assert(alignof(UCosmosSquadInvitingListMessage) == 0x000008, "Wrong alignment on UCosmosSquadInvitingListMessage");
static_assert(sizeof(UCosmosSquadInvitingListMessage) == 0x0000B8, "Wrong size on UCosmosSquadInvitingListMessage");

// Class CosmosWebApi.CosmosCustomizeGetCustomizeListMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosCustomizeGetCustomizeListMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosCustomizeGetCustomizeListMessage">();
	}
	static class UCosmosCustomizeGetCustomizeListMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosCustomizeGetCustomizeListMessage>();
	}
};
static_assert(alignof(UCosmosCustomizeGetCustomizeListMessage) == 0x000008, "Wrong alignment on UCosmosCustomizeGetCustomizeListMessage");
static_assert(sizeof(UCosmosCustomizeGetCustomizeListMessage) == 0x0000B8, "Wrong size on UCosmosCustomizeGetCustomizeListMessage");

// Class CosmosWebApi.CosmosCustomizeGetCustomizeMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosCustomizeGetCustomizeMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosCustomizeGetCustomizeMessage">();
	}
	static class UCosmosCustomizeGetCustomizeMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosCustomizeGetCustomizeMessage>();
	}
};
static_assert(alignof(UCosmosCustomizeGetCustomizeMessage) == 0x000008, "Wrong alignment on UCosmosCustomizeGetCustomizeMessage");
static_assert(sizeof(UCosmosCustomizeGetCustomizeMessage) == 0x0000B8, "Wrong size on UCosmosCustomizeGetCustomizeMessage");

// Class CosmosWebApi.CosmosMyadGetListMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosMyadGetListMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosMyadGetListMessage">();
	}
	static class UCosmosMyadGetListMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosMyadGetListMessage>();
	}
};
static_assert(alignof(UCosmosMyadGetListMessage) == 0x000008, "Wrong alignment on UCosmosMyadGetListMessage");
static_assert(sizeof(UCosmosMyadGetListMessage) == 0x0000B8, "Wrong size on UCosmosMyadGetListMessage");

// Class CosmosWebApi.CosmosMyadAdCreateMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosMyadAdCreateMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosMyadAdCreateMessage">();
	}
	static class UCosmosMyadAdCreateMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosMyadAdCreateMessage>();
	}
};
static_assert(alignof(UCosmosMyadAdCreateMessage) == 0x000008, "Wrong alignment on UCosmosMyadAdCreateMessage");
static_assert(sizeof(UCosmosMyadAdCreateMessage) == 0x0000B8, "Wrong size on UCosmosMyadAdCreateMessage");

// Class CosmosWebApi.CosmosMyadGetMyadMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosMyadGetMyadMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosMyadGetMyadMessage">();
	}
	static class UCosmosMyadGetMyadMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosMyadGetMyadMessage>();
	}
};
static_assert(alignof(UCosmosMyadGetMyadMessage) == 0x000008, "Wrong alignment on UCosmosMyadGetMyadMessage");
static_assert(sizeof(UCosmosMyadGetMyadMessage) == 0x0000B8, "Wrong size on UCosmosMyadGetMyadMessage");

// Class CosmosWebApi.CosmosItemGetOwnedMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosItemGetOwnedMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosItemGetOwnedMessage">();
	}
	static class UCosmosItemGetOwnedMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosItemGetOwnedMessage>();
	}
};
static_assert(alignof(UCosmosItemGetOwnedMessage) == 0x000008, "Wrong alignment on UCosmosItemGetOwnedMessage");
static_assert(sizeof(UCosmosItemGetOwnedMessage) == 0x0000B8, "Wrong size on UCosmosItemGetOwnedMessage");

// Class CosmosWebApi.CosmosItemItemPossessionMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosItemItemPossessionMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosItemItemPossessionMessage">();
	}
	static class UCosmosItemItemPossessionMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosItemItemPossessionMessage>();
	}
};
static_assert(alignof(UCosmosItemItemPossessionMessage) == 0x000008, "Wrong alignment on UCosmosItemItemPossessionMessage");
static_assert(sizeof(UCosmosItemItemPossessionMessage) == 0x0000B8, "Wrong size on UCosmosItemItemPossessionMessage");

// Class CosmosWebApi.CosmosGamecurrencyGetOwnedMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosGamecurrencyGetOwnedMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosGamecurrencyGetOwnedMessage">();
	}
	static class UCosmosGamecurrencyGetOwnedMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosGamecurrencyGetOwnedMessage>();
	}
};
static_assert(alignof(UCosmosGamecurrencyGetOwnedMessage) == 0x000008, "Wrong alignment on UCosmosGamecurrencyGetOwnedMessage");
static_assert(sizeof(UCosmosGamecurrencyGetOwnedMessage) == 0x0000B8, "Wrong size on UCosmosGamecurrencyGetOwnedMessage");

// Class CosmosWebApi.CosmosGamecurrencyGetLimitedOwnedMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosGamecurrencyGetLimitedOwnedMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosGamecurrencyGetLimitedOwnedMessage">();
	}
	static class UCosmosGamecurrencyGetLimitedOwnedMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosGamecurrencyGetLimitedOwnedMessage>();
	}
};
static_assert(alignof(UCosmosGamecurrencyGetLimitedOwnedMessage) == 0x000008, "Wrong alignment on UCosmosGamecurrencyGetLimitedOwnedMessage");
static_assert(sizeof(UCosmosGamecurrencyGetLimitedOwnedMessage) == 0x0000B8, "Wrong size on UCosmosGamecurrencyGetLimitedOwnedMessage");

// Class CosmosWebApi.CosmosCommonpurchaseGetCatalogMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosCommonpurchaseGetCatalogMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosCommonpurchaseGetCatalogMessage">();
	}
	static class UCosmosCommonpurchaseGetCatalogMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosCommonpurchaseGetCatalogMessage>();
	}
};
static_assert(alignof(UCosmosCommonpurchaseGetCatalogMessage) == 0x000008, "Wrong alignment on UCosmosCommonpurchaseGetCatalogMessage");
static_assert(sizeof(UCosmosCommonpurchaseGetCatalogMessage) == 0x0000B8, "Wrong size on UCosmosCommonpurchaseGetCatalogMessage");

// Class CosmosWebApi.CosmosCommonpurchaseStartPurchaseMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosCommonpurchaseStartPurchaseMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosCommonpurchaseStartPurchaseMessage">();
	}
	static class UCosmosCommonpurchaseStartPurchaseMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosCommonpurchaseStartPurchaseMessage>();
	}
};
static_assert(alignof(UCosmosCommonpurchaseStartPurchaseMessage) == 0x000008, "Wrong alignment on UCosmosCommonpurchaseStartPurchaseMessage");
static_assert(sizeof(UCosmosCommonpurchaseStartPurchaseMessage) == 0x0000B8, "Wrong size on UCosmosCommonpurchaseStartPurchaseMessage");

// Class CosmosWebApi.CosmosCommonpurchaseGetPurchaseStatusMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosCommonpurchaseGetPurchaseStatusMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosCommonpurchaseGetPurchaseStatusMessage">();
	}
	static class UCosmosCommonpurchaseGetPurchaseStatusMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosCommonpurchaseGetPurchaseStatusMessage>();
	}
};
static_assert(alignof(UCosmosCommonpurchaseGetPurchaseStatusMessage) == 0x000008, "Wrong alignment on UCosmosCommonpurchaseGetPurchaseStatusMessage");
static_assert(sizeof(UCosmosCommonpurchaseGetPurchaseStatusMessage) == 0x0000B8, "Wrong size on UCosmosCommonpurchaseGetPurchaseStatusMessage");

// Class CosmosWebApi.CosmosCommonpurchaseTokushoMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosCommonpurchaseTokushoMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosCommonpurchaseTokushoMessage">();
	}
	static class UCosmosCommonpurchaseTokushoMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosCommonpurchaseTokushoMessage>();
	}
};
static_assert(alignof(UCosmosCommonpurchaseTokushoMessage) == 0x000008, "Wrong alignment on UCosmosCommonpurchaseTokushoMessage");
static_assert(sizeof(UCosmosCommonpurchaseTokushoMessage) == 0x0000B8, "Wrong size on UCosmosCommonpurchaseTokushoMessage");

// Class CosmosWebApi.CosmosCommonpurchaseGetFundSettlementTextMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosCommonpurchaseGetFundSettlementTextMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosCommonpurchaseGetFundSettlementTextMessage">();
	}
	static class UCosmosCommonpurchaseGetFundSettlementTextMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosCommonpurchaseGetFundSettlementTextMessage>();
	}
};
static_assert(alignof(UCosmosCommonpurchaseGetFundSettlementTextMessage) == 0x000008, "Wrong alignment on UCosmosCommonpurchaseGetFundSettlementTextMessage");
static_assert(sizeof(UCosmosCommonpurchaseGetFundSettlementTextMessage) == 0x0000B8, "Wrong size on UCosmosCommonpurchaseGetFundSettlementTextMessage");

// Class CosmosWebApi.CosmosMissionGetListMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosMissionGetListMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosMissionGetListMessage">();
	}
	static class UCosmosMissionGetListMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosMissionGetListMessage>();
	}
};
static_assert(alignof(UCosmosMissionGetListMessage) == 0x000008, "Wrong alignment on UCosmosMissionGetListMessage");
static_assert(sizeof(UCosmosMissionGetListMessage) == 0x0000B8, "Wrong size on UCosmosMissionGetListMessage");

// Class CosmosWebApi.CosmosRankingGetRankingMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosRankingGetRankingMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosRankingGetRankingMessage">();
	}
	static class UCosmosRankingGetRankingMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosRankingGetRankingMessage>();
	}
};
static_assert(alignof(UCosmosRankingGetRankingMessage) == 0x000008, "Wrong alignment on UCosmosRankingGetRankingMessage");
static_assert(sizeof(UCosmosRankingGetRankingMessage) == 0x0000B8, "Wrong size on UCosmosRankingGetRankingMessage");

// Class CosmosWebApi.CosmosLootboxGetListMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosLootboxGetListMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosLootboxGetListMessage">();
	}
	static class UCosmosLootboxGetListMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosLootboxGetListMessage>();
	}
};
static_assert(alignof(UCosmosLootboxGetListMessage) == 0x000008, "Wrong alignment on UCosmosLootboxGetListMessage");
static_assert(sizeof(UCosmosLootboxGetListMessage) == 0x0000B8, "Wrong size on UCosmosLootboxGetListMessage");

// Class CosmosWebApi.CosmosLootboxRunMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosLootboxRunMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosLootboxRunMessage">();
	}
	static class UCosmosLootboxRunMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosLootboxRunMessage>();
	}
};
static_assert(alignof(UCosmosLootboxRunMessage) == 0x000008, "Wrong alignment on UCosmosLootboxRunMessage");
static_assert(sizeof(UCosmosLootboxRunMessage) == 0x0000B8, "Wrong size on UCosmosLootboxRunMessage");

// Class CosmosWebApi.CosmosLootboxGetMileageItemListMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosLootboxGetMileageItemListMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosLootboxGetMileageItemListMessage">();
	}
	static class UCosmosLootboxGetMileageItemListMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosLootboxGetMileageItemListMessage>();
	}
};
static_assert(alignof(UCosmosLootboxGetMileageItemListMessage) == 0x000008, "Wrong alignment on UCosmosLootboxGetMileageItemListMessage");
static_assert(sizeof(UCosmosLootboxGetMileageItemListMessage) == 0x0000B8, "Wrong size on UCosmosLootboxGetMileageItemListMessage");

// Class CosmosWebApi.CosmosLootboxMileageExchangeMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosLootboxMileageExchangeMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosLootboxMileageExchangeMessage">();
	}
	static class UCosmosLootboxMileageExchangeMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosLootboxMileageExchangeMessage>();
	}
};
static_assert(alignof(UCosmosLootboxMileageExchangeMessage) == 0x000008, "Wrong alignment on UCosmosLootboxMileageExchangeMessage");
static_assert(sizeof(UCosmosLootboxMileageExchangeMessage) == 0x0000B8, "Wrong size on UCosmosLootboxMileageExchangeMessage");

// Class CosmosWebApi.CosmosLootboxGetProbabilityMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosLootboxGetProbabilityMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosLootboxGetProbabilityMessage">();
	}
	static class UCosmosLootboxGetProbabilityMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosLootboxGetProbabilityMessage>();
	}
};
static_assert(alignof(UCosmosLootboxGetProbabilityMessage) == 0x000008, "Wrong alignment on UCosmosLootboxGetProbabilityMessage");
static_assert(sizeof(UCosmosLootboxGetProbabilityMessage) == 0x0000B8, "Wrong size on UCosmosLootboxGetProbabilityMessage");

// Class CosmosWebApi.CosmosLootboxGetHistoriesMessage
// 0x0010 (0x00B8 - 0x00A8)
class UCosmosLootboxGetHistoriesMessage final : public UWebApiConnect
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmosLootboxGetHistoriesMessage">();
	}
	static class UCosmosLootboxGetHistoriesMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmosLootboxGetHistoriesMessage>();
	}
};
static_assert(alignof(UCosmosLootboxGetHistoriesMessage) == 0x000008, "Wrong alignment on UCosmosLootboxGetHistoriesMessage");
