#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmosWebApi

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct CosmosWebApi.CosmosCustomMatchGetResultResponseParam
// 0x0018 (0x0018 - 0x0000)
struct FCosmosCustomMatchGetResultResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Results;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosCustomMatchGetResultResponseParam) == 0x000008, "Wrong alignment on FCosmosCustomMatchGetResultResponseParam");
static_assert(sizeof(FCosmosCustomMatchGetResultResponseParam) == 0x000018, "Wrong size on FCosmosCustomMatchGetResultResponseParam");
static_assert(offsetof(FCosmosCustomMatchGetResultResponseParam, Status) == 0x000000, "Member 'FCosmosCustomMatchGetResultResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCosmosCustomMatchGetResultResponseParam, Results) == 0x000008, "Member 'FCosmosCustomMatchGetResultResponseParam::Results' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosCustomMatchGetRoomInfoResponseParam
// 0x0040 (0x0040 - 0x0000)
struct FCosmosCustomMatchGetRoomInfoResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CustomRoomId;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ConnectionDomain;                                  // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ConnectionPort;                                    // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CreateTime;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosCustomMatchGetRoomInfoResponseParam) == 0x000008, "Wrong alignment on FCosmosCustomMatchGetRoomInfoResponseParam");
static_assert(sizeof(FCosmosCustomMatchGetRoomInfoResponseParam) == 0x000040, "Wrong size on FCosmosCustomMatchGetRoomInfoResponseParam");
static_assert(offsetof(FCosmosCustomMatchGetRoomInfoResponseParam, Status) == 0x000000, "Member 'FCosmosCustomMatchGetRoomInfoResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCosmosCustomMatchGetRoomInfoResponseParam, CustomRoomId) == 0x000008, "Member 'FCosmosCustomMatchGetRoomInfoResponseParam::CustomRoomId' has a wrong offset!");
static_assert(offsetof(FCosmosCustomMatchGetRoomInfoResponseParam, ConnectionDomain) == 0x000018, "Member 'FCosmosCustomMatchGetRoomInfoResponseParam::ConnectionDomain' has a wrong offset!");
static_assert(offsetof(FCosmosCustomMatchGetRoomInfoResponseParam, ConnectionPort) == 0x000028, "Member 'FCosmosCustomMatchGetRoomInfoResponseParam::ConnectionPort' has a wrong offset!");
static_assert(offsetof(FCosmosCustomMatchGetRoomInfoResponseParam, CreateTime) == 0x000030, "Member 'FCosmosCustomMatchGetRoomInfoResponseParam::CreateTime' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosCustomMatchCreateRoomIdResponseParam
// 0x0038 (0x0038 - 0x0000)
struct FCosmosCustomMatchCreateRoomIdResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CustomRoomKey;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CustomRoomId;                                      // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CreateTime;                                        // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosCustomMatchCreateRoomIdResponseParam) == 0x000008, "Wrong alignment on FCosmosCustomMatchCreateRoomIdResponseParam");
static_assert(sizeof(FCosmosCustomMatchCreateRoomIdResponseParam) == 0x000038, "Wrong size on FCosmosCustomMatchCreateRoomIdResponseParam");
static_assert(offsetof(FCosmosCustomMatchCreateRoomIdResponseParam, Status) == 0x000000, "Member 'FCosmosCustomMatchCreateRoomIdResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCosmosCustomMatchCreateRoomIdResponseParam, CustomRoomKey) == 0x000008, "Member 'FCosmosCustomMatchCreateRoomIdResponseParam::CustomRoomKey' has a wrong offset!");
static_assert(offsetof(FCosmosCustomMatchCreateRoomIdResponseParam, CustomRoomId) == 0x000018, "Member 'FCosmosCustomMatchCreateRoomIdResponseParam::CustomRoomId' has a wrong offset!");
static_assert(offsetof(FCosmosCustomMatchCreateRoomIdResponseParam, CreateTime) == 0x000028, "Member 'FCosmosCustomMatchCreateRoomIdResponseParam::CreateTime' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosRankAwardData
// 0x000C (0x000C - 0x0000)
struct FCosmosRankAwardData final
{
public:
	int32                                         AwardItemCategoryCode;                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AwardItemCode;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AwardItemNum;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosRankAwardData) == 0x000004, "Wrong alignment on FCosmosRankAwardData");
static_assert(sizeof(FCosmosRankAwardData) == 0x00000C, "Wrong size on FCosmosRankAwardData");
static_assert(offsetof(FCosmosRankAwardData, AwardItemCategoryCode) == 0x000000, "Member 'FCosmosRankAwardData::AwardItemCategoryCode' has a wrong offset!");
static_assert(offsetof(FCosmosRankAwardData, AwardItemCode) == 0x000004, "Member 'FCosmosRankAwardData::AwardItemCode' has a wrong offset!");
static_assert(offsetof(FCosmosRankAwardData, AwardItemNum) == 0x000008, "Member 'FCosmosRankAwardData::AwardItemNum' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosSpecialpassPurchaseExperiencePointResponseParam
// 0x0018 (0x0018 - 0x0000)
struct FCosmosSpecialpassPurchaseExperiencePointResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCosmosRankAwardData>           RankAwards;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosSpecialpassPurchaseExperiencePointResponseParam) == 0x000008, "Wrong alignment on FCosmosSpecialpassPurchaseExperiencePointResponseParam");
static_assert(sizeof(FCosmosSpecialpassPurchaseExperiencePointResponseParam) == 0x000018, "Wrong size on FCosmosSpecialpassPurchaseExperiencePointResponseParam");
static_assert(offsetof(FCosmosSpecialpassPurchaseExperiencePointResponseParam, Status) == 0x000000, "Member 'FCosmosSpecialpassPurchaseExperiencePointResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCosmosSpecialpassPurchaseExperiencePointResponseParam, RankAwards) == 0x000008, "Member 'FCosmosSpecialpassPurchaseExperiencePointResponseParam::RankAwards' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosAwardData
// 0x0014 (0x0014 - 0x0000)
struct FCosmosAwardData final
{
public:
	int32                                         RankBands;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AwardItemCategoryCode;                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AwardItemCode;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AwardItemNum;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReceivedFlag;                                      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosAwardData) == 0x000004, "Wrong alignment on FCosmosAwardData");
static_assert(sizeof(FCosmosAwardData) == 0x000014, "Wrong size on FCosmosAwardData");
static_assert(offsetof(FCosmosAwardData, RankBands) == 0x000000, "Member 'FCosmosAwardData::RankBands' has a wrong offset!");
static_assert(offsetof(FCosmosAwardData, AwardItemCategoryCode) == 0x000004, "Member 'FCosmosAwardData::AwardItemCategoryCode' has a wrong offset!");
static_assert(offsetof(FCosmosAwardData, AwardItemCode) == 0x000008, "Member 'FCosmosAwardData::AwardItemCode' has a wrong offset!");
static_assert(offsetof(FCosmosAwardData, AwardItemNum) == 0x00000C, "Member 'FCosmosAwardData::AwardItemNum' has a wrong offset!");
static_assert(offsetof(FCosmosAwardData, ReceivedFlag) == 0x000010, "Member 'FCosmosAwardData::ReceivedFlag' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosSpecialpassGetMasterListResponseParam
// 0x0020 (0x0020 - 0x0000)
struct FCosmosSpecialpassGetMasterListResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Rank;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Exp;                                               // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxExp;                                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCosmosAwardData>               RankAwards;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosSpecialpassGetMasterListResponseParam) == 0x000008, "Wrong alignment on FCosmosSpecialpassGetMasterListResponseParam");
static_assert(sizeof(FCosmosSpecialpassGetMasterListResponseParam) == 0x000020, "Wrong size on FCosmosSpecialpassGetMasterListResponseParam");
static_assert(offsetof(FCosmosSpecialpassGetMasterListResponseParam, Status) == 0x000000, "Member 'FCosmosSpecialpassGetMasterListResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCosmosSpecialpassGetMasterListResponseParam, Rank) == 0x000004, "Member 'FCosmosSpecialpassGetMasterListResponseParam::Rank' has a wrong offset!");
static_assert(offsetof(FCosmosSpecialpassGetMasterListResponseParam, Exp) == 0x000008, "Member 'FCosmosSpecialpassGetMasterListResponseParam::Exp' has a wrong offset!");
static_assert(offsetof(FCosmosSpecialpassGetMasterListResponseParam, MaxExp) == 0x00000C, "Member 'FCosmosSpecialpassGetMasterListResponseParam::MaxExp' has a wrong offset!");
static_assert(offsetof(FCosmosSpecialpassGetMasterListResponseParam, RankAwards) == 0x000010, "Member 'FCosmosSpecialpassGetMasterListResponseParam::RankAwards' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosBnidClientEntryResponseParam
// 0x0018 (0x0018 - 0x0000)
struct FCosmosBnidClientEntryResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 URL;                                               // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosBnidClientEntryResponseParam) == 0x000008, "Wrong alignment on FCosmosBnidClientEntryResponseParam");
static_assert(sizeof(FCosmosBnidClientEntryResponseParam) == 0x000018, "Wrong size on FCosmosBnidClientEntryResponseParam");
static_assert(offsetof(FCosmosBnidClientEntryResponseParam, Status) == 0x000000, "Member 'FCosmosBnidClientEntryResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCosmosBnidClientEntryResponseParam, URL) == 0x000008, "Member 'FCosmosBnidClientEntryResponseParam::URL' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosBnidClientCheckStatusResponseParam
// 0x0018 (0x0018 - 0x0000)
struct FCosmosBnidClientCheckStatusResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosBnidClientCheckStatusResponseParam) == 0x000008, "Wrong alignment on FCosmosBnidClientCheckStatusResponseParam");
static_assert(sizeof(FCosmosBnidClientCheckStatusResponseParam) == 0x000018, "Wrong size on FCosmosBnidClientCheckStatusResponseParam");
static_assert(offsetof(FCosmosBnidClientCheckStatusResponseParam, Status) == 0x000000, "Member 'FCosmosBnidClientCheckStatusResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCosmosBnidClientCheckStatusResponseParam, Text) == 0x000008, "Member 'FCosmosBnidClientCheckStatusResponseParam::Text' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosEventInfo
// 0x0010 (0x0010 - 0x0000)
struct FCosmosEventInfo final
{
public:
	int32                                         EventCode;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EventRank;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalEventPoint;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NowEventPoint;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosEventInfo) == 0x000004, "Wrong alignment on FCosmosEventInfo");
static_assert(sizeof(FCosmosEventInfo) == 0x000010, "Wrong size on FCosmosEventInfo");
static_assert(offsetof(FCosmosEventInfo, EventCode) == 0x000000, "Member 'FCosmosEventInfo::EventCode' has a wrong offset!");
static_assert(offsetof(FCosmosEventInfo, EventRank) == 0x000004, "Member 'FCosmosEventInfo::EventRank' has a wrong offset!");
static_assert(offsetof(FCosmosEventInfo, TotalEventPoint) == 0x000008, "Member 'FCosmosEventInfo::TotalEventPoint' has a wrong offset!");
static_assert(offsetof(FCosmosEventInfo, NowEventPoint) == 0x00000C, "Member 'FCosmosEventInfo::NowEventPoint' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosEventGetEventInfoResponseParam
// 0x0018 (0x0018 - 0x0000)
struct FCosmosEventGetEventInfoResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCosmosEventInfo>               EventInfos;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosEventGetEventInfoResponseParam) == 0x000008, "Wrong alignment on FCosmosEventGetEventInfoResponseParam");
static_assert(sizeof(FCosmosEventGetEventInfoResponseParam) == 0x000018, "Wrong size on FCosmosEventGetEventInfoResponseParam");
static_assert(offsetof(FCosmosEventGetEventInfoResponseParam, Status) == 0x000000, "Member 'FCosmosEventGetEventInfoResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCosmosEventGetEventInfoResponseParam, EventInfos) == 0x000008, "Member 'FCosmosEventGetEventInfoResponseParam::EventInfos' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosLogData
// 0x0030 (0x0030 - 0x0000)
struct FCosmosLogData final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OnlineId;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Time;                                              // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosLogData) == 0x000008, "Wrong alignment on FCosmosLogData");
static_assert(sizeof(FCosmosLogData) == 0x000030, "Wrong size on FCosmosLogData");
static_assert(offsetof(FCosmosLogData, Text) == 0x000000, "Member 'FCosmosLogData::Text' has a wrong offset!");
static_assert(offsetof(FCosmosLogData, OnlineId) == 0x000010, "Member 'FCosmosLogData::OnlineId' has a wrong offset!");
static_assert(offsetof(FCosmosLogData, Time) == 0x000020, "Member 'FCosmosLogData::Time' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosChatLogResponseParam
// 0x0018 (0x0018 - 0x0000)
struct FCosmosChatLogResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCosmosLogData>                 LogList;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosChatLogResponseParam) == 0x000008, "Wrong alignment on FCosmosChatLogResponseParam");
static_assert(sizeof(FCosmosChatLogResponseParam) == 0x000018, "Wrong size on FCosmosChatLogResponseParam");
static_assert(offsetof(FCosmosChatLogResponseParam, Status) == 0x000000, "Member 'FCosmosChatLogResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCosmosChatLogResponseParam, LogList) == 0x000008, "Member 'FCosmosChatLogResponseParam::LogList' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosChatReceiveResponseParam
// 0x0008 (0x0008 - 0x0000)
struct FCosmosChatReceiveResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewChat;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosChatReceiveResponseParam) == 0x000004, "Wrong alignment on FCosmosChatReceiveResponseParam");
static_assert(sizeof(FCosmosChatReceiveResponseParam) == 0x000008, "Wrong size on FCosmosChatReceiveResponseParam");
static_assert(offsetof(FCosmosChatReceiveResponseParam, Status) == 0x000000, "Member 'FCosmosChatReceiveResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCosmosChatReceiveResponseParam, NewChat) == 0x000004, "Member 'FCosmosChatReceiveResponseParam::NewChat' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosRecommendNoticeGetRecommendNoticeResponseParam
// 0x0058 (0x0058 - 0x0000)
struct FCosmosRecommendNoticeGetRecommendNoticeResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RecommendNoticeId;                                 // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetUserId;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetPlatformUserId;                              // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetGuildId;                                     // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetGuildName;                                   // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetUserName;                                    // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosRecommendNoticeGetRecommendNoticeResponseParam) == 0x000008, "Wrong alignment on FCosmosRecommendNoticeGetRecommendNoticeResponseParam");
static_assert(sizeof(FCosmosRecommendNoticeGetRecommendNoticeResponseParam) == 0x000058, "Wrong size on FCosmosRecommendNoticeGetRecommendNoticeResponseParam");
static_assert(offsetof(FCosmosRecommendNoticeGetRecommendNoticeResponseParam, Status) == 0x000000, "Member 'FCosmosRecommendNoticeGetRecommendNoticeResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCosmosRecommendNoticeGetRecommendNoticeResponseParam, RecommendNoticeId) == 0x000004, "Member 'FCosmosRecommendNoticeGetRecommendNoticeResponseParam::RecommendNoticeId' has a wrong offset!");
static_assert(offsetof(FCosmosRecommendNoticeGetRecommendNoticeResponseParam, TargetUserId) == 0x000008, "Member 'FCosmosRecommendNoticeGetRecommendNoticeResponseParam::TargetUserId' has a wrong offset!");
static_assert(offsetof(FCosmosRecommendNoticeGetRecommendNoticeResponseParam, TargetPlatformUserId) == 0x000018, "Member 'FCosmosRecommendNoticeGetRecommendNoticeResponseParam::TargetPlatformUserId' has a wrong offset!");
static_assert(offsetof(FCosmosRecommendNoticeGetRecommendNoticeResponseParam, TargetGuildId) == 0x000028, "Member 'FCosmosRecommendNoticeGetRecommendNoticeResponseParam::TargetGuildId' has a wrong offset!");
static_assert(offsetof(FCosmosRecommendNoticeGetRecommendNoticeResponseParam, TargetGuildName) == 0x000038, "Member 'FCosmosRecommendNoticeGetRecommendNoticeResponseParam::TargetGuildName' has a wrong offset!");
static_assert(offsetof(FCosmosRecommendNoticeGetRecommendNoticeResponseParam, TargetUserName) == 0x000048, "Member 'FCosmosRecommendNoticeGetRecommendNoticeResponseParam::TargetUserName' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosGalleryData
// 0x0030 (0x0030 - 0x0000)
struct FCosmosGalleryData final
{
public:
	int32                                         GalleryCode;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GalleryTicket1ReleaseNum;                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GalleryTicket2ReleaseNum;                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GalleryTicket3ReleaseNum;                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GalleryTicket1UsedNum;                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GalleryTicket2UsedNum;                             // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GalleryTicket3UsedNum;                             // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Panel;                                             // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosGalleryData) == 0x000008, "Wrong alignment on FCosmosGalleryData");
static_assert(sizeof(FCosmosGalleryData) == 0x000030, "Wrong size on FCosmosGalleryData");
static_assert(offsetof(FCosmosGalleryData, GalleryCode) == 0x000000, "Member 'FCosmosGalleryData::GalleryCode' has a wrong offset!");
static_assert(offsetof(FCosmosGalleryData, GalleryTicket1ReleaseNum) == 0x000004, "Member 'FCosmosGalleryData::GalleryTicket1ReleaseNum' has a wrong offset!");
static_assert(offsetof(FCosmosGalleryData, GalleryTicket2ReleaseNum) == 0x000008, "Member 'FCosmosGalleryData::GalleryTicket2ReleaseNum' has a wrong offset!");
static_assert(offsetof(FCosmosGalleryData, GalleryTicket3ReleaseNum) == 0x00000C, "Member 'FCosmosGalleryData::GalleryTicket3ReleaseNum' has a wrong offset!");
static_assert(offsetof(FCosmosGalleryData, GalleryTicket1UsedNum) == 0x000010, "Member 'FCosmosGalleryData::GalleryTicket1UsedNum' has a wrong offset!");
static_assert(offsetof(FCosmosGalleryData, GalleryTicket2UsedNum) == 0x000014, "Member 'FCosmosGalleryData::GalleryTicket2UsedNum' has a wrong offset!");
static_assert(offsetof(FCosmosGalleryData, GalleryTicket3UsedNum) == 0x000018, "Member 'FCosmosGalleryData::GalleryTicket3UsedNum' has a wrong offset!");
static_assert(offsetof(FCosmosGalleryData, Panel) == 0x000020, "Member 'FCosmosGalleryData::Panel' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosGalleryGetGalleryListResponseParam
// 0x0018 (0x0018 - 0x0000)
struct FCosmosGalleryGetGalleryListResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCosmosGalleryData>             GalleryList;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosGalleryGetGalleryListResponseParam) == 0x000008, "Wrong alignment on FCosmosGalleryGetGalleryListResponseParam");
static_assert(sizeof(FCosmosGalleryGetGalleryListResponseParam) == 0x000018, "Wrong size on FCosmosGalleryGetGalleryListResponseParam");
static_assert(offsetof(FCosmosGalleryGetGalleryListResponseParam, Status) == 0x000000, "Member 'FCosmosGalleryGetGalleryListResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCosmosGalleryGetGalleryListResponseParam, GalleryList) == 0x000008, "Member 'FCosmosGalleryGetGalleryListResponseParam::GalleryList' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosSysF2pGetPasswordResponseParam
// 0x0018 (0x0018 - 0x0000)
struct FCosmosSysF2pGetPasswordResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Password;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosSysF2pGetPasswordResponseParam) == 0x000008, "Wrong alignment on FCosmosSysF2pGetPasswordResponseParam");
static_assert(sizeof(FCosmosSysF2pGetPasswordResponseParam) == 0x000018, "Wrong size on FCosmosSysF2pGetPasswordResponseParam");
static_assert(offsetof(FCosmosSysF2pGetPasswordResponseParam, Status) == 0x000000, "Member 'FCosmosSysF2pGetPasswordResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCosmosSysF2pGetPasswordResponseParam, Password) == 0x000008, "Member 'FCosmosSysF2pGetPasswordResponseParam::Password' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosSquadMemberData
// 0x0038 (0x0038 - 0x0000)
struct FCosmosSquadMemberData final
{
public:
	class FString                                 UserId;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserData;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IshostUser;                                        // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IsCpu;                                             // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlatformUserId;                                    // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosSquadMemberData) == 0x000008, "Wrong alignment on FCosmosSquadMemberData");
static_assert(sizeof(FCosmosSquadMemberData) == 0x000038, "Wrong size on FCosmosSquadMemberData");
static_assert(offsetof(FCosmosSquadMemberData, UserId) == 0x000000, "Member 'FCosmosSquadMemberData::UserId' has a wrong offset!");
static_assert(offsetof(FCosmosSquadMemberData, UserData) == 0x000010, "Member 'FCosmosSquadMemberData::UserData' has a wrong offset!");
static_assert(offsetof(FCosmosSquadMemberData, IshostUser) == 0x000020, "Member 'FCosmosSquadMemberData::IshostUser' has a wrong offset!");
static_assert(offsetof(FCosmosSquadMemberData, IsCpu) == 0x000024, "Member 'FCosmosSquadMemberData::IsCpu' has a wrong offset!");
static_assert(offsetof(FCosmosSquadMemberData, PlatformUserId) == 0x000028, "Member 'FCosmosSquadMemberData::PlatformUserId' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosSysF2pGetJoinServerResponseParam
// 0x0040 (0x0040 - 0x0000)
struct FCosmosSysF2pGetJoinServerResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ConnectionDomain;                                  // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ConnectionPort;                                    // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SquadId;                                           // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCosmosSquadMemberData>         MemberList;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosSysF2pGetJoinServerResponseParam) == 0x000008, "Wrong alignment on FCosmosSysF2pGetJoinServerResponseParam");
static_assert(sizeof(FCosmosSysF2pGetJoinServerResponseParam) == 0x000040, "Wrong size on FCosmosSysF2pGetJoinServerResponseParam");
static_assert(offsetof(FCosmosSysF2pGetJoinServerResponseParam, Status) == 0x000000, "Member 'FCosmosSysF2pGetJoinServerResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCosmosSysF2pGetJoinServerResponseParam, ConnectionDomain) == 0x000008, "Member 'FCosmosSysF2pGetJoinServerResponseParam::ConnectionDomain' has a wrong offset!");
static_assert(offsetof(FCosmosSysF2pGetJoinServerResponseParam, ConnectionPort) == 0x000018, "Member 'FCosmosSysF2pGetJoinServerResponseParam::ConnectionPort' has a wrong offset!");
static_assert(offsetof(FCosmosSysF2pGetJoinServerResponseParam, SquadId) == 0x000020, "Member 'FCosmosSysF2pGetJoinServerResponseParam::SquadId' has a wrong offset!");
static_assert(offsetof(FCosmosSysF2pGetJoinServerResponseParam, MemberList) == 0x000030, "Member 'FCosmosSysF2pGetJoinServerResponseParam::MemberList' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosSysF2pGetServerInfoResponseParam
// 0x0048 (0x0048 - 0x0000)
struct FCosmosSysF2pGetServerInfoResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ServerTime;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerName;                                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerVersion;                                     // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MatchingServerVersion;                             // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosSysF2pGetServerInfoResponseParam) == 0x000008, "Wrong alignment on FCosmosSysF2pGetServerInfoResponseParam");
static_assert(sizeof(FCosmosSysF2pGetServerInfoResponseParam) == 0x000048, "Wrong size on FCosmosSysF2pGetServerInfoResponseParam");
static_assert(offsetof(FCosmosSysF2pGetServerInfoResponseParam, Status) == 0x000000, "Member 'FCosmosSysF2pGetServerInfoResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCosmosSysF2pGetServerInfoResponseParam, ServerTime) == 0x000008, "Member 'FCosmosSysF2pGetServerInfoResponseParam::ServerTime' has a wrong offset!");
static_assert(offsetof(FCosmosSysF2pGetServerInfoResponseParam, ServerName) == 0x000018, "Member 'FCosmosSysF2pGetServerInfoResponseParam::ServerName' has a wrong offset!");
static_assert(offsetof(FCosmosSysF2pGetServerInfoResponseParam, ServerVersion) == 0x000028, "Member 'FCosmosSysF2pGetServerInfoResponseParam::ServerVersion' has a wrong offset!");
static_assert(offsetof(FCosmosSysF2pGetServerInfoResponseParam, MatchingServerVersion) == 0x000038, "Member 'FCosmosSysF2pGetServerInfoResponseParam::MatchingServerVersion' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosSysF2pGetMasterUrlResponseParam
// 0x0048 (0x0048 - 0x0000)
struct FCosmosSysF2pGetMasterUrlResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 WebUrl;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Passphrase;                                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Checksum;                                          // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MasterDataVersion;                                 // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosSysF2pGetMasterUrlResponseParam) == 0x000008, "Wrong alignment on FCosmosSysF2pGetMasterUrlResponseParam");
static_assert(sizeof(FCosmosSysF2pGetMasterUrlResponseParam) == 0x000048, "Wrong size on FCosmosSysF2pGetMasterUrlResponseParam");
static_assert(offsetof(FCosmosSysF2pGetMasterUrlResponseParam, Status) == 0x000000, "Member 'FCosmosSysF2pGetMasterUrlResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCosmosSysF2pGetMasterUrlResponseParam, WebUrl) == 0x000008, "Member 'FCosmosSysF2pGetMasterUrlResponseParam::WebUrl' has a wrong offset!");
static_assert(offsetof(FCosmosSysF2pGetMasterUrlResponseParam, Passphrase) == 0x000018, "Member 'FCosmosSysF2pGetMasterUrlResponseParam::Passphrase' has a wrong offset!");
static_assert(offsetof(FCosmosSysF2pGetMasterUrlResponseParam, Checksum) == 0x000028, "Member 'FCosmosSysF2pGetMasterUrlResponseParam::Checksum' has a wrong offset!");
static_assert(offsetof(FCosmosSysF2pGetMasterUrlResponseParam, MasterDataVersion) == 0x000038, "Member 'FCosmosSysF2pGetMasterUrlResponseParam::MasterDataVersion' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosSysF2pGetVersionResponseParam
// 0x0028 (0x0028 - 0x0000)
struct FCosmosSysF2pGetVersionResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ServerName;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerVersion;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosSysF2pGetVersionResponseParam) == 0x000008, "Wrong alignment on FCosmosSysF2pGetVersionResponseParam");
static_assert(sizeof(FCosmosSysF2pGetVersionResponseParam) == 0x000028, "Wrong size on FCosmosSysF2pGetVersionResponseParam");
static_assert(offsetof(FCosmosSysF2pGetVersionResponseParam, Status) == 0x000000, "Member 'FCosmosSysF2pGetVersionResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCosmosSysF2pGetVersionResponseParam, ServerName) == 0x000008, "Member 'FCosmosSysF2pGetVersionResponseParam::ServerName' has a wrong offset!");
static_assert(offsetof(FCosmosSysF2pGetVersionResponseParam, ServerVersion) == 0x000018, "Member 'FCosmosSysF2pGetVersionResponseParam::ServerVersion' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosServerData
// 0x0040 (0x0040 - 0x0000)
struct FCosmosServerData final
{
public:
	int32                                         RegionCd;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ConnectionDomain;                                  // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ConnectionPort;                                    // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DedicateIp;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RegionName;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosServerData) == 0x000008, "Wrong alignment on FCosmosServerData");
static_assert(sizeof(FCosmosServerData) == 0x000040, "Wrong size on FCosmosServerData");
static_assert(offsetof(FCosmosServerData, RegionCd) == 0x000000, "Member 'FCosmosServerData::RegionCd' has a wrong offset!");
static_assert(offsetof(FCosmosServerData, ConnectionDomain) == 0x000008, "Member 'FCosmosServerData::ConnectionDomain' has a wrong offset!");
static_assert(offsetof(FCosmosServerData, ConnectionPort) == 0x000018, "Member 'FCosmosServerData::ConnectionPort' has a wrong offset!");
static_assert(offsetof(FCosmosServerData, DedicateIp) == 0x000020, "Member 'FCosmosServerData::DedicateIp' has a wrong offset!");
static_assert(offsetof(FCosmosServerData, RegionName) == 0x000030, "Member 'FCosmosServerData::RegionName' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosSysF2pGetServerListResponseParam
// 0x0018 (0x0018 - 0x0000)
struct FCosmosSysF2pGetServerListResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCosmosServerData>              ServerList;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosSysF2pGetServerListResponseParam) == 0x000008, "Wrong alignment on FCosmosSysF2pGetServerListResponseParam");
static_assert(sizeof(FCosmosSysF2pGetServerListResponseParam) == 0x000018, "Wrong size on FCosmosSysF2pGetServerListResponseParam");
static_assert(offsetof(FCosmosSysF2pGetServerListResponseParam, Status) == 0x000000, "Member 'FCosmosSysF2pGetServerListResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCosmosSysF2pGetServerListResponseParam, ServerList) == 0x000008, "Member 'FCosmosSysF2pGetServerListResponseParam::ServerList' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosSysF2pGetServerTimeResponseParam
// 0x0018 (0x0018 - 0x0000)
struct FCosmosSysF2pGetServerTimeResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ServerTime;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosSysF2pGetServerTimeResponseParam) == 0x000008, "Wrong alignment on FCosmosSysF2pGetServerTimeResponseParam");
static_assert(sizeof(FCosmosSysF2pGetServerTimeResponseParam) == 0x000018, "Wrong size on FCosmosSysF2pGetServerTimeResponseParam");
static_assert(offsetof(FCosmosSysF2pGetServerTimeResponseParam, Status) == 0x000000, "Member 'FCosmosSysF2pGetServerTimeResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCosmosSysF2pGetServerTimeResponseParam, ServerTime) == 0x000008, "Member 'FCosmosSysF2pGetServerTimeResponseParam::ServerTime' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosSettingGetSettingInfoResponseParam
// 0x0048 (0x0048 - 0x0000)
struct FCosmosSettingGetSettingInfoResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RecommendFlg;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Language;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Server;                                            // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         buttonHintFlg;                                     // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MiniMapSpinFlg;                                    // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DamageValueFlg;                                    // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AttackDirectionFlg;                                // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         battleRecordFlg;                                   // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AuraDisplayTarget;                                 // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AuraDisplayArea;                                   // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCosmosSettingGetSettingInfoResponseParam) == 0x000008, "Wrong alignment on FCosmosSettingGetSettingInfoResponseParam");
static_assert(sizeof(FCosmosSettingGetSettingInfoResponseParam) == 0x000048, "Wrong size on FCosmosSettingGetSettingInfoResponseParam");
static_assert(offsetof(FCosmosSettingGetSettingInfoResponseParam, Status) == 0x000000, "Member 'FCosmosSettingGetSettingInfoResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCosmosSettingGetSettingInfoResponseParam, RecommendFlg) == 0x000004, "Member 'FCosmosSettingGetSettingInfoResponseParam::RecommendFlg' has a wrong offset!");
static_assert(offsetof(FCosmosSettingGetSettingInfoResponseParam, Language) == 0x000008, "Member 'FCosmosSettingGetSettingInfoResponseParam::Language' has a wrong offset!");
static_assert(offsetof(FCosmosSettingGetSettingInfoResponseParam, Server) == 0x000018, "Member 'FCosmosSettingGetSettingInfoResponseParam::Server' has a wrong offset!");
static_assert(offsetof(FCosmosSettingGetSettingInfoResponseParam, buttonHintFlg) == 0x000028, "Member 'FCosmosSettingGetSettingInfoResponseParam::buttonHintFlg' has a wrong offset!");
static_assert(offsetof(FCosmosSettingGetSettingInfoResponseParam, MiniMapSpinFlg) == 0x00002C, "Member 'FCosmosSettingGetSettingInfoResponseParam::MiniMapSpinFlg' has a wrong offset!");
static_assert(offsetof(FCosmosSettingGetSettingInfoResponseParam, DamageValueFlg) == 0x000030, "Member 'FCosmosSettingGetSettingInfoResponseParam::DamageValueFlg' has a wrong offset!");
static_assert(offsetof(FCosmosSettingGetSettingInfoResponseParam, AttackDirectionFlg) == 0x000034, "Member 'FCosmosSettingGetSettingInfoResponseParam::AttackDirectionFlg' has a wrong offset!");
static_assert(offsetof(FCosmosSettingGetSettingInfoResponseParam, battleRecordFlg) == 0x000038, "Member 'FCosmosSettingGetSettingInfoResponseParam::battleRecordFlg' has a wrong offset!");
static_assert(offsetof(FCosmosSettingGetSettingInfoResponseParam, AuraDisplayTarget) == 0x00003C, "Member 'FCosmosSettingGetSettingInfoResponseParam::AuraDisplayTarget' has a wrong offset!");
static_assert(offsetof(FCosmosSettingGetSettingInfoResponseParam, AuraDisplayArea) == 0x000040, "Member 'FCosmosSettingGetSettingInfoResponseParam::AuraDisplayArea' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosDedAvatarData
// 0x0020 (0x0020 - 0x0000)
struct FCosmosDedAvatarData final
{
public:
	class FString                                 UserId;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AvatarDataJson;                                    // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosDedAvatarData) == 0x000008, "Wrong alignment on FCosmosDedAvatarData");
static_assert(sizeof(FCosmosDedAvatarData) == 0x000020, "Wrong size on FCosmosDedAvatarData");
static_assert(offsetof(FCosmosDedAvatarData, UserId) == 0x000000, "Member 'FCosmosDedAvatarData::UserId' has a wrong offset!");
static_assert(offsetof(FCosmosDedAvatarData, AvatarDataJson) == 0x000010, "Member 'FCosmosDedAvatarData::AvatarDataJson' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosAvatarGetDedAvatarListResponseParam
// 0x0018 (0x0018 - 0x0000)
struct FCosmosAvatarGetDedAvatarListResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCosmosDedAvatarData>           Avatars;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosAvatarGetDedAvatarListResponseParam) == 0x000008, "Wrong alignment on FCosmosAvatarGetDedAvatarListResponseParam");
static_assert(sizeof(FCosmosAvatarGetDedAvatarListResponseParam) == 0x000018, "Wrong size on FCosmosAvatarGetDedAvatarListResponseParam");
static_assert(offsetof(FCosmosAvatarGetDedAvatarListResponseParam, Status) == 0x000000, "Member 'FCosmosAvatarGetDedAvatarListResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCosmosAvatarGetDedAvatarListResponseParam, Avatars) == 0x000008, "Member 'FCosmosAvatarGetDedAvatarListResponseParam::Avatars' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosAvatarData
// 0x0018 (0x0018 - 0x0000)
struct FCosmosAvatarData final
{
public:
	int32                                         AvatarCharacterCode;                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AvatarDataJson;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosAvatarData) == 0x000008, "Wrong alignment on FCosmosAvatarData");
static_assert(sizeof(FCosmosAvatarData) == 0x000018, "Wrong size on FCosmosAvatarData");
static_assert(offsetof(FCosmosAvatarData, AvatarCharacterCode) == 0x000000, "Member 'FCosmosAvatarData::AvatarCharacterCode' has a wrong offset!");
static_assert(offsetof(FCosmosAvatarData, AvatarDataJson) == 0x000008, "Member 'FCosmosAvatarData::AvatarDataJson' has a wrong offset!");

// ScriptStruct CosmosWebApi.CosmosAvatarGetAvatarListResponseParam
// 0x0018 (0x0018 - 0x0000)
struct FCosmosAvatarGetAvatarListResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCosmosAvatarData>              Avatars;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmosAvatarGetAvatarListResponseParam) == 0x000008, "Wrong alignment on FCosmosAvatarGetAvatarListResponseParam");
static_assert(sizeof(FCosmosAvatarGetAvatarListResponseParam) == 0x000018, "Wrong size on FCosmosAvatarGetAvatarListResponseParam");
