#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DebugMenuVoiceChatModule

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "VoiceChatModule_structs.hpp"


namespace SDK
{

// Class DebugMenuVoiceChatModule.DebugMenuVoiceChat
// 0x01B0 (0x01E0 - 0x0030)
class UDebugMenuVoiceChat final : public ULocalPlayerSubsystem
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UUserWidget>                _debugMenuClass;                                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUserWidget*                            _menuWidget;                                       // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x20];                                      // 0x0060(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         _outputDeviceNames;                                // 0x0080(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class FString>                         _inputDeviceNames;                                 // 0x0090(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<class FString, bool>                     _members;                                          // 0x00A0(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class FString, bool>                     _talking;                                          // 0x00F0(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class FString, bool>                     _muted;                                            // 0x0140(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class FString, float>                    _volume;                                           // 0x0190(0x0050)(NativeAccessSpecifierPrivate)

public:
	void Close();
	void Connect();
	TArray<class FString> GetChannelMemberNames();
	class FString GetInputDeviceIdByIndex(int32 Index_0);
	TArray<class FString> GetInputDeviceNames();
	TArray<class FString> GetMemberVolumes();
	TArray<class FString> GetMuteMemberNames();
	class FString GetOutputDeviceIdByIndex(int32 Index_0);
	TArray<class FString> GetOutputDeviceNames();
	class FString GetPlayerName();
	class FString GetStatusText();
	TArray<class FString> GetTalkingMemberNames();
	void OnVoiceChatChangePlayerStatus(const class FString& PlayerName, EVoiceChatPlayerStatus Status, float Value);
	void OnVoiceChatChangeStatus(EVoiceChatStatus Status);
	void OnVoiceChatError(EVoiceChatError Err, const class FString& Msg);
	void Open();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DebugMenuVoiceChat">();
	}
	static class UDebugMenuVoiceChat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDebugMenuVoiceChat>();
	}
};
static_assert(alignof(UDebugMenuVoiceChat) == 0x000008, "Wrong alignment on UDebugMenuVoiceChat");
static_assert(sizeof(UDebugMenuVoiceChat) == 0x0001E0, "Wrong size on UDebugMenuVoiceChat");
static_assert(offsetof(UDebugMenuVoiceChat, _debugMenuClass) == 0x000050, "Member 'UDebugMenuVoiceChat::_debugMenuClass' has a wrong offset!");
static_assert(offsetof(UDebugMenuVoiceChat, _menuWidget) == 0x000058, "Member 'UDebugMenuVoiceChat::_menuWidget' has a wrong offset!");
static_assert(offsetof(UDebugMenuVoiceChat, _outputDeviceNames) == 0x000080, "Member 'UDebugMenuVoiceChat::_outputDeviceNames' has a wrong offset!");
static_assert(offsetof(UDebugMenuVoiceChat, _inputDeviceNames) == 0x000090, "Member 'UDebugMenuVoiceChat::_inputDeviceNames' has a wrong offset!");
static_assert(offsetof(UDebugMenuVoiceChat, _members) == 0x0000A0, "Member 'UDebugMenuVoiceChat::_members' has a wrong offset!");
static_assert(offsetof(UDebugMenuVoiceChat, _talking) == 0x0000F0, "Member 'UDebugMenuVoiceChat::_talking' has a wrong offset!");
static_assert(offsetof(UDebugMenuVoiceChat, _muted) == 0x000140, "Member 'UDebugMenuVoiceChat::_muted' has a wrong offset!");
static_assert(offsetof(UDebugMenuVoiceChat, _volume) == 0x000190, "Member 'UDebugMenuVoiceChat::_volume' has a wrong offset!");

}

