#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DebugMenuMasterDataModule

#include "Basic.hpp"

#include "MasterDataModule_structs.hpp"


namespace SDK::Params
{

// Function DebugMenuMasterDataModule.DebugMenuMasterData.GetAllJson
// 0x0020 (0x0020 - 0x0000)
struct DebugMenuMasterData_GetAllJson final
{
public:
	class FString                                 TableName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DebugMenuMasterData_GetAllJson) == 0x000008, "Wrong alignment on DebugMenuMasterData_GetAllJson");
static_assert(sizeof(DebugMenuMasterData_GetAllJson) == 0x000020, "Wrong size on DebugMenuMasterData_GetAllJson");
static_assert(offsetof(DebugMenuMasterData_GetAllJson, TableName) == 0x000000, "Member 'DebugMenuMasterData_GetAllJson::TableName' has a wrong offset!");
static_assert(offsetof(DebugMenuMasterData_GetAllJson, ReturnValue) == 0x000010, "Member 'DebugMenuMasterData_GetAllJson::ReturnValue' has a wrong offset!");

// Function DebugMenuMasterDataModule.DebugMenuMasterData.GetDatabaseFilePath
// 0x0010 (0x0010 - 0x0000)
struct DebugMenuMasterData_GetDatabaseFilePath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DebugMenuMasterData_GetDatabaseFilePath) == 0x000008, "Wrong alignment on DebugMenuMasterData_GetDatabaseFilePath");
static_assert(sizeof(DebugMenuMasterData_GetDatabaseFilePath) == 0x000010, "Wrong size on DebugMenuMasterData_GetDatabaseFilePath");
static_assert(offsetof(DebugMenuMasterData_GetDatabaseFilePath, ReturnValue) == 0x000000, "Member 'DebugMenuMasterData_GetDatabaseFilePath::ReturnValue' has a wrong offset!");

// Function DebugMenuMasterDataModule.DebugMenuMasterData.GetDatabasePassword
// 0x0010 (0x0010 - 0x0000)
struct DebugMenuMasterData_GetDatabasePassword final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DebugMenuMasterData_GetDatabasePassword) == 0x000008, "Wrong alignment on DebugMenuMasterData_GetDatabasePassword");
static_assert(sizeof(DebugMenuMasterData_GetDatabasePassword) == 0x000010, "Wrong size on DebugMenuMasterData_GetDatabasePassword");
static_assert(offsetof(DebugMenuMasterData_GetDatabasePassword, ReturnValue) == 0x000000, "Member 'DebugMenuMasterData_GetDatabasePassword::ReturnValue' has a wrong offset!");

// Function DebugMenuMasterDataModule.DebugMenuMasterData.GetDataFileVersion
// 0x0010 (0x0010 - 0x0000)
struct DebugMenuMasterData_GetDataFileVersion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DebugMenuMasterData_GetDataFileVersion) == 0x000008, "Wrong alignment on DebugMenuMasterData_GetDataFileVersion");
static_assert(sizeof(DebugMenuMasterData_GetDataFileVersion) == 0x000010, "Wrong size on DebugMenuMasterData_GetDataFileVersion");
static_assert(offsetof(DebugMenuMasterData_GetDataFileVersion, ReturnValue) == 0x000000, "Member 'DebugMenuMasterData_GetDataFileVersion::ReturnValue' has a wrong offset!");

// Function DebugMenuMasterDataModule.DebugMenuMasterData.GetLanguage
// 0x0001 (0x0001 - 0x0000)
struct DebugMenuMasterData_GetLanguage final
{
public:
	EMdLocalization                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DebugMenuMasterData_GetLanguage) == 0x000001, "Wrong alignment on DebugMenuMasterData_GetLanguage");
static_assert(sizeof(DebugMenuMasterData_GetLanguage) == 0x000001, "Wrong size on DebugMenuMasterData_GetLanguage");
static_assert(offsetof(DebugMenuMasterData_GetLanguage, ReturnValue) == 0x000000, "Member 'DebugMenuMasterData_GetLanguage::ReturnValue' has a wrong offset!");

// Function DebugMenuMasterDataModule.DebugMenuMasterData.GetModuleCodeVersion
// 0x0010 (0x0010 - 0x0000)
struct DebugMenuMasterData_GetModuleCodeVersion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DebugMenuMasterData_GetModuleCodeVersion) == 0x000008, "Wrong alignment on DebugMenuMasterData_GetModuleCodeVersion");
static_assert(sizeof(DebugMenuMasterData_GetModuleCodeVersion) == 0x000010, "Wrong size on DebugMenuMasterData_GetModuleCodeVersion");
static_assert(offsetof(DebugMenuMasterData_GetModuleCodeVersion, ReturnValue) == 0x000000, "Member 'DebugMenuMasterData_GetModuleCodeVersion::ReturnValue' has a wrong offset!");

// Function DebugMenuMasterDataModule.DebugMenuMasterData.GetSourceFilePath
// 0x0010 (0x0010 - 0x0000)
struct DebugMenuMasterData_GetSourceFilePath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DebugMenuMasterData_GetSourceFilePath) == 0x000008, "Wrong alignment on DebugMenuMasterData_GetSourceFilePath");
static_assert(sizeof(DebugMenuMasterData_GetSourceFilePath) == 0x000010, "Wrong size on DebugMenuMasterData_GetSourceFilePath");
static_assert(offsetof(DebugMenuMasterData_GetSourceFilePath, ReturnValue) == 0x000000, "Member 'DebugMenuMasterData_GetSourceFilePath::ReturnValue' has a wrong offset!");

// Function DebugMenuMasterDataModule.DebugMenuMasterData.GetTableList
// 0x0010 (0x0010 - 0x0000)
struct DebugMenuMasterData_GetTableList final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DebugMenuMasterData_GetTableList) == 0x000008, "Wrong alignment on DebugMenuMasterData_GetTableList");
static_assert(sizeof(DebugMenuMasterData_GetTableList) == 0x000010, "Wrong size on DebugMenuMasterData_GetTableList");
static_assert(offsetof(DebugMenuMasterData_GetTableList, ReturnValue) == 0x000000, "Member 'DebugMenuMasterData_GetTableList::ReturnValue' has a wrong offset!");

// Function DebugMenuMasterDataModule.DebugMenuMasterData.IsMasterDataInitialized
// 0x0001 (0x0001 - 0x0000)
struct DebugMenuMasterData_IsMasterDataInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DebugMenuMasterData_IsMasterDataInitialized) == 0x000001, "Wrong alignment on DebugMenuMasterData_IsMasterDataInitialized");
static_assert(sizeof(DebugMenuMasterData_IsMasterDataInitialized) == 0x000001, "Wrong size on DebugMenuMasterData_IsMasterDataInitialized");
static_assert(offsetof(DebugMenuMasterData_IsMasterDataInitialized, ReturnValue) == 0x000000, "Member 'DebugMenuMasterData_IsMasterDataInitialized::ReturnValue' has a wrong offset!");

}

