#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DevelopMenu

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "DevelopMenu_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class DevelopMenu.DevelopMenuButtonWidget
// 0x0050 (0x02C8 - 0x0278)
class UDevelopMenuButtonWidget : public UUserWidget
{
public:
	uint8                                         Pad_278[0x50];                                     // 0x0278(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ButtonClickedEvent();

	struct FLinearColor GetBorderColor() const;
	class FText GetButtonText() const;
	struct FSlateColor GetColorAndOpacity() const;
	struct FLinearColor GetContentColorAndOpacity() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DevelopMenuButtonWidget">();
	}
	static class UDevelopMenuButtonWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevelopMenuButtonWidget>();
	}
};
static_assert(alignof(UDevelopMenuButtonWidget) == 0x000008, "Wrong alignment on UDevelopMenuButtonWidget");
static_assert(sizeof(UDevelopMenuButtonWidget) == 0x0002C8, "Wrong size on UDevelopMenuButtonWidget");

// Class DevelopMenu.DevelopMenuItemWidget
// 0x0050 (0x02C8 - 0x0278)
class UDevelopMenuItemWidget : public UUserWidget
{
public:
	uint8                                         Pad_278[0x20];                                     // 0x0278(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevelopMenuWidget*                     _developMenuWidgetRef;                             // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UWidget*>                        _widgetTreeArray;                                  // 0x02A0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B0[0x18];                                     // 0x02B0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ExecuteEvent_CallFunc(int32 SelectNum);
	void ExecuteEvent_CallFuncAll();
	void ExecuteEvent_OnBeginSliderMovement_Float();
	void ExecuteEvent_OnCheckStateChanged_ItemCheckBox(bool IsChecked);
	void ExecuteEvent_OnClicked_CallFuncButton();
	void ExecuteEvent_OnClicked_CallFuncString();
	void ExecuteEvent_OnClicked_ItemButton();
	void ExecuteEvent_OnSelectionChanged_ItemTextList(const class FString& Text, ESelectInfo SelectionType);
	void ExecuteEvent_OnTextCommitted_String(const class FText& Text, ETextCommit CommitMethod);
	void ExecuteEvent_OnValueChanged(float Value);
	void ExecuteEvent_OnValueCommitted_Float(float Value, ETextCommit CommitMethod);
	void ExecuteEvent_OnValueCommitted_Int(float Value, ETextCommit CommitMethod);
	ECheckBoxState GetItemCheckBox();
	struct FEventReply OnMouseMoveDebug(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnReloadItem(class FName Name_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DevelopMenuItemWidget">();
	}
	static class UDevelopMenuItemWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevelopMenuItemWidget>();
	}
};
static_assert(alignof(UDevelopMenuItemWidget) == 0x000008, "Wrong alignment on UDevelopMenuItemWidget");
static_assert(sizeof(UDevelopMenuItemWidget) == 0x0002C8, "Wrong size on UDevelopMenuItemWidget");
static_assert(offsetof(UDevelopMenuItemWidget, _developMenuWidgetRef) == 0x000298, "Member 'UDevelopMenuItemWidget::_developMenuWidgetRef' has a wrong offset!");
static_assert(offsetof(UDevelopMenuItemWidget, _widgetTreeArray) == 0x0002A0, "Member 'UDevelopMenuItemWidget::_widgetTreeArray' has a wrong offset!");

// Class DevelopMenu.DevelopMenuWaitWidget
// 0x0008 (0x0280 - 0x0278)
class UDevelopMenuWaitWidget : public UUserWidget
{
public:
	class UTextBlock*                             _otherPlayerName;                                  // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DevelopMenuWaitWidget">();
	}
	static class UDevelopMenuWaitWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevelopMenuWaitWidget>();
	}
};
static_assert(alignof(UDevelopMenuWaitWidget) == 0x000008, "Wrong alignment on UDevelopMenuWaitWidget");
static_assert(sizeof(UDevelopMenuWaitWidget) == 0x000280, "Wrong size on UDevelopMenuWaitWidget");
static_assert(offsetof(UDevelopMenuWaitWidget, _otherPlayerName) == 0x000278, "Member 'UDevelopMenuWaitWidget::_otherPlayerName' has a wrong offset!");

// Class DevelopMenu.DevelopMenuWidget
// 0x00D8 (0x0350 - 0x0278)
class UDevelopMenuWidget : public UUserWidget
{
public:
	uint8                                         Pad_278[0x20];                                     // 0x0278(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDevelopMenuButtonWidget*>       _menuButtonArray;                                  // 0x0298(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A8[0x10];                                     // 0x02A8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDevelopMenuItemWidget*>         _itemWidgetList;                                   // 0x02B8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UWidget*>                        _systemElementArray;                               // 0x02C8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                        _subTabSwitcher;                                   // 0x02D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                        _scrollBoxSwitcher;                                // 0x02E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UScrollBox*>                     _scrollBoxItemWidgets;                             // 0x02E8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F8[0x10];                                     // 0x02F8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevelopMenuItemWidget*                 _currentItemWidgetRef;                             // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             _dipMessage;                                       // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             _dipMaker;                                         // 0x0318(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             _dipDisplayString;                                 // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_328[0x20];                                     // 0x0328(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             _currentScrollBox;                                 // 0x0348(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BP_ExecuteEvent_OnClicked_RestartButton();
	void BP_ExecuteEvent_OnClicked_SaveButton();
	void ExecuteEvent_OnClicked_ExitButton();
	void ExecuteEvent_OnClicked_LoadButton();
	void ExecuteEvent_OnClicked_ResetButton();
	void ExecuteEvent_OnClicked_RestartButton();
	void ExecuteEvent_OnClicked_SaveButton();
	void ExecuteEvent_OnSelectionChanged_SlotComboBox(const class FString& SelectedItem, ESelectInfo SelectionType);
	void OnClickedMenuButton(EDevelopMenuMainTabID MainId, EDevelopMenuSubTabID SubId, EDevelopMenuHierarchy Hierarchy);
	void SetButtonFlag(EDevelopMenuMainTabID MainId, EDevelopMenuSubTabID SubId, EDevelopMenuHierarchy Hierarchy);
	void SetSystemElementFlag(EDevelopMenuHierarchy Hierarchy);

	class FText GetDipDisplayString() const;
	class FText GetDipMessageText() const;
	class FText GetMakerText() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DevelopMenuWidget">();
	}
	static class UDevelopMenuWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevelopMenuWidget>();
	}
};
static_assert(alignof(UDevelopMenuWidget) == 0x000008, "Wrong alignment on UDevelopMenuWidget");
static_assert(sizeof(UDevelopMenuWidget) == 0x000350, "Wrong size on UDevelopMenuWidget");
static_assert(offsetof(UDevelopMenuWidget, _menuButtonArray) == 0x000298, "Member 'UDevelopMenuWidget::_menuButtonArray' has a wrong offset!");
static_assert(offsetof(UDevelopMenuWidget, _itemWidgetList) == 0x0002B8, "Member 'UDevelopMenuWidget::_itemWidgetList' has a wrong offset!");
static_assert(offsetof(UDevelopMenuWidget, _systemElementArray) == 0x0002C8, "Member 'UDevelopMenuWidget::_systemElementArray' has a wrong offset!");
static_assert(offsetof(UDevelopMenuWidget, _subTabSwitcher) == 0x0002D8, "Member 'UDevelopMenuWidget::_subTabSwitcher' has a wrong offset!");
static_assert(offsetof(UDevelopMenuWidget, _scrollBoxSwitcher) == 0x0002E0, "Member 'UDevelopMenuWidget::_scrollBoxSwitcher' has a wrong offset!");
static_assert(offsetof(UDevelopMenuWidget, _scrollBoxItemWidgets) == 0x0002E8, "Member 'UDevelopMenuWidget::_scrollBoxItemWidgets' has a wrong offset!");
static_assert(offsetof(UDevelopMenuWidget, _currentItemWidgetRef) == 0x000308, "Member 'UDevelopMenuWidget::_currentItemWidgetRef' has a wrong offset!");
static_assert(offsetof(UDevelopMenuWidget, _dipMessage) == 0x000310, "Member 'UDevelopMenuWidget::_dipMessage' has a wrong offset!");
static_assert(offsetof(UDevelopMenuWidget, _dipMaker) == 0x000318, "Member 'UDevelopMenuWidget::_dipMaker' has a wrong offset!");
static_assert(offsetof(UDevelopMenuWidget, _dipDisplayString) == 0x000320, "Member 'UDevelopMenuWidget::_dipDisplayString' has a wrong offset!");
static_assert(offsetof(UDevelopMenuWidget, _currentScrollBox) == 0x000348, "Member 'UDevelopMenuWidget::_currentScrollBox' has a wrong offset!");

// Class DevelopMenu.DevelopMenuWork
// 0x00F8 (0x0128 - 0x0030)
class UDevelopMenuWork final : public UGameInstanceSubsystem
{
public:
	FMulticastInlineDelegateProperty_             _onExitDevelopMenu;                                // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0xE8];                                      // 0x0040(0x00E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OpenDIPMenu(class UObject* WorldContextObject, bool bOpen);
	void BP_OpenWaitMenu(class UObject* WorldContextObject, bool bOpen);
	void ExitDevelopMenuDelegate__DelegateSignature();

	bool BP_GetDipAsBoolean(class FName IdName) const;
	float BP_GetDipAsFloat(class FName IdName) const;
	int32 BP_GetDipAsInt(class FName IdName) const;
	class FString BP_GetDipAsString(class FName IdName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DevelopMenuWork">();
	}
	static class UDevelopMenuWork* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevelopMenuWork>();
	}
};
static_assert(alignof(UDevelopMenuWork) == 0x000008, "Wrong alignment on UDevelopMenuWork");
static_assert(sizeof(UDevelopMenuWork) == 0x000128, "Wrong size on UDevelopMenuWork");
static_assert(offsetof(UDevelopMenuWork, _onExitDevelopMenu) == 0x000030, "Member 'UDevelopMenuWork::_onExitDevelopMenu' has a wrong offset!");

}

