#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameModule

#include "Basic.hpp"

#include "UIFramework_structs.hpp"
#include "UIFramework_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "BykingUnrealModule_structs.hpp"
#include "BykingUnrealModule_classes.hpp"
#include "CommonModule_structs.hpp"
#include "CommonModule_classes.hpp"
#include "GameModule_structs.hpp"
#include "CriWareRuntime_structs.hpp"
#include "CriWareRuntime_classes.hpp"
#include "MasterDataModule_structs.hpp"
#include "InputCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BackendSubsystem_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class GameModule.AbilityLevelListWidget
// 0x0078 (0x03C8 - 0x0350)
class UAbilityLevelListWidget final : public UWidgetBase
{
public:
	class UPanelWidget*                           _parentAbilityPanel;                               // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                _nextIcon;                                         // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_360[0x50];                                     // 0x0360(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   _noneLevelText;                                    // 0x03B0(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityLevelListWidget">();
	}
	static class UAbilityLevelListWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityLevelListWidget>();
	}
};
static_assert(alignof(UAbilityLevelListWidget) == 0x000008, "Wrong alignment on UAbilityLevelListWidget");
static_assert(sizeof(UAbilityLevelListWidget) == 0x0003C8, "Wrong size on UAbilityLevelListWidget");
static_assert(offsetof(UAbilityLevelListWidget, _parentAbilityPanel) == 0x000350, "Member 'UAbilityLevelListWidget::_parentAbilityPanel' has a wrong offset!");
static_assert(offsetof(UAbilityLevelListWidget, _nextIcon) == 0x000358, "Member 'UAbilityLevelListWidget::_nextIcon' has a wrong offset!");
static_assert(offsetof(UAbilityLevelListWidget, _noneLevelText) == 0x0003B0, "Member 'UAbilityLevelListWidget::_noneLevelText' has a wrong offset!");

// Class GameModule.AbilityLevelWidget
// 0x01F0 (0x0540 - 0x0350)
class UAbilityLevelWidget final : public UWidgetBase
{
public:
	class UImage*                                 _bgImage;                                          // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             _levelTextBlock;                                   // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAdjustTextWidget*                      _infoAdjustText;                                   // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                _nowLevelLine;                                     // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         _level;                                            // 0x0370(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   _levelFormatText;                                  // 0x0378(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                   _levelMaxText;                                     // 0x0390(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FLinearColor                           _bgColorLessThanNowLevel;                          // 0x03A8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           _bgColorEqualNowLevel;                             // 0x03B8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           _bgColorGreaterThanNowLevel;                       // 0x03C8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           _textColorLessThanNowLevel;                        // 0x03D8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           _textColorEqualNowLevel;                           // 0x03E8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           _textColorGreaterThanNowLevel;                     // 0x03F8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSlateFontInfo                         _fontInfoLessThanNowLevel;                         // 0x0408(0x0058)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSlateFontInfo                         _fontInfoEqualNowLevel;                            // 0x0460(0x0058)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSlateFontInfo                         _fontInfoGreaterThanNowLevel;                      // 0x04B8(0x0058)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_510[0x30];                                     // 0x0510(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityLevelWidget">();
	}
	static class UAbilityLevelWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityLevelWidget>();
	}
};
static_assert(alignof(UAbilityLevelWidget) == 0x000008, "Wrong alignment on UAbilityLevelWidget");
static_assert(sizeof(UAbilityLevelWidget) == 0x000540, "Wrong size on UAbilityLevelWidget");
static_assert(offsetof(UAbilityLevelWidget, _bgImage) == 0x000350, "Member 'UAbilityLevelWidget::_bgImage' has a wrong offset!");
static_assert(offsetof(UAbilityLevelWidget, _levelTextBlock) == 0x000358, "Member 'UAbilityLevelWidget::_levelTextBlock' has a wrong offset!");
static_assert(offsetof(UAbilityLevelWidget, _infoAdjustText) == 0x000360, "Member 'UAbilityLevelWidget::_infoAdjustText' has a wrong offset!");
static_assert(offsetof(UAbilityLevelWidget, _nowLevelLine) == 0x000368, "Member 'UAbilityLevelWidget::_nowLevelLine' has a wrong offset!");
static_assert(offsetof(UAbilityLevelWidget, _level) == 0x000370, "Member 'UAbilityLevelWidget::_level' has a wrong offset!");
static_assert(offsetof(UAbilityLevelWidget, _levelFormatText) == 0x000378, "Member 'UAbilityLevelWidget::_levelFormatText' has a wrong offset!");
static_assert(offsetof(UAbilityLevelWidget, _levelMaxText) == 0x000390, "Member 'UAbilityLevelWidget::_levelMaxText' has a wrong offset!");
static_assert(offsetof(UAbilityLevelWidget, _bgColorLessThanNowLevel) == 0x0003A8, "Member 'UAbilityLevelWidget::_bgColorLessThanNowLevel' has a wrong offset!");
static_assert(offsetof(UAbilityLevelWidget, _bgColorEqualNowLevel) == 0x0003B8, "Member 'UAbilityLevelWidget::_bgColorEqualNowLevel' has a wrong offset!");
static_assert(offsetof(UAbilityLevelWidget, _bgColorGreaterThanNowLevel) == 0x0003C8, "Member 'UAbilityLevelWidget::_bgColorGreaterThanNowLevel' has a wrong offset!");
static_assert(offsetof(UAbilityLevelWidget, _textColorLessThanNowLevel) == 0x0003D8, "Member 'UAbilityLevelWidget::_textColorLessThanNowLevel' has a wrong offset!");
static_assert(offsetof(UAbilityLevelWidget, _textColorEqualNowLevel) == 0x0003E8, "Member 'UAbilityLevelWidget::_textColorEqualNowLevel' has a wrong offset!");
static_assert(offsetof(UAbilityLevelWidget, _textColorGreaterThanNowLevel) == 0x0003F8, "Member 'UAbilityLevelWidget::_textColorGreaterThanNowLevel' has a wrong offset!");
static_assert(offsetof(UAbilityLevelWidget, _fontInfoLessThanNowLevel) == 0x000408, "Member 'UAbilityLevelWidget::_fontInfoLessThanNowLevel' has a wrong offset!");
static_assert(offsetof(UAbilityLevelWidget, _fontInfoEqualNowLevel) == 0x000460, "Member 'UAbilityLevelWidget::_fontInfoEqualNowLevel' has a wrong offset!");
static_assert(offsetof(UAbilityLevelWidget, _fontInfoGreaterThanNowLevel) == 0x0004B8, "Member 'UAbilityLevelWidget::_fontInfoGreaterThanNowLevel' has a wrong offset!");

// Class GameModule.AbilityListWidget
// 0x0018 (0x0368 - 0x0350)
class UAbilityListWidget final : public UWidgetBase
{
public:
	class UAbilityWidget*                         _ability;                                          // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAbilityLevelListWidget*                _abilityLevelList;                                 // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         _abilityIndex;                                     // 0x0360(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityListWidget">();
	}
	static class UAbilityListWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityListWidget>();
	}
};
static_assert(alignof(UAbilityListWidget) == 0x000008, "Wrong alignment on UAbilityListWidget");
static_assert(sizeof(UAbilityListWidget) == 0x000368, "Wrong size on UAbilityListWidget");
static_assert(offsetof(UAbilityListWidget, _ability) == 0x000350, "Member 'UAbilityListWidget::_ability' has a wrong offset!");
static_assert(offsetof(UAbilityListWidget, _abilityLevelList) == 0x000358, "Member 'UAbilityListWidget::_abilityLevelList' has a wrong offset!");
static_assert(offsetof(UAbilityListWidget, _abilityIndex) == 0x000360, "Member 'UAbilityListWidget::_abilityIndex' has a wrong offset!");

// Class GameModule.AbilityWidget
// 0x0010 (0x0360 - 0x0350)
class UAbilityWidget final : public UWidgetBase
{
public:
	class UTextBlock*                             _abilityNameText;                                  // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             _abilityInfoText;                                  // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityWidget">();
	}
	static class UAbilityWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityWidget>();
	}
};
static_assert(alignof(UAbilityWidget) == 0x000008, "Wrong alignment on UAbilityWidget");
static_assert(sizeof(UAbilityWidget) == 0x000360, "Wrong size on UAbilityWidget");
static_assert(offsetof(UAbilityWidget, _abilityNameText) == 0x000350, "Member 'UAbilityWidget::_abilityNameText' has a wrong offset!");
static_assert(offsetof(UAbilityWidget, _abilityInfoText) == 0x000358, "Member 'UAbilityWidget::_abilityInfoText' has a wrong offset!");

// Class GameModule.Accessory
// 0x0070 (0x0098 - 0x0028)
class UAccessory final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<uint16, class UMeshComponent*>           _meshes;                                           // 0x0048(0x0050)(ExportObject, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Accessory">();
	}
	static class UAccessory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccessory>();
	}
};
static_assert(alignof(UAccessory) == 0x000008, "Wrong alignment on UAccessory");
static_assert(sizeof(UAccessory) == 0x000098, "Wrong size on UAccessory");
static_assert(offsetof(UAccessory, _meshes) == 0x000048, "Member 'UAccessory::_meshes' has a wrong offset!");

// Class GameModule.AchievementWidget
// 0x0028 (0x0378 - 0x0350)
class UAchievementWidget final : public UWidgetBase
{
public:
	TArray<class UTextBlock*>                     _titleTextList;                                    // 0x0350(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UWidgetText*>                    _achievementTextList;                              // 0x0360(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UVerticalBox*                           _clearList;                                        // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementWidget">();
	}
	static class UAchievementWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementWidget>();
	}
};
static_assert(alignof(UAchievementWidget) == 0x000008, "Wrong alignment on UAchievementWidget");
static_assert(sizeof(UAchievementWidget) == 0x000378, "Wrong size on UAchievementWidget");
static_assert(offsetof(UAchievementWidget, _titleTextList) == 0x000350, "Member 'UAchievementWidget::_titleTextList' has a wrong offset!");
static_assert(offsetof(UAchievementWidget, _achievementTextList) == 0x000360, "Member 'UAchievementWidget::_achievementTextList' has a wrong offset!");
static_assert(offsetof(UAchievementWidget, _clearList) == 0x000370, "Member 'UAchievementWidget::_clearList' has a wrong offset!");

// Class GameModule.AchievementWork
// 0x00B0 (0x00E0 - 0x0030)
class UAchievementWork final : public UGameInstanceSubsystem
{
public:
	struct FTimerHandle                           _storeStatsTimerHandle;                            // 0x0030(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0xA8];                                      // 0x0038(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAddItem(const struct FDbItemCategoryParam& Item, const int32 Quantity);
	void SetBuyShop();
	void SetClearTutorial();
	void SetSendLike(const int32 Count);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementWork">();
	}
	static class UAchievementWork* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementWork>();
	}
};
static_assert(alignof(UAchievementWork) == 0x000008, "Wrong alignment on UAchievementWork");
static_assert(sizeof(UAchievementWork) == 0x0000E0, "Wrong size on UAchievementWork");
static_assert(offsetof(UAchievementWork, _storeStatsTimerHandle) == 0x000030, "Member 'UAchievementWork::_storeStatsTimerHandle' has a wrong offset!");

// Class GameModule.AdjustTextWidget
// 0x0110 (0x0460 - 0x0350)
class UAdjustTextWidget : public UWidgetBase
{
public:
	FMulticastInlineDelegateProperty_             OnFinishedScrollEventDelegate;                     // 0x0350(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FText                                   _text;                                             // 0x0360(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	float                                         _minScale;                                         // 0x0378(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _scrollSpeed;                                      // 0x037C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _scrollStartWait;                                  // 0x0380(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _scrollEndSpace;                                   // 0x0384(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateColor                            _textColorAndOpacity;                              // 0x0388(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FSlateFontInfo                         _font;                                             // 0x03B0(0x0058)(Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              _shadowOffset;                                     // 0x0408(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           _shadowColor;                                      // 0x0410(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETextJustify                                  _justufication;                                    // 0x0420(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _bNoLineBreak;                                     // 0x0421(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_422[0x6];                                      // 0x0422(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             _textBlock;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_430[0x30];                                     // 0x0430(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FSlateFontInfo BP_GetFont();
	class FText BP_GetText();
	void BP_SetFont(const struct FSlateFontInfo& Font);
	void BP_SetJustification(ETextJustify Justification);
	void BP_SetLineBreak(bool LineBreak);
	void BP_SetText(const class FText& Text);
	void BP_SetTextColorAndOpacity(const struct FSlateColor& InColorAndOpacity);
	void OnFinishedScrollEventDelegate__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AdjustTextWidget">();
	}
	static class UAdjustTextWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAdjustTextWidget>();
	}
};
static_assert(alignof(UAdjustTextWidget) == 0x000008, "Wrong alignment on UAdjustTextWidget");
static_assert(sizeof(UAdjustTextWidget) == 0x000460, "Wrong size on UAdjustTextWidget");
static_assert(offsetof(UAdjustTextWidget, OnFinishedScrollEventDelegate) == 0x000350, "Member 'UAdjustTextWidget::OnFinishedScrollEventDelegate' has a wrong offset!");
static_assert(offsetof(UAdjustTextWidget, _text) == 0x000360, "Member 'UAdjustTextWidget::_text' has a wrong offset!");
static_assert(offsetof(UAdjustTextWidget, _minScale) == 0x000378, "Member 'UAdjustTextWidget::_minScale' has a wrong offset!");
static_assert(offsetof(UAdjustTextWidget, _scrollSpeed) == 0x00037C, "Member 'UAdjustTextWidget::_scrollSpeed' has a wrong offset!");
static_assert(offsetof(UAdjustTextWidget, _scrollStartWait) == 0x000380, "Member 'UAdjustTextWidget::_scrollStartWait' has a wrong offset!");
static_assert(offsetof(UAdjustTextWidget, _scrollEndSpace) == 0x000384, "Member 'UAdjustTextWidget::_scrollEndSpace' has a wrong offset!");
static_assert(offsetof(UAdjustTextWidget, _textColorAndOpacity) == 0x000388, "Member 'UAdjustTextWidget::_textColorAndOpacity' has a wrong offset!");
static_assert(offsetof(UAdjustTextWidget, _font) == 0x0003B0, "Member 'UAdjustTextWidget::_font' has a wrong offset!");
static_assert(offsetof(UAdjustTextWidget, _shadowOffset) == 0x000408, "Member 'UAdjustTextWidget::_shadowOffset' has a wrong offset!");
static_assert(offsetof(UAdjustTextWidget, _shadowColor) == 0x000410, "Member 'UAdjustTextWidget::_shadowColor' has a wrong offset!");
static_assert(offsetof(UAdjustTextWidget, _justufication) == 0x000420, "Member 'UAdjustTextWidget::_justufication' has a wrong offset!");
static_assert(offsetof(UAdjustTextWidget, _bNoLineBreak) == 0x000421, "Member 'UAdjustTextWidget::_bNoLineBreak' has a wrong offset!");
static_assert(offsetof(UAdjustTextWidget, _textBlock) == 0x000428, "Member 'UAdjustTextWidget::_textBlock' has a wrong offset!");

// Class GameModule.AN_FaceTurn
// 0x0008 (0x0048 - 0x0040)
class UAN_FaceTurn final : public UAN_CharacterBase
{
public:
	float                                         _turnRate;                                         // 0x0040(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _blendTime;                                        // 0x0044(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AN_FaceTurn">();
	}
	static class UAN_FaceTurn* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAN_FaceTurn>();
	}
};
static_assert(alignof(UAN_FaceTurn) == 0x000008, "Wrong alignment on UAN_FaceTurn");
static_assert(sizeof(UAN_FaceTurn) == 0x000048, "Wrong size on UAN_FaceTurn");
static_assert(offsetof(UAN_FaceTurn, _turnRate) == 0x000040, "Member 'UAN_FaceTurn::_turnRate' has a wrong offset!");
static_assert(offsetof(UAN_FaceTurn, _blendTime) == 0x000044, "Member 'UAN_FaceTurn::_blendTime' has a wrong offset!");

// Class GameModule.AN_SetAimingRate
// 0x0008 (0x0040 - 0x0038)
class UAN_SetAimingRate final : public UAnimNotify
{
public:
	float                                         _aimingRate;                                       // 0x0038(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _blendTime;                                        // 0x003C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AN_SetAimingRate">();
	}
	static class UAN_SetAimingRate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAN_SetAimingRate>();
	}
};
static_assert(alignof(UAN_SetAimingRate) == 0x000008, "Wrong alignment on UAN_SetAimingRate");
static_assert(sizeof(UAN_SetAimingRate) == 0x000040, "Wrong size on UAN_SetAimingRate");
static_assert(offsetof(UAN_SetAimingRate, _aimingRate) == 0x000038, "Member 'UAN_SetAimingRate::_aimingRate' has a wrong offset!");
static_assert(offsetof(UAN_SetAimingRate, _blendTime) == 0x00003C, "Member 'UAN_SetAimingRate::_blendTime' has a wrong offset!");

// Class GameModule.Animation
// 0x0660 (0x0710 - 0x00B0)
class alignas(0x10) UAnimation : public UActorComponent
{
public:
	uint8                                         Pad_B0[0x528];                                     // 0x00B0(0x0528)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimationPlayParams                   _replicatedPlayParams;                             // 0x05D8(0x0004)(Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstanceGame*                      _animInstance;                                     // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APawn*                                  _character;                                        // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5F0[0x120];                                    // 0x05F0(0x0120)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_AnimationBlendingOutStartedDelegate(TDelegate<void()> Delegate, EAnimationId ID);
	void BP_AnimationEndedDelegate(TDelegate<void()> Delegate, EAnimationId ID);
	void BP_ChangeAnimationAsset(ECharacterId CharaID, const TArray<EAnimationId>& SrcIds, const TArray<class FName>& DstIds);
	void BP_ChangeNagaraGuard(ECharacterId CharaID);
	void BP_ChangeNagaraOtherCharacter(ECharacterId CharaID, uint8 VariationNo);
	void BP_ChangeNagaraOtherUnique(int32 UniqueNo, ECharacterId CharaID, uint8 VariationNo);
	void BP_ChangeUniqueOtherCharacter(int32 UniqueNo, ECharacterId CharaID, uint8 VariationNo);
	void BP_DisableAnimNotify(int32 NotifyTypeFlags);
	void BP_DisableRootMotion(EAnimationSlot Slot, bool bDisable);
	class FName BP_EmoteCodeToAnimIdName(int32 EmoteCode);
	void BP_JumpToSection(class FName SectionName, EAnimationSlot Slot);
	void BP_PlayAnimation(EAnimationId ID, float PlayRate, float BlendInTime, bool bNotReplay);
	void BP_PlayAnimationAsync(ECharacterId CharaID, class FName ID, EAnimationSlot Slot, float PlayRate, float BlendInTime, float BlendOutTime);
	void BP_PlayAnimationEmote(int32 EmoteCode, float PlayRate, float BlendInTime);
	void BP_PlayAnimationFace(EAnimationId ID, float PlayRate, float BlendInTime);
	void BP_PlayAnimationNagara(EAnimationId ID, float PlayRate, float BlendInTime);
	void BP_PlayAnimationNagaraDamage(EAnimationId ID, float PlayRate, float BlendInTime);
	void BP_PlayAnimationNagaraGuard(EAnimationId ID, float PlayRate, float BlendInTime);
	void BP_PlayAnimationReplicate(EAnimationId ID, EAnimationSlot Slot, float PlayRate);
	void BP_ResetDynamics(ETeleportType TeleportType, float Duration);
	void BP_SetAimingRate(float Rate, float BlendTime);
	void BP_SetAimTargetLocation(const struct FVector& Location);
	void BP_SetAnimationSpeedRate(float Speed);
	void BP_SetCenterRotationOffset(const struct FRotator& Rot);
	void BP_SetCenterTransOffset(const struct FVector& Offset);
	void BP_SetCurrentPlayPosition(EAnimationSlot Slot, float Position);
	void BP_SetFaceAimingRate(float Rate, float BlendTime);
	void BP_SetFaceDamageOneShot(const struct FVector& Location, float Rate, float BlendTime);
	void BP_SetLeanRate(float Rate, float MaxSpeed);
	void BP_SetMoveType(EAnimationMoveType Type);
	void BP_SetPlayRate(EAnimationSlot Slot, float PlayRate);
	void BP_SetRunMoveDistance(float Distance);
	void BP_SetWalkMoveDistance(float Distance);
	void BP_SetWholeAimingRate(float Rate, float BlendTime);
	void BP_StopAnimation(EAnimationSlot Slot, float BlendOutTime);
	void OnMontageBlendingOutStarted(class UAnimMontage* Montage, bool bInterrupted);
	void OnMontageEnded(class UAnimMontage* Montage, bool bInterrupted);
	void OnMontageStarted(class UAnimMontage* Montage);
	void OnRep_PlayAnimation();
	void ServerPlayAnimation(const struct FAnimationPlayParams& Param);

	EAnimationId BP_GetCurrentAnimationId(EAnimationSlot Slot) const;
	float BP_GetCurrentPlayLength(EAnimationSlot Slot) const;
	float BP_GetCurrentPlayPosition(EAnimationSlot Slot) const;
	bool BP_IsActiveAnimation(EAnimationSlot Slot, EAnimationId ID) const;
	bool BP_IsBaseCommon() const;
	bool BP_IsInitialized() const;
	bool BP_IsPlayingAnimation(EAnimationSlot Slot, EAnimationId ID) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Animation">();
	}
	static class UAnimation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimation>();
	}
};
static_assert(alignof(UAnimation) == 0x000010, "Wrong alignment on UAnimation");
static_assert(sizeof(UAnimation) == 0x000710, "Wrong size on UAnimation");
static_assert(offsetof(UAnimation, _replicatedPlayParams) == 0x0005D8, "Member 'UAnimation::_replicatedPlayParams' has a wrong offset!");
static_assert(offsetof(UAnimation, _animInstance) == 0x0005E0, "Member 'UAnimation::_animInstance' has a wrong offset!");
static_assert(offsetof(UAnimation, _character) == 0x0005E8, "Member 'UAnimation::_character' has a wrong offset!");

// Class GameModule.AnimInstanceGame
// 0x01A0 (0x0460 - 0x02C0)
#pragma pack(push, 0x1)
class alignas(0x10) UAnimInstanceGame : public UAnimInstance
{
public:
	FMulticastInlineDelegateProperty_             OnPlayerCharacterSelectedIdleDelegate;             // 0x02B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnPlayerCharacterIdleDelegate;                     // 0x02C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	EAnimationMoveType                            MoveType;                                          // 0x02D8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WalkDirection;                                     // 0x02DC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GaitValue;                                         // 0x02E0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WalkPlayRate;                                      // 0x02E4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WallcrawlLeftRight;                                // 0x02E8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WallcrawlUpDown;                                   // 0x02EC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WallcrawlPlayRate;                                 // 0x02F0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAnimationLeanType                            LeanType;                                          // 0x02F4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              LeanRate;                                          // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAimOffsetBlendSpace1D*                 AimOffsetUpLower;                                  // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAimOffsetBlendSpace1D*                 AimOffsetLeftRight;                                // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AimingBlendRateUpper;                              // 0x0310(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AimingBlendRateLower;                              // 0x0314(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AimingBaseBlendRateL;                              // 0x0318(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AimingBaseBlendRateR;                              // 0x031C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AimingBaseBlendRateWings;                          // 0x0320(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AimingPitchRate;                                   // 0x0324(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AimingYawRate;                                     // 0x0328(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAimOffsetResetPlayTime;                           // 0x032C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AimOffsetPlayRate;                                 // 0x0330(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               COGRotation;                                       // 0x0334(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FRotator                               COGRotationInv;                                    // 0x0340(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FRotator                               SpineRotation;                                     // 0x034C(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         SpineRotationRate;                                 // 0x0358(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                JointRootTransOffset;                              // 0x035C(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               JointRootRotOffset;                                // 0x0368(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                                FaceTurnLocation;                                  // 0x0374(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FaceTurnRate;                                      // 0x0380(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FaceTurnHeadClamp;                                 // 0x0384(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FaceTurnNeckClamp;                                 // 0x0388(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FacialBlendRate;                                   // 0x038C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RHandHeadIkRate;                                   // 0x0390(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LipSyncBlendRate;                                  // 0x0394(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LipSyncRateA;                                      // 0x0398(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LipSyncRateI;                                      // 0x039C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LipSyncRateU;                                      // 0x03A0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LipSyncRateE;                                      // 0x03A4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LipSyncRateO;                                      // 0x03A8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LipSyncRateN;                                      // 0x03AC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOutgame;                                          // 0x03B0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WalkGaitInterpSpeed;                               // 0x03B4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LeanInterpSpeed;                                   // 0x03B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FSlotAssetData>      _slotData;                                         // 0x03C0(0x0050)(Protected, NativeAccessSpecifierProtected)
	TArray<class UAnimMontage*>                   _changedOutMontages;                               // 0x0410(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_420[0x20];                                     // 0x0420(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ThresholdEffectLOD_Windows;                        // 0x0440(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ThresholdEffectLOD_PS4;                            // 0x0444(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ThresholdEffectLOD_PS5;                            // 0x0448(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ThresholdEffectLOD_XboxOne;                        // 0x044C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ThresholdEffectLOD_Switch;                         // 0x0450(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ThresholdEffectLOD_Others;                         // 0x0454(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_EndNotifyStates();
	void PlayCharacterSelectIdle__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimInstanceGame">();
	}
	static class UAnimInstanceGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimInstanceGame>();
	}
};
#pragma pack(pop)
static_assert(alignof(UAnimInstanceGame) == 0x000010, "Wrong alignment on UAnimInstanceGame");
static_assert(sizeof(UAnimInstanceGame) == 0x000460, "Wrong size on UAnimInstanceGame");
static_assert(offsetof(UAnimInstanceGame, OnPlayerCharacterSelectedIdleDelegate) == 0x0002B8, "Member 'UAnimInstanceGame::OnPlayerCharacterSelectedIdleDelegate' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, OnPlayerCharacterIdleDelegate) == 0x0002C8, "Member 'UAnimInstanceGame::OnPlayerCharacterIdleDelegate' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, MoveType) == 0x0002D8, "Member 'UAnimInstanceGame::MoveType' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, WalkDirection) == 0x0002DC, "Member 'UAnimInstanceGame::WalkDirection' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, GaitValue) == 0x0002E0, "Member 'UAnimInstanceGame::GaitValue' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, WalkPlayRate) == 0x0002E4, "Member 'UAnimInstanceGame::WalkPlayRate' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, WallcrawlLeftRight) == 0x0002E8, "Member 'UAnimInstanceGame::WallcrawlLeftRight' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, WallcrawlUpDown) == 0x0002EC, "Member 'UAnimInstanceGame::WallcrawlUpDown' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, WallcrawlPlayRate) == 0x0002F0, "Member 'UAnimInstanceGame::WallcrawlPlayRate' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, LeanType) == 0x0002F4, "Member 'UAnimInstanceGame::LeanType' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, LeanRate) == 0x0002F8, "Member 'UAnimInstanceGame::LeanRate' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, AimOffsetUpLower) == 0x000300, "Member 'UAnimInstanceGame::AimOffsetUpLower' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, AimOffsetLeftRight) == 0x000308, "Member 'UAnimInstanceGame::AimOffsetLeftRight' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, AimingBlendRateUpper) == 0x000310, "Member 'UAnimInstanceGame::AimingBlendRateUpper' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, AimingBlendRateLower) == 0x000314, "Member 'UAnimInstanceGame::AimingBlendRateLower' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, AimingBaseBlendRateL) == 0x000318, "Member 'UAnimInstanceGame::AimingBaseBlendRateL' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, AimingBaseBlendRateR) == 0x00031C, "Member 'UAnimInstanceGame::AimingBaseBlendRateR' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, AimingBaseBlendRateWings) == 0x000320, "Member 'UAnimInstanceGame::AimingBaseBlendRateWings' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, AimingPitchRate) == 0x000324, "Member 'UAnimInstanceGame::AimingPitchRate' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, AimingYawRate) == 0x000328, "Member 'UAnimInstanceGame::AimingYawRate' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, bAimOffsetResetPlayTime) == 0x00032C, "Member 'UAnimInstanceGame::bAimOffsetResetPlayTime' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, AimOffsetPlayRate) == 0x000330, "Member 'UAnimInstanceGame::AimOffsetPlayRate' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, COGRotation) == 0x000334, "Member 'UAnimInstanceGame::COGRotation' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, COGRotationInv) == 0x000340, "Member 'UAnimInstanceGame::COGRotationInv' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, SpineRotation) == 0x00034C, "Member 'UAnimInstanceGame::SpineRotation' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, SpineRotationRate) == 0x000358, "Member 'UAnimInstanceGame::SpineRotationRate' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, JointRootTransOffset) == 0x00035C, "Member 'UAnimInstanceGame::JointRootTransOffset' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, JointRootRotOffset) == 0x000368, "Member 'UAnimInstanceGame::JointRootRotOffset' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, FaceTurnLocation) == 0x000374, "Member 'UAnimInstanceGame::FaceTurnLocation' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, FaceTurnRate) == 0x000380, "Member 'UAnimInstanceGame::FaceTurnRate' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, FaceTurnHeadClamp) == 0x000384, "Member 'UAnimInstanceGame::FaceTurnHeadClamp' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, FaceTurnNeckClamp) == 0x000388, "Member 'UAnimInstanceGame::FaceTurnNeckClamp' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, FacialBlendRate) == 0x00038C, "Member 'UAnimInstanceGame::FacialBlendRate' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, RHandHeadIkRate) == 0x000390, "Member 'UAnimInstanceGame::RHandHeadIkRate' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, LipSyncBlendRate) == 0x000394, "Member 'UAnimInstanceGame::LipSyncBlendRate' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, LipSyncRateA) == 0x000398, "Member 'UAnimInstanceGame::LipSyncRateA' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, LipSyncRateI) == 0x00039C, "Member 'UAnimInstanceGame::LipSyncRateI' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, LipSyncRateU) == 0x0003A0, "Member 'UAnimInstanceGame::LipSyncRateU' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, LipSyncRateE) == 0x0003A4, "Member 'UAnimInstanceGame::LipSyncRateE' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, LipSyncRateO) == 0x0003A8, "Member 'UAnimInstanceGame::LipSyncRateO' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, LipSyncRateN) == 0x0003AC, "Member 'UAnimInstanceGame::LipSyncRateN' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, bOutgame) == 0x0003B0, "Member 'UAnimInstanceGame::bOutgame' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, WalkGaitInterpSpeed) == 0x0003B4, "Member 'UAnimInstanceGame::WalkGaitInterpSpeed' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, LeanInterpSpeed) == 0x0003B8, "Member 'UAnimInstanceGame::LeanInterpSpeed' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, _slotData) == 0x0003C0, "Member 'UAnimInstanceGame::_slotData' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, _changedOutMontages) == 0x000410, "Member 'UAnimInstanceGame::_changedOutMontages' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, ThresholdEffectLOD_Windows) == 0x000440, "Member 'UAnimInstanceGame::ThresholdEffectLOD_Windows' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, ThresholdEffectLOD_PS4) == 0x000444, "Member 'UAnimInstanceGame::ThresholdEffectLOD_PS4' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, ThresholdEffectLOD_PS5) == 0x000448, "Member 'UAnimInstanceGame::ThresholdEffectLOD_PS5' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, ThresholdEffectLOD_XboxOne) == 0x00044C, "Member 'UAnimInstanceGame::ThresholdEffectLOD_XboxOne' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, ThresholdEffectLOD_Switch) == 0x000450, "Member 'UAnimInstanceGame::ThresholdEffectLOD_Switch' has a wrong offset!");
static_assert(offsetof(UAnimInstanceGame, ThresholdEffectLOD_Others) == 0x000454, "Member 'UAnimInstanceGame::ThresholdEffectLOD_Others' has a wrong offset!");

// Class GameModule.AnimInstancePostProcess
// 0x0000 (0x02C0 - 0x02C0)
class UAnimInstancePostProcess : public UAnimInstance
{
public:
	float                                         RHandHeadIkRate;                                   // 0x02B8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnResetAnimInstance();

	bool IsBaseCommon() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimInstancePostProcess">();
	}
	static class UAnimInstancePostProcess* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimInstancePostProcess>();
	}
};
static_assert(alignof(UAnimInstancePostProcess) == 0x000010, "Wrong alignment on UAnimInstancePostProcess");
static_assert(sizeof(UAnimInstancePostProcess) == 0x0002C0, "Wrong size on UAnimInstancePostProcess");
static_assert(offsetof(UAnimInstancePostProcess, RHandHeadIkRate) == 0x0002B8, "Member 'UAnimInstancePostProcess::RHandHeadIkRate' has a wrong offset!");

// Class GameModule.AnimResourcesWork
// 0x0140 (0x0170 - 0x0030)
class UAnimResourcesWork final : public UGameInstanceSubsystem
{
public:
	class UPrimaryAssetPermanent*                 _permanentAsset;                                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x138];                                     // 0x0038(0x0138)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimResourcesWork">();
	}
	static class UAnimResourcesWork* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimResourcesWork>();
	}
};
static_assert(alignof(UAnimResourcesWork) == 0x000008, "Wrong alignment on UAnimResourcesWork");
static_assert(sizeof(UAnimResourcesWork) == 0x000170, "Wrong size on UAnimResourcesWork");
static_assert(offsetof(UAnimResourcesWork, _permanentAsset) == 0x000030, "Member 'UAnimResourcesWork::_permanentAsset' has a wrong offset!");

// Class GameModule.ANS_MaterialSetScalarParam
// 0x0010 (0x0048 - 0x0038)
class UANS_MaterialSetScalarParam final : public UANS_CharacterBase
{
public:
	EMaterialGroupFlag                            _groupId;                                          // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   _paramName;                                        // 0x003C(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _value;                                            // 0x0044(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ANS_MaterialSetScalarParam">();
	}
	static class UANS_MaterialSetScalarParam* GetDefaultObj()
	{
		return GetDefaultObjImpl<UANS_MaterialSetScalarParam>();
	}
};
static_assert(alignof(UANS_MaterialSetScalarParam) == 0x000008, "Wrong alignment on UANS_MaterialSetScalarParam");
static_assert(sizeof(UANS_MaterialSetScalarParam) == 0x000048, "Wrong size on UANS_MaterialSetScalarParam");
static_assert(offsetof(UANS_MaterialSetScalarParam, _groupId) == 0x000038, "Member 'UANS_MaterialSetScalarParam::_groupId' has a wrong offset!");
static_assert(offsetof(UANS_MaterialSetScalarParam, _paramName) == 0x00003C, "Member 'UANS_MaterialSetScalarParam::_paramName' has a wrong offset!");
static_assert(offsetof(UANS_MaterialSetScalarParam, _value) == 0x000044, "Member 'UANS_MaterialSetScalarParam::_value' has a wrong offset!");

// Class GameModule.ANS_MaterialVisiblity
// 0x0058 (0x0090 - 0x0038)
class UANS_MaterialVisiblity final : public UANS_CharacterBase
{
public:
	TMap<EMaterialHideFlag, bool>                 _visibleList;                                      // 0x0038(0x0050)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          _bContinue;                                        // 0x0088(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bInGameOnly;                                      // 0x0089(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bOutGameOnly;                                     // 0x008A(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ANS_MaterialVisiblity">();
	}
	static class UANS_MaterialVisiblity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UANS_MaterialVisiblity>();
	}
};
static_assert(alignof(UANS_MaterialVisiblity) == 0x000008, "Wrong alignment on UANS_MaterialVisiblity");
static_assert(sizeof(UANS_MaterialVisiblity) == 0x000090, "Wrong size on UANS_MaterialVisiblity");
static_assert(offsetof(UANS_MaterialVisiblity, _visibleList) == 0x000038, "Member 'UANS_MaterialVisiblity::_visibleList' has a wrong offset!");
static_assert(offsetof(UANS_MaterialVisiblity, _bContinue) == 0x000088, "Member 'UANS_MaterialVisiblity::_bContinue' has a wrong offset!");
static_assert(offsetof(UANS_MaterialVisiblity, _bInGameOnly) == 0x000089, "Member 'UANS_MaterialVisiblity::_bInGameOnly' has a wrong offset!");
static_assert(offsetof(UANS_MaterialVisiblity, _bOutGameOnly) == 0x00008A, "Member 'UANS_MaterialVisiblity::_bOutGameOnly' has a wrong offset!");

// Class GameModule.AsyncSaveGameOption
// 0x0060 (0x0090 - 0x0030)
class UAsyncSaveGameOption final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             _onAsyncSaveFinishedTaskThread;                    // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             _onAsyncSaveFailedTaskThread;                      // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             _onAsyncSaveFinishedMainThread;                    // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             _onAsyncSaveFailedMainThread;                      // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
