#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameModule

#include "Basic.hpp"

#include "BackendSubsystem_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonModule_structs.hpp"
#include "GameModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UIFramework_structs.hpp"
#include "InputCore_structs.hpp"
#include "BykingUnrealModule_structs.hpp"
#include "MasterDataModule_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "DevelopMenu_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function GameModule.AchievementWork.OnAddItem
// 0x0490 (0x0490 - 0x0000)
struct AchievementWork_OnAddItem final
{
public:
	struct FDbItemCategoryParam                   Item;                                              // 0x0000(0x0488)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Quantity;                                          // 0x0488(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AchievementWork_OnAddItem) == 0x000008, "Wrong alignment on AchievementWork_OnAddItem");
static_assert(sizeof(AchievementWork_OnAddItem) == 0x000490, "Wrong size on AchievementWork_OnAddItem");
static_assert(offsetof(AchievementWork_OnAddItem, Item) == 0x000000, "Member 'AchievementWork_OnAddItem::Item' has a wrong offset!");
static_assert(offsetof(AchievementWork_OnAddItem, Quantity) == 0x000488, "Member 'AchievementWork_OnAddItem::Quantity' has a wrong offset!");

// Function GameModule.AchievementWork.SetSendLike
// 0x0004 (0x0004 - 0x0000)
struct AchievementWork_SetSendLike final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AchievementWork_SetSendLike) == 0x000004, "Wrong alignment on AchievementWork_SetSendLike");
static_assert(sizeof(AchievementWork_SetSendLike) == 0x000004, "Wrong size on AchievementWork_SetSendLike");
static_assert(offsetof(AchievementWork_SetSendLike, Count) == 0x000000, "Member 'AchievementWork_SetSendLike::Count' has a wrong offset!");

// Function GameModule.AdjustTextWidget.BP_GetFont
// 0x0058 (0x0058 - 0x0000)
struct AdjustTextWidget_BP_GetFont final
{
public:
	struct FSlateFontInfo                         ReturnValue;                                       // 0x0000(0x0058)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdjustTextWidget_BP_GetFont) == 0x000008, "Wrong alignment on AdjustTextWidget_BP_GetFont");
static_assert(sizeof(AdjustTextWidget_BP_GetFont) == 0x000058, "Wrong size on AdjustTextWidget_BP_GetFont");
static_assert(offsetof(AdjustTextWidget_BP_GetFont, ReturnValue) == 0x000000, "Member 'AdjustTextWidget_BP_GetFont::ReturnValue' has a wrong offset!");

// Function GameModule.AdjustTextWidget.BP_GetText
// 0x0018 (0x0018 - 0x0000)
struct AdjustTextWidget_BP_GetText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdjustTextWidget_BP_GetText) == 0x000008, "Wrong alignment on AdjustTextWidget_BP_GetText");
static_assert(sizeof(AdjustTextWidget_BP_GetText) == 0x000018, "Wrong size on AdjustTextWidget_BP_GetText");
static_assert(offsetof(AdjustTextWidget_BP_GetText, ReturnValue) == 0x000000, "Member 'AdjustTextWidget_BP_GetText::ReturnValue' has a wrong offset!");

// Function GameModule.AdjustTextWidget.BP_SetFont
// 0x0058 (0x0058 - 0x0000)
struct AdjustTextWidget_BP_SetFont final
{
public:
	struct FSlateFontInfo                         Font;                                              // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdjustTextWidget_BP_SetFont) == 0x000008, "Wrong alignment on AdjustTextWidget_BP_SetFont");
static_assert(sizeof(AdjustTextWidget_BP_SetFont) == 0x000058, "Wrong size on AdjustTextWidget_BP_SetFont");
static_assert(offsetof(AdjustTextWidget_BP_SetFont, Font) == 0x000000, "Member 'AdjustTextWidget_BP_SetFont::Font' has a wrong offset!");

// Function GameModule.AdjustTextWidget.BP_SetJustification
// 0x0001 (0x0001 - 0x0000)
struct AdjustTextWidget_BP_SetJustification final
{
public:
	ETextJustify                                  Justification;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdjustTextWidget_BP_SetJustification) == 0x000001, "Wrong alignment on AdjustTextWidget_BP_SetJustification");
static_assert(sizeof(AdjustTextWidget_BP_SetJustification) == 0x000001, "Wrong size on AdjustTextWidget_BP_SetJustification");
static_assert(offsetof(AdjustTextWidget_BP_SetJustification, Justification) == 0x000000, "Member 'AdjustTextWidget_BP_SetJustification::Justification' has a wrong offset!");

// Function GameModule.AdjustTextWidget.BP_SetLineBreak
// 0x0001 (0x0001 - 0x0000)
struct AdjustTextWidget_BP_SetLineBreak final
{
public:
	bool                                          LineBreak;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdjustTextWidget_BP_SetLineBreak) == 0x000001, "Wrong alignment on AdjustTextWidget_BP_SetLineBreak");
static_assert(sizeof(AdjustTextWidget_BP_SetLineBreak) == 0x000001, "Wrong size on AdjustTextWidget_BP_SetLineBreak");
static_assert(offsetof(AdjustTextWidget_BP_SetLineBreak, LineBreak) == 0x000000, "Member 'AdjustTextWidget_BP_SetLineBreak::LineBreak' has a wrong offset!");

// Function GameModule.AdjustTextWidget.BP_SetText
// 0x0018 (0x0018 - 0x0000)
struct AdjustTextWidget_BP_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdjustTextWidget_BP_SetText) == 0x000008, "Wrong alignment on AdjustTextWidget_BP_SetText");
static_assert(sizeof(AdjustTextWidget_BP_SetText) == 0x000018, "Wrong size on AdjustTextWidget_BP_SetText");
static_assert(offsetof(AdjustTextWidget_BP_SetText, Text) == 0x000000, "Member 'AdjustTextWidget_BP_SetText::Text' has a wrong offset!");

// Function GameModule.AdjustTextWidget.BP_SetTextColorAndOpacity
// 0x0028 (0x0028 - 0x0000)
struct AdjustTextWidget_BP_SetTextColorAndOpacity final
{
public:
	struct FSlateColor                            InColorAndOpacity;                                 // 0x0000(0x0028)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdjustTextWidget_BP_SetTextColorAndOpacity) == 0x000008, "Wrong alignment on AdjustTextWidget_BP_SetTextColorAndOpacity");
static_assert(sizeof(AdjustTextWidget_BP_SetTextColorAndOpacity) == 0x000028, "Wrong size on AdjustTextWidget_BP_SetTextColorAndOpacity");
static_assert(offsetof(AdjustTextWidget_BP_SetTextColorAndOpacity, InColorAndOpacity) == 0x000000, "Member 'AdjustTextWidget_BP_SetTextColorAndOpacity::InColorAndOpacity' has a wrong offset!");

// Function GameModule.Animation.BP_AnimationBlendingOutStartedDelegate
// 0x0014 (0x0014 - 0x0000)
struct Animation_BP_AnimationBlendingOutStartedDelegate final
{
public:
	TDelegate<void()>                             Delegate;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	EAnimationId                                  ID;                                                // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Animation_BP_AnimationBlendingOutStartedDelegate) == 0x000004, "Wrong alignment on Animation_BP_AnimationBlendingOutStartedDelegate");
static_assert(sizeof(Animation_BP_AnimationBlendingOutStartedDelegate) == 0x000014, "Wrong size on Animation_BP_AnimationBlendingOutStartedDelegate");
static_assert(offsetof(Animation_BP_AnimationBlendingOutStartedDelegate, Delegate) == 0x000000, "Member 'Animation_BP_AnimationBlendingOutStartedDelegate::Delegate' has a wrong offset!");
static_assert(offsetof(Animation_BP_AnimationBlendingOutStartedDelegate, ID) == 0x000010, "Member 'Animation_BP_AnimationBlendingOutStartedDelegate::ID' has a wrong offset!");

// Function GameModule.Animation.BP_AnimationEndedDelegate
// 0x0014 (0x0014 - 0x0000)
struct Animation_BP_AnimationEndedDelegate final
{
public:
	TDelegate<void()>                             Delegate;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	EAnimationId                                  ID;                                                // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Animation_BP_AnimationEndedDelegate) == 0x000004, "Wrong alignment on Animation_BP_AnimationEndedDelegate");
static_assert(sizeof(Animation_BP_AnimationEndedDelegate) == 0x000014, "Wrong size on Animation_BP_AnimationEndedDelegate");
static_assert(offsetof(Animation_BP_AnimationEndedDelegate, Delegate) == 0x000000, "Member 'Animation_BP_AnimationEndedDelegate::Delegate' has a wrong offset!");
static_assert(offsetof(Animation_BP_AnimationEndedDelegate, ID) == 0x000010, "Member 'Animation_BP_AnimationEndedDelegate::ID' has a wrong offset!");

// Function GameModule.Animation.BP_ChangeAnimationAsset
// 0x0028 (0x0028 - 0x0000)
struct Animation_BP_ChangeAnimationAsset final
{
public:
	ECharacterId                                  CharaID;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EAnimationId>                          SrcIds;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FName>                           DstIds;                                            // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_ChangeAnimationAsset) == 0x000008, "Wrong alignment on Animation_BP_ChangeAnimationAsset");
static_assert(sizeof(Animation_BP_ChangeAnimationAsset) == 0x000028, "Wrong size on Animation_BP_ChangeAnimationAsset");
static_assert(offsetof(Animation_BP_ChangeAnimationAsset, CharaID) == 0x000000, "Member 'Animation_BP_ChangeAnimationAsset::CharaID' has a wrong offset!");
static_assert(offsetof(Animation_BP_ChangeAnimationAsset, SrcIds) == 0x000008, "Member 'Animation_BP_ChangeAnimationAsset::SrcIds' has a wrong offset!");
static_assert(offsetof(Animation_BP_ChangeAnimationAsset, DstIds) == 0x000018, "Member 'Animation_BP_ChangeAnimationAsset::DstIds' has a wrong offset!");

// Function GameModule.Animation.BP_ChangeNagaraGuard
// 0x0001 (0x0001 - 0x0000)
struct Animation_BP_ChangeNagaraGuard final
{
public:
	ECharacterId                                  CharaID;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_ChangeNagaraGuard) == 0x000001, "Wrong alignment on Animation_BP_ChangeNagaraGuard");
static_assert(sizeof(Animation_BP_ChangeNagaraGuard) == 0x000001, "Wrong size on Animation_BP_ChangeNagaraGuard");
static_assert(offsetof(Animation_BP_ChangeNagaraGuard, CharaID) == 0x000000, "Member 'Animation_BP_ChangeNagaraGuard::CharaID' has a wrong offset!");

// Function GameModule.Animation.BP_ChangeNagaraOtherCharacter
// 0x0002 (0x0002 - 0x0000)
struct Animation_BP_ChangeNagaraOtherCharacter final
{
public:
	ECharacterId                                  CharaID;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         VariationNo;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_ChangeNagaraOtherCharacter) == 0x000001, "Wrong alignment on Animation_BP_ChangeNagaraOtherCharacter");
static_assert(sizeof(Animation_BP_ChangeNagaraOtherCharacter) == 0x000002, "Wrong size on Animation_BP_ChangeNagaraOtherCharacter");
static_assert(offsetof(Animation_BP_ChangeNagaraOtherCharacter, CharaID) == 0x000000, "Member 'Animation_BP_ChangeNagaraOtherCharacter::CharaID' has a wrong offset!");
static_assert(offsetof(Animation_BP_ChangeNagaraOtherCharacter, VariationNo) == 0x000001, "Member 'Animation_BP_ChangeNagaraOtherCharacter::VariationNo' has a wrong offset!");

// Function GameModule.Animation.BP_ChangeNagaraOtherUnique
// 0x0008 (0x0008 - 0x0000)
struct Animation_BP_ChangeNagaraOtherUnique final
{
public:
	int32                                         UniqueNo;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECharacterId                                  CharaID;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         VariationNo;                                       // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Animation_BP_ChangeNagaraOtherUnique) == 0x000004, "Wrong alignment on Animation_BP_ChangeNagaraOtherUnique");
static_assert(sizeof(Animation_BP_ChangeNagaraOtherUnique) == 0x000008, "Wrong size on Animation_BP_ChangeNagaraOtherUnique");
static_assert(offsetof(Animation_BP_ChangeNagaraOtherUnique, UniqueNo) == 0x000000, "Member 'Animation_BP_ChangeNagaraOtherUnique::UniqueNo' has a wrong offset!");
static_assert(offsetof(Animation_BP_ChangeNagaraOtherUnique, CharaID) == 0x000004, "Member 'Animation_BP_ChangeNagaraOtherUnique::CharaID' has a wrong offset!");
static_assert(offsetof(Animation_BP_ChangeNagaraOtherUnique, VariationNo) == 0x000005, "Member 'Animation_BP_ChangeNagaraOtherUnique::VariationNo' has a wrong offset!");

// Function GameModule.Animation.BP_ChangeUniqueOtherCharacter
// 0x0008 (0x0008 - 0x0000)
struct Animation_BP_ChangeUniqueOtherCharacter final
{
public:
	int32                                         UniqueNo;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECharacterId                                  CharaID;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         VariationNo;                                       // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Animation_BP_ChangeUniqueOtherCharacter) == 0x000004, "Wrong alignment on Animation_BP_ChangeUniqueOtherCharacter");
static_assert(sizeof(Animation_BP_ChangeUniqueOtherCharacter) == 0x000008, "Wrong size on Animation_BP_ChangeUniqueOtherCharacter");
static_assert(offsetof(Animation_BP_ChangeUniqueOtherCharacter, UniqueNo) == 0x000000, "Member 'Animation_BP_ChangeUniqueOtherCharacter::UniqueNo' has a wrong offset!");
static_assert(offsetof(Animation_BP_ChangeUniqueOtherCharacter, CharaID) == 0x000004, "Member 'Animation_BP_ChangeUniqueOtherCharacter::CharaID' has a wrong offset!");
static_assert(offsetof(Animation_BP_ChangeUniqueOtherCharacter, VariationNo) == 0x000005, "Member 'Animation_BP_ChangeUniqueOtherCharacter::VariationNo' has a wrong offset!");

// Function GameModule.Animation.BP_DisableAnimNotify
// 0x0004 (0x0004 - 0x0000)
struct Animation_BP_DisableAnimNotify final
{
public:
	int32                                         NotifyTypeFlags;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_DisableAnimNotify) == 0x000004, "Wrong alignment on Animation_BP_DisableAnimNotify");
static_assert(sizeof(Animation_BP_DisableAnimNotify) == 0x000004, "Wrong size on Animation_BP_DisableAnimNotify");
static_assert(offsetof(Animation_BP_DisableAnimNotify, NotifyTypeFlags) == 0x000000, "Member 'Animation_BP_DisableAnimNotify::NotifyTypeFlags' has a wrong offset!");

// Function GameModule.Animation.BP_DisableRootMotion
// 0x0002 (0x0002 - 0x0000)
struct Animation_BP_DisableRootMotion final
{
public:
	EAnimationSlot                                Slot;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisable;                                          // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_DisableRootMotion) == 0x000001, "Wrong alignment on Animation_BP_DisableRootMotion");
static_assert(sizeof(Animation_BP_DisableRootMotion) == 0x000002, "Wrong size on Animation_BP_DisableRootMotion");
static_assert(offsetof(Animation_BP_DisableRootMotion, Slot) == 0x000000, "Member 'Animation_BP_DisableRootMotion::Slot' has a wrong offset!");
static_assert(offsetof(Animation_BP_DisableRootMotion, bDisable) == 0x000001, "Member 'Animation_BP_DisableRootMotion::bDisable' has a wrong offset!");

// Function GameModule.Animation.BP_EmoteCodeToAnimIdName
// 0x000C (0x000C - 0x0000)
struct Animation_BP_EmoteCodeToAnimIdName final
{
public:
	int32                                         EmoteCode;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_EmoteCodeToAnimIdName) == 0x000004, "Wrong alignment on Animation_BP_EmoteCodeToAnimIdName");
static_assert(sizeof(Animation_BP_EmoteCodeToAnimIdName) == 0x00000C, "Wrong size on Animation_BP_EmoteCodeToAnimIdName");
static_assert(offsetof(Animation_BP_EmoteCodeToAnimIdName, EmoteCode) == 0x000000, "Member 'Animation_BP_EmoteCodeToAnimIdName::EmoteCode' has a wrong offset!");
static_assert(offsetof(Animation_BP_EmoteCodeToAnimIdName, ReturnValue) == 0x000004, "Member 'Animation_BP_EmoteCodeToAnimIdName::ReturnValue' has a wrong offset!");

// Function GameModule.Animation.BP_JumpToSection
// 0x000C (0x000C - 0x0000)
struct Animation_BP_JumpToSection final
{
public:
	class FName                                   SectionName;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnimationSlot                                Slot;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Animation_BP_JumpToSection) == 0x000004, "Wrong alignment on Animation_BP_JumpToSection");
static_assert(sizeof(Animation_BP_JumpToSection) == 0x00000C, "Wrong size on Animation_BP_JumpToSection");
static_assert(offsetof(Animation_BP_JumpToSection, SectionName) == 0x000000, "Member 'Animation_BP_JumpToSection::SectionName' has a wrong offset!");
static_assert(offsetof(Animation_BP_JumpToSection, Slot) == 0x000008, "Member 'Animation_BP_JumpToSection::Slot' has a wrong offset!");

// Function GameModule.Animation.BP_PlayAnimation
// 0x0010 (0x0010 - 0x0000)
struct Animation_BP_PlayAnimation final
{
public:
	EAnimationId                                  ID;                                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayRate;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNotReplay;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Animation_BP_PlayAnimation) == 0x000004, "Wrong alignment on Animation_BP_PlayAnimation");
static_assert(sizeof(Animation_BP_PlayAnimation) == 0x000010, "Wrong size on Animation_BP_PlayAnimation");
static_assert(offsetof(Animation_BP_PlayAnimation, ID) == 0x000000, "Member 'Animation_BP_PlayAnimation::ID' has a wrong offset!");
static_assert(offsetof(Animation_BP_PlayAnimation, PlayRate) == 0x000004, "Member 'Animation_BP_PlayAnimation::PlayRate' has a wrong offset!");
static_assert(offsetof(Animation_BP_PlayAnimation, BlendInTime) == 0x000008, "Member 'Animation_BP_PlayAnimation::BlendInTime' has a wrong offset!");
static_assert(offsetof(Animation_BP_PlayAnimation, bNotReplay) == 0x00000C, "Member 'Animation_BP_PlayAnimation::bNotReplay' has a wrong offset!");

// Function GameModule.Animation.BP_PlayAnimationAsync
// 0x001C (0x001C - 0x0000)
struct Animation_BP_PlayAnimationAsync final
{
public:
	ECharacterId                                  CharaID;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ID;                                                // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnimationSlot                                Slot;                                              // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayRate;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTime;                                      // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_PlayAnimationAsync) == 0x000004, "Wrong alignment on Animation_BP_PlayAnimationAsync");
static_assert(sizeof(Animation_BP_PlayAnimationAsync) == 0x00001C, "Wrong size on Animation_BP_PlayAnimationAsync");
static_assert(offsetof(Animation_BP_PlayAnimationAsync, CharaID) == 0x000000, "Member 'Animation_BP_PlayAnimationAsync::CharaID' has a wrong offset!");
static_assert(offsetof(Animation_BP_PlayAnimationAsync, ID) == 0x000004, "Member 'Animation_BP_PlayAnimationAsync::ID' has a wrong offset!");
static_assert(offsetof(Animation_BP_PlayAnimationAsync, Slot) == 0x00000C, "Member 'Animation_BP_PlayAnimationAsync::Slot' has a wrong offset!");
static_assert(offsetof(Animation_BP_PlayAnimationAsync, PlayRate) == 0x000010, "Member 'Animation_BP_PlayAnimationAsync::PlayRate' has a wrong offset!");
static_assert(offsetof(Animation_BP_PlayAnimationAsync, BlendInTime) == 0x000014, "Member 'Animation_BP_PlayAnimationAsync::BlendInTime' has a wrong offset!");
static_assert(offsetof(Animation_BP_PlayAnimationAsync, BlendOutTime) == 0x000018, "Member 'Animation_BP_PlayAnimationAsync::BlendOutTime' has a wrong offset!");

// Function GameModule.Animation.BP_PlayAnimationEmote
// 0x000C (0x000C - 0x0000)
struct Animation_BP_PlayAnimationEmote final
{
public:
	int32                                         EmoteCode;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayRate;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_PlayAnimationEmote) == 0x000004, "Wrong alignment on Animation_BP_PlayAnimationEmote");
static_assert(sizeof(Animation_BP_PlayAnimationEmote) == 0x00000C, "Wrong size on Animation_BP_PlayAnimationEmote");
static_assert(offsetof(Animation_BP_PlayAnimationEmote, EmoteCode) == 0x000000, "Member 'Animation_BP_PlayAnimationEmote::EmoteCode' has a wrong offset!");
static_assert(offsetof(Animation_BP_PlayAnimationEmote, PlayRate) == 0x000004, "Member 'Animation_BP_PlayAnimationEmote::PlayRate' has a wrong offset!");
static_assert(offsetof(Animation_BP_PlayAnimationEmote, BlendInTime) == 0x000008, "Member 'Animation_BP_PlayAnimationEmote::BlendInTime' has a wrong offset!");

// Function GameModule.Animation.BP_PlayAnimationFace
// 0x000C (0x000C - 0x0000)
struct Animation_BP_PlayAnimationFace final
{
public:
	EAnimationId                                  ID;                                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayRate;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_PlayAnimationFace) == 0x000004, "Wrong alignment on Animation_BP_PlayAnimationFace");
static_assert(sizeof(Animation_BP_PlayAnimationFace) == 0x00000C, "Wrong size on Animation_BP_PlayAnimationFace");
static_assert(offsetof(Animation_BP_PlayAnimationFace, ID) == 0x000000, "Member 'Animation_BP_PlayAnimationFace::ID' has a wrong offset!");
static_assert(offsetof(Animation_BP_PlayAnimationFace, PlayRate) == 0x000004, "Member 'Animation_BP_PlayAnimationFace::PlayRate' has a wrong offset!");
static_assert(offsetof(Animation_BP_PlayAnimationFace, BlendInTime) == 0x000008, "Member 'Animation_BP_PlayAnimationFace::BlendInTime' has a wrong offset!");

// Function GameModule.Animation.BP_PlayAnimationNagara
// 0x000C (0x000C - 0x0000)
struct Animation_BP_PlayAnimationNagara final
{
public:
	EAnimationId                                  ID;                                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayRate;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_PlayAnimationNagara) == 0x000004, "Wrong alignment on Animation_BP_PlayAnimationNagara");
static_assert(sizeof(Animation_BP_PlayAnimationNagara) == 0x00000C, "Wrong size on Animation_BP_PlayAnimationNagara");
static_assert(offsetof(Animation_BP_PlayAnimationNagara, ID) == 0x000000, "Member 'Animation_BP_PlayAnimationNagara::ID' has a wrong offset!");
static_assert(offsetof(Animation_BP_PlayAnimationNagara, PlayRate) == 0x000004, "Member 'Animation_BP_PlayAnimationNagara::PlayRate' has a wrong offset!");
static_assert(offsetof(Animation_BP_PlayAnimationNagara, BlendInTime) == 0x000008, "Member 'Animation_BP_PlayAnimationNagara::BlendInTime' has a wrong offset!");

// Function GameModule.Animation.BP_PlayAnimationNagaraDamage
// 0x000C (0x000C - 0x0000)
struct Animation_BP_PlayAnimationNagaraDamage final
{
public:
	EAnimationId                                  ID;                                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayRate;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_PlayAnimationNagaraDamage) == 0x000004, "Wrong alignment on Animation_BP_PlayAnimationNagaraDamage");
static_assert(sizeof(Animation_BP_PlayAnimationNagaraDamage) == 0x00000C, "Wrong size on Animation_BP_PlayAnimationNagaraDamage");
static_assert(offsetof(Animation_BP_PlayAnimationNagaraDamage, ID) == 0x000000, "Member 'Animation_BP_PlayAnimationNagaraDamage::ID' has a wrong offset!");
static_assert(offsetof(Animation_BP_PlayAnimationNagaraDamage, PlayRate) == 0x000004, "Member 'Animation_BP_PlayAnimationNagaraDamage::PlayRate' has a wrong offset!");
static_assert(offsetof(Animation_BP_PlayAnimationNagaraDamage, BlendInTime) == 0x000008, "Member 'Animation_BP_PlayAnimationNagaraDamage::BlendInTime' has a wrong offset!");

// Function GameModule.Animation.BP_PlayAnimationNagaraGuard
// 0x000C (0x000C - 0x0000)
struct Animation_BP_PlayAnimationNagaraGuard final
{
public:
	EAnimationId                                  ID;                                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayRate;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_PlayAnimationNagaraGuard) == 0x000004, "Wrong alignment on Animation_BP_PlayAnimationNagaraGuard");
static_assert(sizeof(Animation_BP_PlayAnimationNagaraGuard) == 0x00000C, "Wrong size on Animation_BP_PlayAnimationNagaraGuard");
static_assert(offsetof(Animation_BP_PlayAnimationNagaraGuard, ID) == 0x000000, "Member 'Animation_BP_PlayAnimationNagaraGuard::ID' has a wrong offset!");
static_assert(offsetof(Animation_BP_PlayAnimationNagaraGuard, PlayRate) == 0x000004, "Member 'Animation_BP_PlayAnimationNagaraGuard::PlayRate' has a wrong offset!");
static_assert(offsetof(Animation_BP_PlayAnimationNagaraGuard, BlendInTime) == 0x000008, "Member 'Animation_BP_PlayAnimationNagaraGuard::BlendInTime' has a wrong offset!");

// Function GameModule.Animation.BP_PlayAnimationReplicate
// 0x0008 (0x0008 - 0x0000)
struct Animation_BP_PlayAnimationReplicate final
{
public:
	EAnimationId                                  ID;                                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnimationSlot                                Slot;                                              // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayRate;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_PlayAnimationReplicate) == 0x000004, "Wrong alignment on Animation_BP_PlayAnimationReplicate");
static_assert(sizeof(Animation_BP_PlayAnimationReplicate) == 0x000008, "Wrong size on Animation_BP_PlayAnimationReplicate");
static_assert(offsetof(Animation_BP_PlayAnimationReplicate, ID) == 0x000000, "Member 'Animation_BP_PlayAnimationReplicate::ID' has a wrong offset!");
static_assert(offsetof(Animation_BP_PlayAnimationReplicate, Slot) == 0x000001, "Member 'Animation_BP_PlayAnimationReplicate::Slot' has a wrong offset!");
static_assert(offsetof(Animation_BP_PlayAnimationReplicate, PlayRate) == 0x000004, "Member 'Animation_BP_PlayAnimationReplicate::PlayRate' has a wrong offset!");

// Function GameModule.Animation.BP_ResetDynamics
// 0x0008 (0x0008 - 0x0000)
struct Animation_BP_ResetDynamics final
{
public:
	ETeleportType                                 TeleportType;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Duration;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_ResetDynamics) == 0x000004, "Wrong alignment on Animation_BP_ResetDynamics");
static_assert(sizeof(Animation_BP_ResetDynamics) == 0x000008, "Wrong size on Animation_BP_ResetDynamics");
static_assert(offsetof(Animation_BP_ResetDynamics, TeleportType) == 0x000000, "Member 'Animation_BP_ResetDynamics::TeleportType' has a wrong offset!");
static_assert(offsetof(Animation_BP_ResetDynamics, Duration) == 0x000004, "Member 'Animation_BP_ResetDynamics::Duration' has a wrong offset!");

// Function GameModule.Animation.BP_SetAimingRate
// 0x0008 (0x0008 - 0x0000)
struct Animation_BP_SetAimingRate final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendTime;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_SetAimingRate) == 0x000004, "Wrong alignment on Animation_BP_SetAimingRate");
static_assert(sizeof(Animation_BP_SetAimingRate) == 0x000008, "Wrong size on Animation_BP_SetAimingRate");
static_assert(offsetof(Animation_BP_SetAimingRate, Rate) == 0x000000, "Member 'Animation_BP_SetAimingRate::Rate' has a wrong offset!");
static_assert(offsetof(Animation_BP_SetAimingRate, BlendTime) == 0x000004, "Member 'Animation_BP_SetAimingRate::BlendTime' has a wrong offset!");

// Function GameModule.Animation.BP_SetAimTargetLocation
// 0x000C (0x000C - 0x0000)
struct Animation_BP_SetAimTargetLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_SetAimTargetLocation) == 0x000004, "Wrong alignment on Animation_BP_SetAimTargetLocation");
static_assert(sizeof(Animation_BP_SetAimTargetLocation) == 0x00000C, "Wrong size on Animation_BP_SetAimTargetLocation");
static_assert(offsetof(Animation_BP_SetAimTargetLocation, Location) == 0x000000, "Member 'Animation_BP_SetAimTargetLocation::Location' has a wrong offset!");

// Function GameModule.Animation.BP_SetAnimationSpeedRate
// 0x0004 (0x0004 - 0x0000)
struct Animation_BP_SetAnimationSpeedRate final
{
public:
	float                                         Speed;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_SetAnimationSpeedRate) == 0x000004, "Wrong alignment on Animation_BP_SetAnimationSpeedRate");
static_assert(sizeof(Animation_BP_SetAnimationSpeedRate) == 0x000004, "Wrong size on Animation_BP_SetAnimationSpeedRate");
static_assert(offsetof(Animation_BP_SetAnimationSpeedRate, Speed) == 0x000000, "Member 'Animation_BP_SetAnimationSpeedRate::Speed' has a wrong offset!");

// Function GameModule.Animation.BP_SetCenterRotationOffset
// 0x000C (0x000C - 0x0000)
struct Animation_BP_SetCenterRotationOffset final
{
public:
	struct FRotator                               Rot;                                               // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_SetCenterRotationOffset) == 0x000004, "Wrong alignment on Animation_BP_SetCenterRotationOffset");
static_assert(sizeof(Animation_BP_SetCenterRotationOffset) == 0x00000C, "Wrong size on Animation_BP_SetCenterRotationOffset");
static_assert(offsetof(Animation_BP_SetCenterRotationOffset, Rot) == 0x000000, "Member 'Animation_BP_SetCenterRotationOffset::Rot' has a wrong offset!");

// Function GameModule.Animation.BP_SetCenterTransOffset
// 0x000C (0x000C - 0x0000)
struct Animation_BP_SetCenterTransOffset final
{
public:
	struct FVector                                Offset;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_SetCenterTransOffset) == 0x000004, "Wrong alignment on Animation_BP_SetCenterTransOffset");
static_assert(sizeof(Animation_BP_SetCenterTransOffset) == 0x00000C, "Wrong size on Animation_BP_SetCenterTransOffset");
static_assert(offsetof(Animation_BP_SetCenterTransOffset, Offset) == 0x000000, "Member 'Animation_BP_SetCenterTransOffset::Offset' has a wrong offset!");

// Function GameModule.Animation.BP_SetCurrentPlayPosition
// 0x0008 (0x0008 - 0x0000)
struct Animation_BP_SetCurrentPlayPosition final
{
public:
	EAnimationSlot                                Slot;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Position;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_SetCurrentPlayPosition) == 0x000004, "Wrong alignment on Animation_BP_SetCurrentPlayPosition");
static_assert(sizeof(Animation_BP_SetCurrentPlayPosition) == 0x000008, "Wrong size on Animation_BP_SetCurrentPlayPosition");
static_assert(offsetof(Animation_BP_SetCurrentPlayPosition, Slot) == 0x000000, "Member 'Animation_BP_SetCurrentPlayPosition::Slot' has a wrong offset!");
static_assert(offsetof(Animation_BP_SetCurrentPlayPosition, Position) == 0x000004, "Member 'Animation_BP_SetCurrentPlayPosition::Position' has a wrong offset!");

// Function GameModule.Animation.BP_SetFaceAimingRate
// 0x0008 (0x0008 - 0x0000)
struct Animation_BP_SetFaceAimingRate final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendTime;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_SetFaceAimingRate) == 0x000004, "Wrong alignment on Animation_BP_SetFaceAimingRate");
static_assert(sizeof(Animation_BP_SetFaceAimingRate) == 0x000008, "Wrong size on Animation_BP_SetFaceAimingRate");
static_assert(offsetof(Animation_BP_SetFaceAimingRate, Rate) == 0x000000, "Member 'Animation_BP_SetFaceAimingRate::Rate' has a wrong offset!");
static_assert(offsetof(Animation_BP_SetFaceAimingRate, BlendTime) == 0x000004, "Member 'Animation_BP_SetFaceAimingRate::BlendTime' has a wrong offset!");

// Function GameModule.Animation.BP_SetFaceDamageOneShot
// 0x0014 (0x0014 - 0x0000)
struct Animation_BP_SetFaceDamageOneShot final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Rate;                                              // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendTime;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_SetFaceDamageOneShot) == 0x000004, "Wrong alignment on Animation_BP_SetFaceDamageOneShot");
static_assert(sizeof(Animation_BP_SetFaceDamageOneShot) == 0x000014, "Wrong size on Animation_BP_SetFaceDamageOneShot");
static_assert(offsetof(Animation_BP_SetFaceDamageOneShot, Location) == 0x000000, "Member 'Animation_BP_SetFaceDamageOneShot::Location' has a wrong offset!");
static_assert(offsetof(Animation_BP_SetFaceDamageOneShot, Rate) == 0x00000C, "Member 'Animation_BP_SetFaceDamageOneShot::Rate' has a wrong offset!");
static_assert(offsetof(Animation_BP_SetFaceDamageOneShot, BlendTime) == 0x000010, "Member 'Animation_BP_SetFaceDamageOneShot::BlendTime' has a wrong offset!");

// Function GameModule.Animation.BP_SetLeanRate
// 0x0008 (0x0008 - 0x0000)
struct Animation_BP_SetLeanRate final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSpeed;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_SetLeanRate) == 0x000004, "Wrong alignment on Animation_BP_SetLeanRate");
static_assert(sizeof(Animation_BP_SetLeanRate) == 0x000008, "Wrong size on Animation_BP_SetLeanRate");
static_assert(offsetof(Animation_BP_SetLeanRate, Rate) == 0x000000, "Member 'Animation_BP_SetLeanRate::Rate' has a wrong offset!");
static_assert(offsetof(Animation_BP_SetLeanRate, MaxSpeed) == 0x000004, "Member 'Animation_BP_SetLeanRate::MaxSpeed' has a wrong offset!");

// Function GameModule.Animation.BP_SetMoveType
// 0x0001 (0x0001 - 0x0000)
struct Animation_BP_SetMoveType final
{
public:
	EAnimationMoveType                            Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_SetMoveType) == 0x000001, "Wrong alignment on Animation_BP_SetMoveType");
static_assert(sizeof(Animation_BP_SetMoveType) == 0x000001, "Wrong size on Animation_BP_SetMoveType");
static_assert(offsetof(Animation_BP_SetMoveType, Type) == 0x000000, "Member 'Animation_BP_SetMoveType::Type' has a wrong offset!");

// Function GameModule.Animation.BP_SetPlayRate
// 0x0008 (0x0008 - 0x0000)
struct Animation_BP_SetPlayRate final
{
public:
	EAnimationSlot                                Slot;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayRate;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_SetPlayRate) == 0x000004, "Wrong alignment on Animation_BP_SetPlayRate");
static_assert(sizeof(Animation_BP_SetPlayRate) == 0x000008, "Wrong size on Animation_BP_SetPlayRate");
static_assert(offsetof(Animation_BP_SetPlayRate, Slot) == 0x000000, "Member 'Animation_BP_SetPlayRate::Slot' has a wrong offset!");
static_assert(offsetof(Animation_BP_SetPlayRate, PlayRate) == 0x000004, "Member 'Animation_BP_SetPlayRate::PlayRate' has a wrong offset!");

// Function GameModule.Animation.BP_SetRunMoveDistance
// 0x0004 (0x0004 - 0x0000)
struct Animation_BP_SetRunMoveDistance final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_SetRunMoveDistance) == 0x000004, "Wrong alignment on Animation_BP_SetRunMoveDistance");
static_assert(sizeof(Animation_BP_SetRunMoveDistance) == 0x000004, "Wrong size on Animation_BP_SetRunMoveDistance");
static_assert(offsetof(Animation_BP_SetRunMoveDistance, Distance) == 0x000000, "Member 'Animation_BP_SetRunMoveDistance::Distance' has a wrong offset!");

// Function GameModule.Animation.BP_SetWalkMoveDistance
// 0x0004 (0x0004 - 0x0000)
struct Animation_BP_SetWalkMoveDistance final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_SetWalkMoveDistance) == 0x000004, "Wrong alignment on Animation_BP_SetWalkMoveDistance");
static_assert(sizeof(Animation_BP_SetWalkMoveDistance) == 0x000004, "Wrong size on Animation_BP_SetWalkMoveDistance");
static_assert(offsetof(Animation_BP_SetWalkMoveDistance, Distance) == 0x000000, "Member 'Animation_BP_SetWalkMoveDistance::Distance' has a wrong offset!");

// Function GameModule.Animation.BP_SetWholeAimingRate
// 0x0008 (0x0008 - 0x0000)
struct Animation_BP_SetWholeAimingRate final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendTime;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_SetWholeAimingRate) == 0x000004, "Wrong alignment on Animation_BP_SetWholeAimingRate");
static_assert(sizeof(Animation_BP_SetWholeAimingRate) == 0x000008, "Wrong size on Animation_BP_SetWholeAimingRate");
static_assert(offsetof(Animation_BP_SetWholeAimingRate, Rate) == 0x000000, "Member 'Animation_BP_SetWholeAimingRate::Rate' has a wrong offset!");
static_assert(offsetof(Animation_BP_SetWholeAimingRate, BlendTime) == 0x000004, "Member 'Animation_BP_SetWholeAimingRate::BlendTime' has a wrong offset!");

// Function GameModule.Animation.BP_StopAnimation
// 0x0008 (0x0008 - 0x0000)
struct Animation_BP_StopAnimation final
{
public:
	EAnimationSlot                                Slot;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendOutTime;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_StopAnimation) == 0x000004, "Wrong alignment on Animation_BP_StopAnimation");
static_assert(sizeof(Animation_BP_StopAnimation) == 0x000008, "Wrong size on Animation_BP_StopAnimation");
static_assert(offsetof(Animation_BP_StopAnimation, Slot) == 0x000000, "Member 'Animation_BP_StopAnimation::Slot' has a wrong offset!");
static_assert(offsetof(Animation_BP_StopAnimation, BlendOutTime) == 0x000004, "Member 'Animation_BP_StopAnimation::BlendOutTime' has a wrong offset!");

// Function GameModule.Animation.OnMontageBlendingOutStarted
// 0x0010 (0x0010 - 0x0000)
struct Animation_OnMontageBlendingOutStarted final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Animation_OnMontageBlendingOutStarted) == 0x000008, "Wrong alignment on Animation_OnMontageBlendingOutStarted");
static_assert(sizeof(Animation_OnMontageBlendingOutStarted) == 0x000010, "Wrong size on Animation_OnMontageBlendingOutStarted");
static_assert(offsetof(Animation_OnMontageBlendingOutStarted, Montage) == 0x000000, "Member 'Animation_OnMontageBlendingOutStarted::Montage' has a wrong offset!");
static_assert(offsetof(Animation_OnMontageBlendingOutStarted, bInterrupted) == 0x000008, "Member 'Animation_OnMontageBlendingOutStarted::bInterrupted' has a wrong offset!");

// Function GameModule.Animation.OnMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct Animation_OnMontageEnded final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Animation_OnMontageEnded) == 0x000008, "Wrong alignment on Animation_OnMontageEnded");
static_assert(sizeof(Animation_OnMontageEnded) == 0x000010, "Wrong size on Animation_OnMontageEnded");
static_assert(offsetof(Animation_OnMontageEnded, Montage) == 0x000000, "Member 'Animation_OnMontageEnded::Montage' has a wrong offset!");
static_assert(offsetof(Animation_OnMontageEnded, bInterrupted) == 0x000008, "Member 'Animation_OnMontageEnded::bInterrupted' has a wrong offset!");

// Function GameModule.Animation.OnMontageStarted
// 0x0008 (0x0008 - 0x0000)
struct Animation_OnMontageStarted final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_OnMontageStarted) == 0x000008, "Wrong alignment on Animation_OnMontageStarted");
static_assert(sizeof(Animation_OnMontageStarted) == 0x000008, "Wrong size on Animation_OnMontageStarted");
static_assert(offsetof(Animation_OnMontageStarted, Montage) == 0x000000, "Member 'Animation_OnMontageStarted::Montage' has a wrong offset!");

// Function GameModule.Animation.ServerPlayAnimation
// 0x0004 (0x0004 - 0x0000)
struct Animation_ServerPlayAnimation final
{
public:
	struct FAnimationPlayParams                   Param;                                             // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_ServerPlayAnimation) == 0x000002, "Wrong alignment on Animation_ServerPlayAnimation");
static_assert(sizeof(Animation_ServerPlayAnimation) == 0x000004, "Wrong size on Animation_ServerPlayAnimation");
static_assert(offsetof(Animation_ServerPlayAnimation, Param) == 0x000000, "Member 'Animation_ServerPlayAnimation::Param' has a wrong offset!");

// Function GameModule.Animation.BP_GetCurrentAnimationId
// 0x0002 (0x0002 - 0x0000)
struct Animation_BP_GetCurrentAnimationId final
{
public:
	EAnimationSlot                                Slot;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnimationId                                  ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_GetCurrentAnimationId) == 0x000001, "Wrong alignment on Animation_BP_GetCurrentAnimationId");
static_assert(sizeof(Animation_BP_GetCurrentAnimationId) == 0x000002, "Wrong size on Animation_BP_GetCurrentAnimationId");
static_assert(offsetof(Animation_BP_GetCurrentAnimationId, Slot) == 0x000000, "Member 'Animation_BP_GetCurrentAnimationId::Slot' has a wrong offset!");
static_assert(offsetof(Animation_BP_GetCurrentAnimationId, ReturnValue) == 0x000001, "Member 'Animation_BP_GetCurrentAnimationId::ReturnValue' has a wrong offset!");

// Function GameModule.Animation.BP_GetCurrentPlayLength
// 0x0008 (0x0008 - 0x0000)
struct Animation_BP_GetCurrentPlayLength final
{
public:
	EAnimationSlot                                Slot;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Animation_BP_GetCurrentPlayLength) == 0x000004, "Wrong alignment on Animation_BP_GetCurrentPlayLength");
static_assert(sizeof(Animation_BP_GetCurrentPlayLength) == 0x000008, "Wrong size on Animation_BP_GetCurrentPlayLength");
static_assert(offsetof(Animation_BP_GetCurrentPlayLength, Slot) == 0x000000, "Member 'Animation_BP_GetCurrentPlayLength::Slot' has a wrong offset!");
static_assert(offsetof(Animation_BP_GetCurrentPlayLength, ReturnValue) == 0x000004, "Member 'Animation_BP_GetCurrentPlayLength::ReturnValue' has a wrong offset!");

// Function GameModule.Animation.BP_GetCurrentPlayPosition
// 0x0008 (0x0008 - 0x0000)
struct Animation_BP_GetCurrentPlayPosition final
{
public:
