#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InGameModule

#include "Basic.hpp"

#include "ReplicationGraph_structs.hpp"
#include "ReplicationGraph_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CommonModule_structs.hpp"
#include "GameModule_structs.hpp"
#include "GameModule_classes.hpp"
#include "MasterDataModule_structs.hpp"
#include "UIFramework_structs.hpp"
#include "UIFramework_classes.hpp"
#include "InGameModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "BykingUnrealModule_structs.hpp"
#include "BykingUnrealModule_classes.hpp"
#include "NavigationSystem_classes.hpp"
#include "CriWareRuntime_classes.hpp"
#include "ActionCamera_classes.hpp"
#include "Slate_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "AIModule_classes.hpp"
#include "PhysicsCore_classes.hpp"


namespace SDK
{

// Class InGameModule.DogTagManagerComponent
// 0x0068 (0x0118 - 0x00B0)
class UDogTagManagerComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B0[0x68];                                      // 0x00B0(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ConsumeDogTag_ToClient(class APlayerStateBattle* PlayerState);
	void ConsumeDogTag_ToServer(class APlayerStateBattle* PlayerState);
	void LockDogTag_ToClient(uint8 TeamId, int16 PlayrId);
	void LockDogTag_ToServer(uint8 TeamId, int16 PlayrId);
	void OnPickupDogTag_ToClient(uint8 TeamId, int16 PlayerId);
	void OnPickupDogTag_ToServer(uint8 TeamId, int16 PlayerId);
	void UnlockDogTag_ToClient(uint8 TeamId, int16 PlayrId);
	void UnlockDogTag_ToServer(uint8 TeamId, int16 PlayrId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DogTagManagerComponent">();
	}
	static class UDogTagManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDogTagManagerComponent>();
	}
};
static_assert(alignof(UDogTagManagerComponent) == 0x000008, "Wrong alignment on UDogTagManagerComponent");
static_assert(sizeof(UDogTagManagerComponent) == 0x000118, "Wrong size on UDogTagManagerComponent");

// Class InGameModule.AN_BattleBase
// 0x0000 (0x0040 - 0x0040)
class UAN_BattleBase : public UAN_CharacterBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AN_BattleBase">();
	}
	static class UAN_BattleBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAN_BattleBase>();
	}
};
static_assert(alignof(UAN_BattleBase) == 0x000008, "Wrong alignment on UAN_BattleBase");
static_assert(sizeof(UAN_BattleBase) == 0x000040, "Wrong size on UAN_BattleBase");

// Class InGameModule.AN_AttackSetSpeedV
// 0x0010 (0x0050 - 0x0040)
class UAN_AttackSetSpeedV final : public UAN_BattleBase
{
public:
	float                                         _initialSpeed;                                     // 0x0040(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _lastSpeed;                                        // 0x0044(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _span;                                             // 0x0048(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _useCurrentSpeed;                                  // 0x004C(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AN_AttackSetSpeedV">();
	}
	static class UAN_AttackSetSpeedV* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAN_AttackSetSpeedV>();
	}
};
static_assert(alignof(UAN_AttackSetSpeedV) == 0x000008, "Wrong alignment on UAN_AttackSetSpeedV");
static_assert(sizeof(UAN_AttackSetSpeedV) == 0x000050, "Wrong size on UAN_AttackSetSpeedV");
static_assert(offsetof(UAN_AttackSetSpeedV, _initialSpeed) == 0x000040, "Member 'UAN_AttackSetSpeedV::_initialSpeed' has a wrong offset!");
static_assert(offsetof(UAN_AttackSetSpeedV, _lastSpeed) == 0x000044, "Member 'UAN_AttackSetSpeedV::_lastSpeed' has a wrong offset!");
static_assert(offsetof(UAN_AttackSetSpeedV, _span) == 0x000048, "Member 'UAN_AttackSetSpeedV::_span' has a wrong offset!");
static_assert(offsetof(UAN_AttackSetSpeedV, _useCurrentSpeed) == 0x00004C, "Member 'UAN_AttackSetSpeedV::_useCurrentSpeed' has a wrong offset!");

// Class InGameModule.PlayerControllerBattle
// 0x0388 (0x0998 - 0x0610)
class APlayerControllerBattle : public APlayerControllerGame
{
public:
	uint8                                         Pad_610[0x38];                                     // 0x0610(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  _OriginalPawn;                                     // 0x0648(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_650[0xF8];                                     // 0x0650(0x00F8)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraShaker*                          CameraShacker;                                     // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_750[0xE0];                                     // 0x0750(0x00E0)(Fixing Size After Last Property [ Dumper-7 ])
	class UHudCommandControlComponent*            _commandHudComponent;                              // 0x0830(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULocalPlayerHudManager*                 _localPlayerHudManager;                            // 0x0838(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUISubsystemComponent*                  _uiSubsystemComponent;                             // 0x0840(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWinDemoControllerComponent*            _winDemoController;                                // 0x0848(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULevelStreamingDynamic*                 _showProfileSubLevelStreamingDynamic;              // 0x0850(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_858[0x18];                                     // 0x0858(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateBattle*                     _viewTargetPlayerState;                            // 0x0870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_878[0x28];                                     // 0x0878(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EGameModeType, TSoftClassPtr<class UClass>> _commentaryVoiceComponentMap;                      // 0x08A0(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   _commentaryVoiceComponent;                         // 0x08F0(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_918[0x40];                                     // 0x0918(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UUserWidget>                DEBUG_EnvVfxCommandWidget;                         // 0x0958(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             DEBUG_OnEnvDebugWheelOpen;                         // 0x0960(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             DEBUG_OnEnvDebugWheelClose;                        // 0x0970(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UCameraControllerBattle*                _cameraControllerBattle;                           // 0x0980(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_988[0x10];                                     // 0x0988(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_PlayCameraShakeParam(const struct FCameraShakerParam& Param, float Scale);
	void BP_SendViolationReport_CallServer(EMdPenaltyType PenaltyReportType);
	void BP_ServerTravel(const class FString& URL);
	void ChangeButtonGuideVisibilityEvent__DelegateSignature();
	void ClientPrepareRestart();
	void ClientSelectRestartPosition();
	void ClientSetBattleResultData(const TArray<struct FBattleResultData>& Data, const TArray<struct FDropItemParamInfo>& DropItems, bool bRetire);
	void ClientSetSpectatingCamera();
	void DEBUG_DoEnvVfxCommandRPC_OnServer(EDamageAttribute Element);
	void DEBUG_DoEnvVfxDebugCommand(EDamageAttribute Element);
	void Debug_OnEnvDebugCommandDispatched__DelegateSignature();
	void DropItem_OnServer(const int32 DipIndex);
	void OnRemovePlayerStateSpectating(class AActor* Actor, EEndPlayReason EndPlayReason);
	void OnRep_ChangePawn();
	void OnShowProfileSubLevelHidden();
	void OnShowProfileSubLevelShow();
	void OpenSpectating();
	void RequestPlayerDataActivityStatus(const struct FUniqueNetIdKey& UniqueId);
	void ReTargetViewSpectatingServer();
	void SendCheer_OnServer(class APlayerStateBattle* SendCheerPlayerState, class APlayerStateBattle* RecvCheerPlayerState, int32 AddCheerCount);
	void SendPlayerDataActivityStatus(const struct FPlayerDataActivityStatus& ScoreData);
	void SendViolationReport_OnServer(const class FString& SendSelectedPlayerId, const class FString& RecvSelectedPlayerId, EMdPenaltyType PenaltyReportType);
	void SendViolationReport_OnServerDebug(const class FString& RecvSelectedPlayerId, EMdPenaltyType PenaltyReportType);
	void ServerSpectatingChangePlayerView(bool bNext);
	void ServerTravelBattle(const class FString& InGameMode, const class FString& InStage);
	void StartBattle(const class FString& InGameMode, const class FString& InStage);
	void StartSpectatingFromDead();
	void SwitchAbilityInfoVisibility(bool bVisible);
	void SwitchAllyPlayerStatusInfo(bool bVisible);
	void SwitchBattleCounterVisibility(bool bVisible);
	void SwitchCrossHairsVisibility(bool bVisible);
	void SwitchInGameButtonGuideVisibility(bool bVisible);
	void SwitchLocalPlayerStatusInfo(bool bVisible);
	void SwitchLvUpShortCutVisibility(bool bVisible);
	void SwitchMiscInfoVisibility(bool bVisible);
	void SwitchPlusUltraVisibility(bool bVisible);
	void SwitchShortcutInfoVisibility(bool bVisible);

	class UHudCommandControlComponent* BP_GetCommandHUDControlComponent() const;
	class ACharacterBattle* BP_GetControlledCharacter() const;
	class UCommentaryVoiceComponent* GetCommentaryVoiceComponent() const;
	void ServerTravel(const class FString& URL) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerControllerBattle">();
	}
	static class APlayerControllerBattle* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayerControllerBattle>();
	}
};
static_assert(alignof(APlayerControllerBattle) == 0x000008, "Wrong alignment on APlayerControllerBattle");
static_assert(sizeof(APlayerControllerBattle) == 0x000998, "Wrong size on APlayerControllerBattle");
static_assert(offsetof(APlayerControllerBattle, _OriginalPawn) == 0x000648, "Member 'APlayerControllerBattle::_OriginalPawn' has a wrong offset!");
static_assert(offsetof(APlayerControllerBattle, CameraShacker) == 0x000748, "Member 'APlayerControllerBattle::CameraShacker' has a wrong offset!");
static_assert(offsetof(APlayerControllerBattle, _commandHudComponent) == 0x000830, "Member 'APlayerControllerBattle::_commandHudComponent' has a wrong offset!");
static_assert(offsetof(APlayerControllerBattle, _localPlayerHudManager) == 0x000838, "Member 'APlayerControllerBattle::_localPlayerHudManager' has a wrong offset!");
static_assert(offsetof(APlayerControllerBattle, _uiSubsystemComponent) == 0x000840, "Member 'APlayerControllerBattle::_uiSubsystemComponent' has a wrong offset!");
static_assert(offsetof(APlayerControllerBattle, _winDemoController) == 0x000848, "Member 'APlayerControllerBattle::_winDemoController' has a wrong offset!");
static_assert(offsetof(APlayerControllerBattle, _showProfileSubLevelStreamingDynamic) == 0x000850, "Member 'APlayerControllerBattle::_showProfileSubLevelStreamingDynamic' has a wrong offset!");
static_assert(offsetof(APlayerControllerBattle, _viewTargetPlayerState) == 0x000870, "Member 'APlayerControllerBattle::_viewTargetPlayerState' has a wrong offset!");
static_assert(offsetof(APlayerControllerBattle, _commentaryVoiceComponentMap) == 0x0008A0, "Member 'APlayerControllerBattle::_commentaryVoiceComponentMap' has a wrong offset!");
static_assert(offsetof(APlayerControllerBattle, _commentaryVoiceComponent) == 0x0008F0, "Member 'APlayerControllerBattle::_commentaryVoiceComponent' has a wrong offset!");
static_assert(offsetof(APlayerControllerBattle, DEBUG_EnvVfxCommandWidget) == 0x000958, "Member 'APlayerControllerBattle::DEBUG_EnvVfxCommandWidget' has a wrong offset!");
static_assert(offsetof(APlayerControllerBattle, DEBUG_OnEnvDebugWheelOpen) == 0x000960, "Member 'APlayerControllerBattle::DEBUG_OnEnvDebugWheelOpen' has a wrong offset!");
static_assert(offsetof(APlayerControllerBattle, DEBUG_OnEnvDebugWheelClose) == 0x000970, "Member 'APlayerControllerBattle::DEBUG_OnEnvDebugWheelClose' has a wrong offset!");
static_assert(offsetof(APlayerControllerBattle, _cameraControllerBattle) == 0x000980, "Member 'APlayerControllerBattle::_cameraControllerBattle' has a wrong offset!");

// Class InGameModule.PlayerControllerReplaySpectator
// 0x0000 (0x0998 - 0x0998)
class APlayerControllerReplaySpectator final : public APlayerControllerBattle
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerControllerReplaySpectator">();
	}
	static class APlayerControllerReplaySpectator* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayerControllerReplaySpectator>();
	}
};
static_assert(alignof(APlayerControllerReplaySpectator) == 0x000008, "Wrong alignment on APlayerControllerReplaySpectator");
static_assert(sizeof(APlayerControllerReplaySpectator) == 0x000998, "Wrong size on APlayerControllerReplaySpectator");

// Class InGameModule.SupplyActorBase
// 0x0098 (0x02B8 - 0x0220)
class ASupplyActorBase : public AActor
{
public:
	uint8                                         Pad_220[0x10];                                     // 0x0220(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UPinnedActorComponent*                  _pinnedActorComponent;                             // 0x0230(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_238[0x18];                                     // 0x0238(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   _supplyId;                                         // 0x0250(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint16                                        _netSupplyId;                                      // 0x0258(0x0002)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       _blockCollisionSphereComponent;                    // 0x0260(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantizeNormal              _moveVectorXY;                                     // 0x0268(0x000C)(Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bInitializeMove;                                  // 0x0274(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_275[0x3];                                      // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector_NetQuantize10                  _veloXZ_accel;                                     // 0x0278(0x000C)(Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _isCorrectPositoin;                                // 0x0284(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_285[0x27];                                     // 0x0285(0x0027)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnablePoisonMistReductionEvent;                   // 0x02AC(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2AD[0xB];                                      // 0x02AD(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FirstSearchUnderObject();
	void OnCollapseInAirEvent(class AActor* Actor);
	void OnRep_NetSupplyId();
	void OnSearchUnderActor();
	void OnSearchUnderActorCorrect();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SupplyActorBase">();
	}
	static class ASupplyActorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASupplyActorBase>();
	}
};
static_assert(alignof(ASupplyActorBase) == 0x000008, "Wrong alignment on ASupplyActorBase");
static_assert(sizeof(ASupplyActorBase) == 0x0002B8, "Wrong size on ASupplyActorBase");
static_assert(offsetof(ASupplyActorBase, _pinnedActorComponent) == 0x000230, "Member 'ASupplyActorBase::_pinnedActorComponent' has a wrong offset!");
static_assert(offsetof(ASupplyActorBase, _supplyId) == 0x000250, "Member 'ASupplyActorBase::_supplyId' has a wrong offset!");
static_assert(offsetof(ASupplyActorBase, _netSupplyId) == 0x000258, "Member 'ASupplyActorBase::_netSupplyId' has a wrong offset!");
static_assert(offsetof(ASupplyActorBase, _blockCollisionSphereComponent) == 0x000260, "Member 'ASupplyActorBase::_blockCollisionSphereComponent' has a wrong offset!");
static_assert(offsetof(ASupplyActorBase, _moveVectorXY) == 0x000268, "Member 'ASupplyActorBase::_moveVectorXY' has a wrong offset!");
static_assert(offsetof(ASupplyActorBase, _bInitializeMove) == 0x000274, "Member 'ASupplyActorBase::_bInitializeMove' has a wrong offset!");
static_assert(offsetof(ASupplyActorBase, _veloXZ_accel) == 0x000278, "Member 'ASupplyActorBase::_veloXZ_accel' has a wrong offset!");
static_assert(offsetof(ASupplyActorBase, _isCorrectPositoin) == 0x000284, "Member 'ASupplyActorBase::_isCorrectPositoin' has a wrong offset!");
static_assert(offsetof(ASupplyActorBase, bEnablePoisonMistReductionEvent) == 0x0002AC, "Member 'ASupplyActorBase::bEnablePoisonMistReductionEvent' has a wrong offset!");

// Class InGameModule.AN_AttackDedicatedEvent
// 0x0008 (0x0048 - 0x0040)
class UAN_AttackDedicatedEvent final : public UAN_BattleBase
{
public:
	EAttackDedicatedEventId                       _eventId;                                          // 0x0040(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AN_AttackDedicatedEvent">();
	}
	static class UAN_AttackDedicatedEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAN_AttackDedicatedEvent>();
	}
};
static_assert(alignof(UAN_AttackDedicatedEvent) == 0x000008, "Wrong alignment on UAN_AttackDedicatedEvent");
static_assert(sizeof(UAN_AttackDedicatedEvent) == 0x000048, "Wrong size on UAN_AttackDedicatedEvent");
static_assert(offsetof(UAN_AttackDedicatedEvent, _eventId) == 0x000040, "Member 'UAN_AttackDedicatedEvent::_eventId' has a wrong offset!");

// Class InGameModule.BattleBriefingPinWidget
// 0x00B8 (0x0408 - 0x0350)
class UBattleBriefingPinWidget final : public UWidgetBase
{
public:
	ECharacterId                                  _charaId;                                          // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHudResource*                           _characterDataAsset;                               // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     _charaFaceMat;                                     // 0x0360(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               _charaFaceMatDynamic;                              // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           _characterFaceEdgeColor;                           // 0x0370(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                           _canvasPanel;                                      // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 _pinBody;                                          // 0x0388(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                           _playerInfoCanvasPanel;                            // 0x0390(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 _charaIcon;                                        // 0x0398(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBattleBriefingPlayerNameWidget*        _playerName;                                       // 0x03A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             _leaderOrder;                                      // 0x03B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                        _leadersTeamSwitcher;                              // 0x03B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                           _seTimerHandle;                                    // 0x03C0(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C8[0x8];                                      // 0x03C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       _animDecision;                                     // 0x03D0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       _animChangeLeader;                                 // 0x03D8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       _animChangeLeaderOrder;                            // 0x03E0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       _animCancelLeaderOrder;                            // 0x03E8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       _animCancelLeader;                                 // 0x03F0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F8[0x10];                                     // 0x03F8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattleBriefingPinWidget">();
	}
	static class UBattleBriefingPinWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleBriefingPinWidget>();
	}
};
static_assert(alignof(UBattleBriefingPinWidget) == 0x000008, "Wrong alignment on UBattleBriefingPinWidget");
static_assert(sizeof(UBattleBriefingPinWidget) == 0x000408, "Wrong size on UBattleBriefingPinWidget");
static_assert(offsetof(UBattleBriefingPinWidget, _charaId) == 0x000350, "Member 'UBattleBriefingPinWidget::_charaId' has a wrong offset!");
static_assert(offsetof(UBattleBriefingPinWidget, _characterDataAsset) == 0x000358, "Member 'UBattleBriefingPinWidget::_characterDataAsset' has a wrong offset!");
static_assert(offsetof(UBattleBriefingPinWidget, _charaFaceMat) == 0x000360, "Member 'UBattleBriefingPinWidget::_charaFaceMat' has a wrong offset!");
static_assert(offsetof(UBattleBriefingPinWidget, _charaFaceMatDynamic) == 0x000368, "Member 'UBattleBriefingPinWidget::_charaFaceMatDynamic' has a wrong offset!");
static_assert(offsetof(UBattleBriefingPinWidget, _characterFaceEdgeColor) == 0x000370, "Member 'UBattleBriefingPinWidget::_characterFaceEdgeColor' has a wrong offset!");
static_assert(offsetof(UBattleBriefingPinWidget, _canvasPanel) == 0x000380, "Member 'UBattleBriefingPinWidget::_canvasPanel' has a wrong offset!");
static_assert(offsetof(UBattleBriefingPinWidget, _pinBody) == 0x000388, "Member 'UBattleBriefingPinWidget::_pinBody' has a wrong offset!");
static_assert(offsetof(UBattleBriefingPinWidget, _playerInfoCanvasPanel) == 0x000390, "Member 'UBattleBriefingPinWidget::_playerInfoCanvasPanel' has a wrong offset!");
static_assert(offsetof(UBattleBriefingPinWidget, _charaIcon) == 0x000398, "Member 'UBattleBriefingPinWidget::_charaIcon' has a wrong offset!");
static_assert(offsetof(UBattleBriefingPinWidget, _playerName) == 0x0003A0, "Member 'UBattleBriefingPinWidget::_playerName' has a wrong offset!");
static_assert(offsetof(UBattleBriefingPinWidget, _leaderOrder) == 0x0003B0, "Member 'UBattleBriefingPinWidget::_leaderOrder' has a wrong offset!");
static_assert(offsetof(UBattleBriefingPinWidget, _leadersTeamSwitcher) == 0x0003B8, "Member 'UBattleBriefingPinWidget::_leadersTeamSwitcher' has a wrong offset!");
static_assert(offsetof(UBattleBriefingPinWidget, _seTimerHandle) == 0x0003C0, "Member 'UBattleBriefingPinWidget::_seTimerHandle' has a wrong offset!");
static_assert(offsetof(UBattleBriefingPinWidget, _animDecision) == 0x0003D0, "Member 'UBattleBriefingPinWidget::_animDecision' has a wrong offset!");
static_assert(offsetof(UBattleBriefingPinWidget, _animChangeLeader) == 0x0003D8, "Member 'UBattleBriefingPinWidget::_animChangeLeader' has a wrong offset!");
static_assert(offsetof(UBattleBriefingPinWidget, _animChangeLeaderOrder) == 0x0003E0, "Member 'UBattleBriefingPinWidget::_animChangeLeaderOrder' has a wrong offset!");
static_assert(offsetof(UBattleBriefingPinWidget, _animCancelLeaderOrder) == 0x0003E8, "Member 'UBattleBriefingPinWidget::_animCancelLeaderOrder' has a wrong offset!");
static_assert(offsetof(UBattleBriefingPinWidget, _animCancelLeader) == 0x0003F0, "Member 'UBattleBriefingPinWidget::_animCancelLeader' has a wrong offset!");

// Class InGameModule.ItemBase
// 0x00D0 (0x0388 - 0x02B8)
class AItemBase : public ASupplyActorBase
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EItemVisiblityType                            _visiblityType;                                    // 0x02C0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USupplyManagerComponent*                _itemManagerComponent;                             // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParticleSystem*                        _activeParticle;                                   // 0x02D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParticleSystem*                        _respawnParticle;                                  // 0x02D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParticleSystem*                        _acquiredParticle;                                 // 0x02E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _bUseAbilityColor;                                 // 0x02E8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   _colorTableRowName;                                // 0x02EC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBattleCustomParticleSystemComponent*   _activeParticleSystem;                             // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBattleCustomParticleSystemComponent*   _respawnParticleSystem;                            // 0x0300(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBattleCustomParticleSystemComponent*   _despawnParticleSystem;                            // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPaperSprite*                           _itemSignalTexture;                                // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APlayerControllerBattle*                _playerController;                                 // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialControlComponent*              _materialControl;                                  // 0x0320(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMaterialInstanceDynamic*>       _dynamicMaterialInstanceArray;                     // 0x0328(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        _rootComponent;                                    // 0x0340(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_348[0x18];                                     // 0x0348(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UParticleSystemComponent*>       _particleSystemComponent;                          // 0x0360(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         _teamId;                                           // 0x0370(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         _squadId;                                          // 0x0371(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         _playerId;                                         // 0x0372(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_373[0x5];                                      // 0x0373(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractTargetComponent*               _interactTargetComponent;                          // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        _serial_levelField;                                // 0x0380(0x0002)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_382[0x6];                                      // 0x0382(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnInteractToClient_RPC(class APlayerState* PalyerState);
	void SetupComponents();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemBase">();
	}
	static class AItemBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AItemBase>();
	}
};
static_assert(alignof(AItemBase) == 0x000008, "Wrong alignment on AItemBase");
static_assert(sizeof(AItemBase) == 0x000388, "Wrong size on AItemBase");
static_assert(offsetof(AItemBase, _visiblityType) == 0x0002C0, "Member 'AItemBase::_visiblityType' has a wrong offset!");
static_assert(offsetof(AItemBase, _itemManagerComponent) == 0x0002C8, "Member 'AItemBase::_itemManagerComponent' has a wrong offset!");
static_assert(offsetof(AItemBase, _activeParticle) == 0x0002D0, "Member 'AItemBase::_activeParticle' has a wrong offset!");
static_assert(offsetof(AItemBase, _respawnParticle) == 0x0002D8, "Member 'AItemBase::_respawnParticle' has a wrong offset!");
static_assert(offsetof(AItemBase, _acquiredParticle) == 0x0002E0, "Member 'AItemBase::_acquiredParticle' has a wrong offset!");
static_assert(offsetof(AItemBase, _bUseAbilityColor) == 0x0002E8, "Member 'AItemBase::_bUseAbilityColor' has a wrong offset!");
static_assert(offsetof(AItemBase, _colorTableRowName) == 0x0002EC, "Member 'AItemBase::_colorTableRowName' has a wrong offset!");
static_assert(offsetof(AItemBase, _activeParticleSystem) == 0x0002F8, "Member 'AItemBase::_activeParticleSystem' has a wrong offset!");
static_assert(offsetof(AItemBase, _respawnParticleSystem) == 0x000300, "Member 'AItemBase::_respawnParticleSystem' has a wrong offset!");
static_assert(offsetof(AItemBase, _despawnParticleSystem) == 0x000308, "Member 'AItemBase::_despawnParticleSystem' has a wrong offset!");
static_assert(offsetof(AItemBase, _itemSignalTexture) == 0x000310, "Member 'AItemBase::_itemSignalTexture' has a wrong offset!");
static_assert(offsetof(AItemBase, _playerController) == 0x000318, "Member 'AItemBase::_playerController' has a wrong offset!");
static_assert(offsetof(AItemBase, _materialControl) == 0x000320, "Member 'AItemBase::_materialControl' has a wrong offset!");
static_assert(offsetof(AItemBase, _dynamicMaterialInstanceArray) == 0x000328, "Member 'AItemBase::_dynamicMaterialInstanceArray' has a wrong offset!");
static_assert(offsetof(AItemBase, _rootComponent) == 0x000340, "Member 'AItemBase::_rootComponent' has a wrong offset!");
static_assert(offsetof(AItemBase, _particleSystemComponent) == 0x000360, "Member 'AItemBase::_particleSystemComponent' has a wrong offset!");
static_assert(offsetof(AItemBase, _teamId) == 0x000370, "Member 'AItemBase::_teamId' has a wrong offset!");
static_assert(offsetof(AItemBase, _squadId) == 0x000371, "Member 'AItemBase::_squadId' has a wrong offset!");
static_assert(offsetof(AItemBase, _playerId) == 0x000372, "Member 'AItemBase::_playerId' has a wrong offset!");
static_assert(offsetof(AItemBase, _interactTargetComponent) == 0x000378, "Member 'AItemBase::_interactTargetComponent' has a wrong offset!");
static_assert(offsetof(AItemBase, _serial_levelField) == 0x000380, "Member 'AItemBase::_serial_levelField' has a wrong offset!");

// Class InGameModule.AbilityActor
// 0x0058 (0x03E0 - 0x0388)
class AAbilityActor final : public AItemBase
{
public:
	TMap<EMdAbilityType, class UParticleSystem*>  _abilityParticles;                                 // 0x0388(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)
	EAttackId                                     _attackID;                                         // 0x03D8(0x0001)(Edit, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECharacterId                                  _characterId;                                      // 0x03D9(0x0001)(Edit, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3DA[0x6];                                      // 0x03DA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityActor">();
	}
	static class AAbilityActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAbilityActor>();
	}
};
static_assert(alignof(AAbilityActor) == 0x000008, "Wrong alignment on AAbilityActor");
static_assert(sizeof(AAbilityActor) == 0x0003E0, "Wrong size on AAbilityActor");
static_assert(offsetof(AAbilityActor, _abilityParticles) == 0x000388, "Member 'AAbilityActor::_abilityParticles' has a wrong offset!");
static_assert(offsetof(AAbilityActor, _attackID) == 0x0003D8, "Member 'AAbilityActor::_attackID' has a wrong offset!");
static_assert(offsetof(AAbilityActor, _characterId) == 0x0003D9, "Member 'AAbilityActor::_characterId' has a wrong offset!");

// Class InGameModule.AutoChatComponent
// 0x0048 (0x00F8 - 0x00B0)
class UAutoChatComponent final : public UActorComponent
{
public:
	int32                                         _poisonMistNotAnnouncePhase;                       // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _poisonMistWaitingTime;                            // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _supplyBoxJudgeRadius;                             // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _supplyBoxSpawnWaitingTime;                        // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _stopperTime;                                      // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C4[0x34];                                      // 0x00C4(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutoChatComponent">();
	}
	static class UAutoChatComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutoChatComponent>();
	}
};
static_assert(alignof(UAutoChatComponent) == 0x000008, "Wrong alignment on UAutoChatComponent");
static_assert(sizeof(UAutoChatComponent) == 0x0000F8, "Wrong size on UAutoChatComponent");
static_assert(offsetof(UAutoChatComponent, _poisonMistNotAnnouncePhase) == 0x0000B0, "Member 'UAutoChatComponent::_poisonMistNotAnnouncePhase' has a wrong offset!");
static_assert(offsetof(UAutoChatComponent, _poisonMistWaitingTime) == 0x0000B4, "Member 'UAutoChatComponent::_poisonMistWaitingTime' has a wrong offset!");
static_assert(offsetof(UAutoChatComponent, _supplyBoxJudgeRadius) == 0x0000B8, "Member 'UAutoChatComponent::_supplyBoxJudgeRadius' has a wrong offset!");
static_assert(offsetof(UAutoChatComponent, _supplyBoxSpawnWaitingTime) == 0x0000BC, "Member 'UAutoChatComponent::_supplyBoxSpawnWaitingTime' has a wrong offset!");
static_assert(offsetof(UAutoChatComponent, _stopperTime) == 0x0000C0, "Member 'UAutoChatComponent::_stopperTime' has a wrong offset!");

// Class InGameModule.AbilityDataAsset
// 0x0050 (0x0118 - 0x00C8)
class UAbilityDataAsset final : public USupplyBaseDataAsset
{
public:
	uint8                                         Pad_C8[0x18];                                      // 0x00C8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	ECharacterId                                  _characterId;                                      // 0x00E0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttackId                                     _attackID;                                         // 0x00E1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   _actionAttackClass;                                // 0x00E8(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _defaultDuration;                                  // 0x0110(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityDataAsset">();
	}
	static class UAbilityDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityDataAsset>();
	}
};
static_assert(alignof(UAbilityDataAsset) == 0x000008, "Wrong alignment on UAbilityDataAsset");
static_assert(sizeof(UAbilityDataAsset) == 0x000118, "Wrong size on UAbilityDataAsset");
static_assert(offsetof(UAbilityDataAsset, _characterId) == 0x0000E0, "Member 'UAbilityDataAsset::_characterId' has a wrong offset!");
static_assert(offsetof(UAbilityDataAsset, _attackID) == 0x0000E1, "Member 'UAbilityDataAsset::_attackID' has a wrong offset!");
static_assert(offsetof(UAbilityDataAsset, _actionAttackClass) == 0x0000E8, "Member 'UAbilityDataAsset::_actionAttackClass' has a wrong offset!");
static_assert(offsetof(UAbilityDataAsset, _defaultDuration) == 0x000110, "Member 'UAbilityDataAsset::_defaultDuration' has a wrong offset!");

// Class InGameModule.InventoryDragDropOperation
// 0x0008 (0x0090 - 0x0088)
class UInventoryDragDropOperation final : public UDragDropOperation
{
public:
	class UUserWidget*                            _widgetRef;                                        // 0x0088(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InventoryDragDropOperation">();
	}
	static class UInventoryDragDropOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventoryDragDropOperation>();
	}
};
static_assert(alignof(UInventoryDragDropOperation) == 0x000008, "Wrong alignment on UInventoryDragDropOperation");
static_assert(sizeof(UInventoryDragDropOperation) == 0x000090, "Wrong size on UInventoryDragDropOperation");
static_assert(offsetof(UInventoryDragDropOperation, _widgetRef) == 0x000088, "Member 'UInventoryDragDropOperation::_widgetRef' has a wrong offset!");

// Class InGameModule.AbilityDataWork
// 0x0050 (0x0080 - 0x0030)
class UAbilityDataWork final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityDataWork">();
	}
	static class UAbilityDataWork* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityDataWork>();
	}
};
static_assert(alignof(UAbilityDataWork) == 0x000008, "Wrong alignment on UAbilityDataWork");
static_assert(sizeof(UAbilityDataWork) == 0x000080, "Wrong size on UAbilityDataWork");

// Class InGameModule.AN_AttackSetSpeedH
// 0x0010 (0x0050 - 0x0040)
class UAN_AttackSetSpeedH final : public UAN_BattleBase
{
public:
	float                                         _initialSpeed;                                     // 0x0040(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _lastSpeed;                                        // 0x0044(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _span;                                             // 0x0048(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _useCurrentSpeed;                                  // 0x004C(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AN_AttackSetSpeedH">();
	}
	static class UAN_AttackSetSpeedH* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAN_AttackSetSpeedH>();
	}
};
static_assert(alignof(UAN_AttackSetSpeedH) == 0x000008, "Wrong alignment on UAN_AttackSetSpeedH");
static_assert(sizeof(UAN_AttackSetSpeedH) == 0x000050, "Wrong size on UAN_AttackSetSpeedH");
static_assert(offsetof(UAN_AttackSetSpeedH, _initialSpeed) == 0x000040, "Member 'UAN_AttackSetSpeedH::_initialSpeed' has a wrong offset!");
static_assert(offsetof(UAN_AttackSetSpeedH, _lastSpeed) == 0x000044, "Member 'UAN_AttackSetSpeedH::_lastSpeed' has a wrong offset!");
static_assert(offsetof(UAN_AttackSetSpeedH, _span) == 0x000048, "Member 'UAN_AttackSetSpeedH::_span' has a wrong offset!");
static_assert(offsetof(UAN_AttackSetSpeedH, _useCurrentSpeed) == 0x00004C, "Member 'UAN_AttackSetSpeedH::_useCurrentSpeed' has a wrong offset!");

// Class InGameModule.BattleBriefingSignalPinWidget
// 0x00B8 (0x0408 - 0x0350)
class UBattleBriefingSignalPinWidget final : public UWidgetBase
{
public:
	uint8                                         Pad_350[0x10];                                     // 0x0350(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	ECharacterId                                  _charaId;                                          // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHudResource*                           _characterDataAsset;                               // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_370[0x8];                                      // 0x0370(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _secondClickTimeLimit;                             // 0x0378(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     _charaFaceMat;                                     // 0x0380(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               _charaFaceMatDynamic;                              // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           _myEdgeColor;                                      // 0x0390(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           _otherEdgeColor;                                   // 0x03A0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           _dangerEdgeColor;                                  // 0x03B0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C0[0x10];                                     // 0x03C0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 _triangleParts;                                    // 0x03D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 _playerMark;                                       // 0x03D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 _charaIcon;                                        // 0x03E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                _collider;                                         // 0x03E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 _crown;                                            // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 _signalKindIcon;                                   // 0x03F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             _playerName;                                       // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void CommitPin(const struct FVector2D& PinUpPosition, const bool& bAlert);
	void CommitPinDelegate__DelegateSignature(const bool bAlert);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattleBriefingSignalPinWidget">();
	}
	static class UBattleBriefingSignalPinWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleBriefingSignalPinWidget>();
	}
};
static_assert(alignof(UBattleBriefingSignalPinWidget) == 0x000008, "Wrong alignment on UBattleBriefingSignalPinWidget");
static_assert(sizeof(UBattleBriefingSignalPinWidget) == 0x000408, "Wrong size on UBattleBriefingSignalPinWidget");
static_assert(offsetof(UBattleBriefingSignalPinWidget, _charaId) == 0x000360, "Member 'UBattleBriefingSignalPinWidget::_charaId' has a wrong offset!");
static_assert(offsetof(UBattleBriefingSignalPinWidget, _characterDataAsset) == 0x000368, "Member 'UBattleBriefingSignalPinWidget::_characterDataAsset' has a wrong offset!");
static_assert(offsetof(UBattleBriefingSignalPinWidget, _secondClickTimeLimit) == 0x000378, "Member 'UBattleBriefingSignalPinWidget::_secondClickTimeLimit' has a wrong offset!");
static_assert(offsetof(UBattleBriefingSignalPinWidget, _charaFaceMat) == 0x000380, "Member 'UBattleBriefingSignalPinWidget::_charaFaceMat' has a wrong offset!");
static_assert(offsetof(UBattleBriefingSignalPinWidget, _charaFaceMatDynamic) == 0x000388, "Member 'UBattleBriefingSignalPinWidget::_charaFaceMatDynamic' has a wrong offset!");
static_assert(offsetof(UBattleBriefingSignalPinWidget, _myEdgeColor) == 0x000390, "Member 'UBattleBriefingSignalPinWidget::_myEdgeColor' has a wrong offset!");
static_assert(offsetof(UBattleBriefingSignalPinWidget, _otherEdgeColor) == 0x0003A0, "Member 'UBattleBriefingSignalPinWidget::_otherEdgeColor' has a wrong offset!");
static_assert(offsetof(UBattleBriefingSignalPinWidget, _dangerEdgeColor) == 0x0003B0, "Member 'UBattleBriefingSignalPinWidget::_dangerEdgeColor' has a wrong offset!");
static_assert(offsetof(UBattleBriefingSignalPinWidget, _triangleParts) == 0x0003D0, "Member 'UBattleBriefingSignalPinWidget::_triangleParts' has a wrong offset!");
static_assert(offsetof(UBattleBriefingSignalPinWidget, _playerMark) == 0x0003D8, "Member 'UBattleBriefingSignalPinWidget::_playerMark' has a wrong offset!");
static_assert(offsetof(UBattleBriefingSignalPinWidget, _charaIcon) == 0x0003E0, "Member 'UBattleBriefingSignalPinWidget::_charaIcon' has a wrong offset!");
static_assert(offsetof(UBattleBriefingSignalPinWidget, _collider) == 0x0003E8, "Member 'UBattleBriefingSignalPinWidget::_collider' has a wrong offset!");
static_assert(offsetof(UBattleBriefingSignalPinWidget, _crown) == 0x0003F0, "Member 'UBattleBriefingSignalPinWidget::_crown' has a wrong offset!");
static_assert(offsetof(UBattleBriefingSignalPinWidget, _signalKindIcon) == 0x0003F8, "Member 'UBattleBriefingSignalPinWidget::_signalKindIcon' has a wrong offset!");
static_assert(offsetof(UBattleBriefingSignalPinWidget, _playerName) == 0x000400, "Member 'UBattleBriefingSignalPinWidget::_playerName' has a wrong offset!");

// Class InGameModule.AbilityIconWidget
// 0x0028 (0x0378 - 0x0350)
class UAbilityIconWidget final : public UWidgetBase
{
public:
	class UImage*                                 _iconImage;                                        // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 _attackIdImage;                                    // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 _levelTextImage;                                   // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 _levelNumberImage;                                 // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               _IconImageMaterialInstance;                        // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BP_SetAvility(ECharacterId CharacterId, EAttackId AttackId, int32 VariationNo);
	void BP_SetLevel(int32 Level);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityIconWidget">();
	}
	static class UAbilityIconWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityIconWidget>();
	}
};
static_assert(alignof(UAbilityIconWidget) == 0x000008, "Wrong alignment on UAbilityIconWidget");
static_assert(sizeof(UAbilityIconWidget) == 0x000378, "Wrong size on UAbilityIconWidget");
