#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InGameModule

#include "Basic.hpp"

#include "GameModule_structs.hpp"
#include "CommonModule_structs.hpp"
#include "UIFramework_structs.hpp"
#include "InGameModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "BykingUnrealModule_structs.hpp"
#include "SlateCore_structs.hpp"
#include "MasterDataModule_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function InGameModule.DogTagManagerComponent.ConsumeDogTag_ToClient
// 0x0008 (0x0008 - 0x0000)
struct DogTagManagerComponent_ConsumeDogTag_ToClient final
{
public:
	class APlayerStateBattle*                     PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DogTagManagerComponent_ConsumeDogTag_ToClient) == 0x000008, "Wrong alignment on DogTagManagerComponent_ConsumeDogTag_ToClient");
static_assert(sizeof(DogTagManagerComponent_ConsumeDogTag_ToClient) == 0x000008, "Wrong size on DogTagManagerComponent_ConsumeDogTag_ToClient");
static_assert(offsetof(DogTagManagerComponent_ConsumeDogTag_ToClient, PlayerState) == 0x000000, "Member 'DogTagManagerComponent_ConsumeDogTag_ToClient::PlayerState' has a wrong offset!");

// Function InGameModule.DogTagManagerComponent.ConsumeDogTag_ToServer
// 0x0008 (0x0008 - 0x0000)
struct DogTagManagerComponent_ConsumeDogTag_ToServer final
{
public:
	class APlayerStateBattle*                     PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DogTagManagerComponent_ConsumeDogTag_ToServer) == 0x000008, "Wrong alignment on DogTagManagerComponent_ConsumeDogTag_ToServer");
static_assert(sizeof(DogTagManagerComponent_ConsumeDogTag_ToServer) == 0x000008, "Wrong size on DogTagManagerComponent_ConsumeDogTag_ToServer");
static_assert(offsetof(DogTagManagerComponent_ConsumeDogTag_ToServer, PlayerState) == 0x000000, "Member 'DogTagManagerComponent_ConsumeDogTag_ToServer::PlayerState' has a wrong offset!");

// Function InGameModule.DogTagManagerComponent.LockDogTag_ToClient
// 0x0004 (0x0004 - 0x0000)
struct DogTagManagerComponent_LockDogTag_ToClient final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x1];                                        // 0x0001(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int16                                         PlayrId;                                           // 0x0002(0x0002)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DogTagManagerComponent_LockDogTag_ToClient) == 0x000002, "Wrong alignment on DogTagManagerComponent_LockDogTag_ToClient");
static_assert(sizeof(DogTagManagerComponent_LockDogTag_ToClient) == 0x000004, "Wrong size on DogTagManagerComponent_LockDogTag_ToClient");
static_assert(offsetof(DogTagManagerComponent_LockDogTag_ToClient, TeamId) == 0x000000, "Member 'DogTagManagerComponent_LockDogTag_ToClient::TeamId' has a wrong offset!");
static_assert(offsetof(DogTagManagerComponent_LockDogTag_ToClient, PlayrId) == 0x000002, "Member 'DogTagManagerComponent_LockDogTag_ToClient::PlayrId' has a wrong offset!");

// Function InGameModule.DogTagManagerComponent.LockDogTag_ToServer
// 0x0004 (0x0004 - 0x0000)
struct DogTagManagerComponent_LockDogTag_ToServer final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x1];                                        // 0x0001(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int16                                         PlayrId;                                           // 0x0002(0x0002)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DogTagManagerComponent_LockDogTag_ToServer) == 0x000002, "Wrong alignment on DogTagManagerComponent_LockDogTag_ToServer");
static_assert(sizeof(DogTagManagerComponent_LockDogTag_ToServer) == 0x000004, "Wrong size on DogTagManagerComponent_LockDogTag_ToServer");
static_assert(offsetof(DogTagManagerComponent_LockDogTag_ToServer, TeamId) == 0x000000, "Member 'DogTagManagerComponent_LockDogTag_ToServer::TeamId' has a wrong offset!");
static_assert(offsetof(DogTagManagerComponent_LockDogTag_ToServer, PlayrId) == 0x000002, "Member 'DogTagManagerComponent_LockDogTag_ToServer::PlayrId' has a wrong offset!");

// Function InGameModule.DogTagManagerComponent.OnPickupDogTag_ToClient
// 0x0004 (0x0004 - 0x0000)
struct DogTagManagerComponent_OnPickupDogTag_ToClient final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x1];                                        // 0x0001(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int16                                         PlayerId;                                          // 0x0002(0x0002)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DogTagManagerComponent_OnPickupDogTag_ToClient) == 0x000002, "Wrong alignment on DogTagManagerComponent_OnPickupDogTag_ToClient");
static_assert(sizeof(DogTagManagerComponent_OnPickupDogTag_ToClient) == 0x000004, "Wrong size on DogTagManagerComponent_OnPickupDogTag_ToClient");
static_assert(offsetof(DogTagManagerComponent_OnPickupDogTag_ToClient, TeamId) == 0x000000, "Member 'DogTagManagerComponent_OnPickupDogTag_ToClient::TeamId' has a wrong offset!");
static_assert(offsetof(DogTagManagerComponent_OnPickupDogTag_ToClient, PlayerId) == 0x000002, "Member 'DogTagManagerComponent_OnPickupDogTag_ToClient::PlayerId' has a wrong offset!");

// Function InGameModule.DogTagManagerComponent.OnPickupDogTag_ToServer
// 0x0004 (0x0004 - 0x0000)
struct DogTagManagerComponent_OnPickupDogTag_ToServer final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x1];                                        // 0x0001(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int16                                         PlayerId;                                          // 0x0002(0x0002)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DogTagManagerComponent_OnPickupDogTag_ToServer) == 0x000002, "Wrong alignment on DogTagManagerComponent_OnPickupDogTag_ToServer");
static_assert(sizeof(DogTagManagerComponent_OnPickupDogTag_ToServer) == 0x000004, "Wrong size on DogTagManagerComponent_OnPickupDogTag_ToServer");
static_assert(offsetof(DogTagManagerComponent_OnPickupDogTag_ToServer, TeamId) == 0x000000, "Member 'DogTagManagerComponent_OnPickupDogTag_ToServer::TeamId' has a wrong offset!");
static_assert(offsetof(DogTagManagerComponent_OnPickupDogTag_ToServer, PlayerId) == 0x000002, "Member 'DogTagManagerComponent_OnPickupDogTag_ToServer::PlayerId' has a wrong offset!");

// Function InGameModule.DogTagManagerComponent.UnlockDogTag_ToClient
// 0x0004 (0x0004 - 0x0000)
struct DogTagManagerComponent_UnlockDogTag_ToClient final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x1];                                        // 0x0001(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int16                                         PlayrId;                                           // 0x0002(0x0002)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DogTagManagerComponent_UnlockDogTag_ToClient) == 0x000002, "Wrong alignment on DogTagManagerComponent_UnlockDogTag_ToClient");
static_assert(sizeof(DogTagManagerComponent_UnlockDogTag_ToClient) == 0x000004, "Wrong size on DogTagManagerComponent_UnlockDogTag_ToClient");
static_assert(offsetof(DogTagManagerComponent_UnlockDogTag_ToClient, TeamId) == 0x000000, "Member 'DogTagManagerComponent_UnlockDogTag_ToClient::TeamId' has a wrong offset!");
static_assert(offsetof(DogTagManagerComponent_UnlockDogTag_ToClient, PlayrId) == 0x000002, "Member 'DogTagManagerComponent_UnlockDogTag_ToClient::PlayrId' has a wrong offset!");

// Function InGameModule.DogTagManagerComponent.UnlockDogTag_ToServer
// 0x0004 (0x0004 - 0x0000)
struct DogTagManagerComponent_UnlockDogTag_ToServer final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x1];                                        // 0x0001(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int16                                         PlayrId;                                           // 0x0002(0x0002)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DogTagManagerComponent_UnlockDogTag_ToServer) == 0x000002, "Wrong alignment on DogTagManagerComponent_UnlockDogTag_ToServer");
static_assert(sizeof(DogTagManagerComponent_UnlockDogTag_ToServer) == 0x000004, "Wrong size on DogTagManagerComponent_UnlockDogTag_ToServer");
static_assert(offsetof(DogTagManagerComponent_UnlockDogTag_ToServer, TeamId) == 0x000000, "Member 'DogTagManagerComponent_UnlockDogTag_ToServer::TeamId' has a wrong offset!");
static_assert(offsetof(DogTagManagerComponent_UnlockDogTag_ToServer, PlayrId) == 0x000002, "Member 'DogTagManagerComponent_UnlockDogTag_ToServer::PlayrId' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.BP_PlayCameraShakeParam
// 0x0064 (0x0064 - 0x0000)
struct PlayerControllerBattle_BP_PlayCameraShakeParam final
{
public:
	struct FCameraShakerParam                     Param;                                             // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_BP_PlayCameraShakeParam) == 0x000004, "Wrong alignment on PlayerControllerBattle_BP_PlayCameraShakeParam");
static_assert(sizeof(PlayerControllerBattle_BP_PlayCameraShakeParam) == 0x000064, "Wrong size on PlayerControllerBattle_BP_PlayCameraShakeParam");
static_assert(offsetof(PlayerControllerBattle_BP_PlayCameraShakeParam, Param) == 0x000000, "Member 'PlayerControllerBattle_BP_PlayCameraShakeParam::Param' has a wrong offset!");
static_assert(offsetof(PlayerControllerBattle_BP_PlayCameraShakeParam, Scale) == 0x000060, "Member 'PlayerControllerBattle_BP_PlayCameraShakeParam::Scale' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.BP_SendViolationReport_CallServer
// 0x0001 (0x0001 - 0x0000)
struct PlayerControllerBattle_BP_SendViolationReport_CallServer final
{
public:
	EMdPenaltyType                                PenaltyReportType;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_BP_SendViolationReport_CallServer) == 0x000001, "Wrong alignment on PlayerControllerBattle_BP_SendViolationReport_CallServer");
static_assert(sizeof(PlayerControllerBattle_BP_SendViolationReport_CallServer) == 0x000001, "Wrong size on PlayerControllerBattle_BP_SendViolationReport_CallServer");
static_assert(offsetof(PlayerControllerBattle_BP_SendViolationReport_CallServer, PenaltyReportType) == 0x000000, "Member 'PlayerControllerBattle_BP_SendViolationReport_CallServer::PenaltyReportType' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.BP_ServerTravel
// 0x0010 (0x0010 - 0x0000)
struct PlayerControllerBattle_BP_ServerTravel final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_BP_ServerTravel) == 0x000008, "Wrong alignment on PlayerControllerBattle_BP_ServerTravel");
static_assert(sizeof(PlayerControllerBattle_BP_ServerTravel) == 0x000010, "Wrong size on PlayerControllerBattle_BP_ServerTravel");
static_assert(offsetof(PlayerControllerBattle_BP_ServerTravel, URL) == 0x000000, "Member 'PlayerControllerBattle_BP_ServerTravel::URL' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.ClientSetBattleResultData
// 0x0028 (0x0028 - 0x0000)
struct PlayerControllerBattle_ClientSetBattleResultData final
{
public:
	TArray<struct FBattleResultData>              Data;                                              // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FDropItemParamInfo>             DropItems;                                         // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bRetire;                                           // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PlayerControllerBattle_ClientSetBattleResultData) == 0x000008, "Wrong alignment on PlayerControllerBattle_ClientSetBattleResultData");
static_assert(sizeof(PlayerControllerBattle_ClientSetBattleResultData) == 0x000028, "Wrong size on PlayerControllerBattle_ClientSetBattleResultData");
static_assert(offsetof(PlayerControllerBattle_ClientSetBattleResultData, Data) == 0x000000, "Member 'PlayerControllerBattle_ClientSetBattleResultData::Data' has a wrong offset!");
static_assert(offsetof(PlayerControllerBattle_ClientSetBattleResultData, DropItems) == 0x000010, "Member 'PlayerControllerBattle_ClientSetBattleResultData::DropItems' has a wrong offset!");
static_assert(offsetof(PlayerControllerBattle_ClientSetBattleResultData, bRetire) == 0x000020, "Member 'PlayerControllerBattle_ClientSetBattleResultData::bRetire' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.DEBUG_DoEnvVfxCommandRPC_OnServer
// 0x0001 (0x0001 - 0x0000)
struct PlayerControllerBattle_DEBUG_DoEnvVfxCommandRPC_OnServer final
{
public:
	EDamageAttribute                              Element;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_DEBUG_DoEnvVfxCommandRPC_OnServer) == 0x000001, "Wrong alignment on PlayerControllerBattle_DEBUG_DoEnvVfxCommandRPC_OnServer");
static_assert(sizeof(PlayerControllerBattle_DEBUG_DoEnvVfxCommandRPC_OnServer) == 0x000001, "Wrong size on PlayerControllerBattle_DEBUG_DoEnvVfxCommandRPC_OnServer");
static_assert(offsetof(PlayerControllerBattle_DEBUG_DoEnvVfxCommandRPC_OnServer, Element) == 0x000000, "Member 'PlayerControllerBattle_DEBUG_DoEnvVfxCommandRPC_OnServer::Element' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.DEBUG_DoEnvVfxDebugCommand
// 0x0001 (0x0001 - 0x0000)
struct PlayerControllerBattle_DEBUG_DoEnvVfxDebugCommand final
{
public:
	EDamageAttribute                              Element;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_DEBUG_DoEnvVfxDebugCommand) == 0x000001, "Wrong alignment on PlayerControllerBattle_DEBUG_DoEnvVfxDebugCommand");
static_assert(sizeof(PlayerControllerBattle_DEBUG_DoEnvVfxDebugCommand) == 0x000001, "Wrong size on PlayerControllerBattle_DEBUG_DoEnvVfxDebugCommand");
static_assert(offsetof(PlayerControllerBattle_DEBUG_DoEnvVfxDebugCommand, Element) == 0x000000, "Member 'PlayerControllerBattle_DEBUG_DoEnvVfxDebugCommand::Element' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.DropItem_OnServer
// 0x0004 (0x0004 - 0x0000)
struct PlayerControllerBattle_DropItem_OnServer final
{
public:
	int32                                         DipIndex;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_DropItem_OnServer) == 0x000004, "Wrong alignment on PlayerControllerBattle_DropItem_OnServer");
static_assert(sizeof(PlayerControllerBattle_DropItem_OnServer) == 0x000004, "Wrong size on PlayerControllerBattle_DropItem_OnServer");
static_assert(offsetof(PlayerControllerBattle_DropItem_OnServer, DipIndex) == 0x000000, "Member 'PlayerControllerBattle_DropItem_OnServer::DipIndex' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.OnRemovePlayerStateSpectating
// 0x0010 (0x0010 - 0x0000)
struct PlayerControllerBattle_OnRemovePlayerStateSpectating final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PlayerControllerBattle_OnRemovePlayerStateSpectating) == 0x000008, "Wrong alignment on PlayerControllerBattle_OnRemovePlayerStateSpectating");
static_assert(sizeof(PlayerControllerBattle_OnRemovePlayerStateSpectating) == 0x000010, "Wrong size on PlayerControllerBattle_OnRemovePlayerStateSpectating");
static_assert(offsetof(PlayerControllerBattle_OnRemovePlayerStateSpectating, Actor) == 0x000000, "Member 'PlayerControllerBattle_OnRemovePlayerStateSpectating::Actor' has a wrong offset!");
static_assert(offsetof(PlayerControllerBattle_OnRemovePlayerStateSpectating, EndPlayReason) == 0x000008, "Member 'PlayerControllerBattle_OnRemovePlayerStateSpectating::EndPlayReason' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.RequestPlayerDataActivityStatus
// 0x0008 (0x0008 - 0x0000)
struct PlayerControllerBattle_RequestPlayerDataActivityStatus final
{
public:
	struct FUniqueNetIdKey                        UniqueId;                                          // 0x0000(0x0008)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_RequestPlayerDataActivityStatus) == 0x000004, "Wrong alignment on PlayerControllerBattle_RequestPlayerDataActivityStatus");
static_assert(sizeof(PlayerControllerBattle_RequestPlayerDataActivityStatus) == 0x000008, "Wrong size on PlayerControllerBattle_RequestPlayerDataActivityStatus");
static_assert(offsetof(PlayerControllerBattle_RequestPlayerDataActivityStatus, UniqueId) == 0x000000, "Member 'PlayerControllerBattle_RequestPlayerDataActivityStatus::UniqueId' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.SendCheer_OnServer
// 0x0018 (0x0018 - 0x0000)
struct PlayerControllerBattle_SendCheer_OnServer final
{
public:
	class APlayerStateBattle*                     SendCheerPlayerState;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerStateBattle*                     RecvCheerPlayerState;                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AddCheerCount;                                     // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PlayerControllerBattle_SendCheer_OnServer) == 0x000008, "Wrong alignment on PlayerControllerBattle_SendCheer_OnServer");
static_assert(sizeof(PlayerControllerBattle_SendCheer_OnServer) == 0x000018, "Wrong size on PlayerControllerBattle_SendCheer_OnServer");
static_assert(offsetof(PlayerControllerBattle_SendCheer_OnServer, SendCheerPlayerState) == 0x000000, "Member 'PlayerControllerBattle_SendCheer_OnServer::SendCheerPlayerState' has a wrong offset!");
static_assert(offsetof(PlayerControllerBattle_SendCheer_OnServer, RecvCheerPlayerState) == 0x000008, "Member 'PlayerControllerBattle_SendCheer_OnServer::RecvCheerPlayerState' has a wrong offset!");
static_assert(offsetof(PlayerControllerBattle_SendCheer_OnServer, AddCheerCount) == 0x000010, "Member 'PlayerControllerBattle_SendCheer_OnServer::AddCheerCount' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.SendPlayerDataActivityStatus
// 0x0020 (0x0020 - 0x0000)
struct PlayerControllerBattle_SendPlayerDataActivityStatus final
{
public:
	struct FPlayerDataActivityStatus              ScoreData;                                         // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_SendPlayerDataActivityStatus) == 0x000004, "Wrong alignment on PlayerControllerBattle_SendPlayerDataActivityStatus");
static_assert(sizeof(PlayerControllerBattle_SendPlayerDataActivityStatus) == 0x000020, "Wrong size on PlayerControllerBattle_SendPlayerDataActivityStatus");
static_assert(offsetof(PlayerControllerBattle_SendPlayerDataActivityStatus, ScoreData) == 0x000000, "Member 'PlayerControllerBattle_SendPlayerDataActivityStatus::ScoreData' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.SendViolationReport_OnServer
// 0x0028 (0x0028 - 0x0000)
struct PlayerControllerBattle_SendViolationReport_OnServer final
{
public:
	class FString                                 SendSelectedPlayerId;                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RecvSelectedPlayerId;                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMdPenaltyType                                PenaltyReportType;                                 // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PlayerControllerBattle_SendViolationReport_OnServer) == 0x000008, "Wrong alignment on PlayerControllerBattle_SendViolationReport_OnServer");
static_assert(sizeof(PlayerControllerBattle_SendViolationReport_OnServer) == 0x000028, "Wrong size on PlayerControllerBattle_SendViolationReport_OnServer");
static_assert(offsetof(PlayerControllerBattle_SendViolationReport_OnServer, SendSelectedPlayerId) == 0x000000, "Member 'PlayerControllerBattle_SendViolationReport_OnServer::SendSelectedPlayerId' has a wrong offset!");
static_assert(offsetof(PlayerControllerBattle_SendViolationReport_OnServer, RecvSelectedPlayerId) == 0x000010, "Member 'PlayerControllerBattle_SendViolationReport_OnServer::RecvSelectedPlayerId' has a wrong offset!");
static_assert(offsetof(PlayerControllerBattle_SendViolationReport_OnServer, PenaltyReportType) == 0x000020, "Member 'PlayerControllerBattle_SendViolationReport_OnServer::PenaltyReportType' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.SendViolationReport_OnServerDebug
// 0x0018 (0x0018 - 0x0000)
struct PlayerControllerBattle_SendViolationReport_OnServerDebug final
{
public:
	class FString                                 RecvSelectedPlayerId;                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMdPenaltyType                                PenaltyReportType;                                 // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PlayerControllerBattle_SendViolationReport_OnServerDebug) == 0x000008, "Wrong alignment on PlayerControllerBattle_SendViolationReport_OnServerDebug");
static_assert(sizeof(PlayerControllerBattle_SendViolationReport_OnServerDebug) == 0x000018, "Wrong size on PlayerControllerBattle_SendViolationReport_OnServerDebug");
static_assert(offsetof(PlayerControllerBattle_SendViolationReport_OnServerDebug, RecvSelectedPlayerId) == 0x000000, "Member 'PlayerControllerBattle_SendViolationReport_OnServerDebug::RecvSelectedPlayerId' has a wrong offset!");
static_assert(offsetof(PlayerControllerBattle_SendViolationReport_OnServerDebug, PenaltyReportType) == 0x000010, "Member 'PlayerControllerBattle_SendViolationReport_OnServerDebug::PenaltyReportType' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.ServerSpectatingChangePlayerView
// 0x0001 (0x0001 - 0x0000)
struct PlayerControllerBattle_ServerSpectatingChangePlayerView final
{
public:
	bool                                          bNext;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_ServerSpectatingChangePlayerView) == 0x000001, "Wrong alignment on PlayerControllerBattle_ServerSpectatingChangePlayerView");
static_assert(sizeof(PlayerControllerBattle_ServerSpectatingChangePlayerView) == 0x000001, "Wrong size on PlayerControllerBattle_ServerSpectatingChangePlayerView");
static_assert(offsetof(PlayerControllerBattle_ServerSpectatingChangePlayerView, bNext) == 0x000000, "Member 'PlayerControllerBattle_ServerSpectatingChangePlayerView::bNext' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.ServerTravelBattle
// 0x0020 (0x0020 - 0x0000)
struct PlayerControllerBattle_ServerTravelBattle final
{
public:
	class FString                                 InGameMode;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InStage;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_ServerTravelBattle) == 0x000008, "Wrong alignment on PlayerControllerBattle_ServerTravelBattle");
static_assert(sizeof(PlayerControllerBattle_ServerTravelBattle) == 0x000020, "Wrong size on PlayerControllerBattle_ServerTravelBattle");
static_assert(offsetof(PlayerControllerBattle_ServerTravelBattle, InGameMode) == 0x000000, "Member 'PlayerControllerBattle_ServerTravelBattle::InGameMode' has a wrong offset!");
static_assert(offsetof(PlayerControllerBattle_ServerTravelBattle, InStage) == 0x000010, "Member 'PlayerControllerBattle_ServerTravelBattle::InStage' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.StartBattle
// 0x0020 (0x0020 - 0x0000)
struct PlayerControllerBattle_StartBattle final
{
public:
	class FString                                 InGameMode;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InStage;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_StartBattle) == 0x000008, "Wrong alignment on PlayerControllerBattle_StartBattle");
static_assert(sizeof(PlayerControllerBattle_StartBattle) == 0x000020, "Wrong size on PlayerControllerBattle_StartBattle");
static_assert(offsetof(PlayerControllerBattle_StartBattle, InGameMode) == 0x000000, "Member 'PlayerControllerBattle_StartBattle::InGameMode' has a wrong offset!");
static_assert(offsetof(PlayerControllerBattle_StartBattle, InStage) == 0x000010, "Member 'PlayerControllerBattle_StartBattle::InStage' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.SwitchAbilityInfoVisibility
// 0x0001 (0x0001 - 0x0000)
struct PlayerControllerBattle_SwitchAbilityInfoVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_SwitchAbilityInfoVisibility) == 0x000001, "Wrong alignment on PlayerControllerBattle_SwitchAbilityInfoVisibility");
static_assert(sizeof(PlayerControllerBattle_SwitchAbilityInfoVisibility) == 0x000001, "Wrong size on PlayerControllerBattle_SwitchAbilityInfoVisibility");
static_assert(offsetof(PlayerControllerBattle_SwitchAbilityInfoVisibility, bVisible) == 0x000000, "Member 'PlayerControllerBattle_SwitchAbilityInfoVisibility::bVisible' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.SwitchAllyPlayerStatusInfo
// 0x0001 (0x0001 - 0x0000)
struct PlayerControllerBattle_SwitchAllyPlayerStatusInfo final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_SwitchAllyPlayerStatusInfo) == 0x000001, "Wrong alignment on PlayerControllerBattle_SwitchAllyPlayerStatusInfo");
static_assert(sizeof(PlayerControllerBattle_SwitchAllyPlayerStatusInfo) == 0x000001, "Wrong size on PlayerControllerBattle_SwitchAllyPlayerStatusInfo");
static_assert(offsetof(PlayerControllerBattle_SwitchAllyPlayerStatusInfo, bVisible) == 0x000000, "Member 'PlayerControllerBattle_SwitchAllyPlayerStatusInfo::bVisible' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.SwitchBattleCounterVisibility
// 0x0001 (0x0001 - 0x0000)
struct PlayerControllerBattle_SwitchBattleCounterVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_SwitchBattleCounterVisibility) == 0x000001, "Wrong alignment on PlayerControllerBattle_SwitchBattleCounterVisibility");
static_assert(sizeof(PlayerControllerBattle_SwitchBattleCounterVisibility) == 0x000001, "Wrong size on PlayerControllerBattle_SwitchBattleCounterVisibility");
static_assert(offsetof(PlayerControllerBattle_SwitchBattleCounterVisibility, bVisible) == 0x000000, "Member 'PlayerControllerBattle_SwitchBattleCounterVisibility::bVisible' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.SwitchCrossHairsVisibility
// 0x0001 (0x0001 - 0x0000)
struct PlayerControllerBattle_SwitchCrossHairsVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_SwitchCrossHairsVisibility) == 0x000001, "Wrong alignment on PlayerControllerBattle_SwitchCrossHairsVisibility");
static_assert(sizeof(PlayerControllerBattle_SwitchCrossHairsVisibility) == 0x000001, "Wrong size on PlayerControllerBattle_SwitchCrossHairsVisibility");
static_assert(offsetof(PlayerControllerBattle_SwitchCrossHairsVisibility, bVisible) == 0x000000, "Member 'PlayerControllerBattle_SwitchCrossHairsVisibility::bVisible' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.SwitchInGameButtonGuideVisibility
// 0x0001 (0x0001 - 0x0000)
struct PlayerControllerBattle_SwitchInGameButtonGuideVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_SwitchInGameButtonGuideVisibility) == 0x000001, "Wrong alignment on PlayerControllerBattle_SwitchInGameButtonGuideVisibility");
static_assert(sizeof(PlayerControllerBattle_SwitchInGameButtonGuideVisibility) == 0x000001, "Wrong size on PlayerControllerBattle_SwitchInGameButtonGuideVisibility");
static_assert(offsetof(PlayerControllerBattle_SwitchInGameButtonGuideVisibility, bVisible) == 0x000000, "Member 'PlayerControllerBattle_SwitchInGameButtonGuideVisibility::bVisible' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.SwitchLocalPlayerStatusInfo
// 0x0001 (0x0001 - 0x0000)
struct PlayerControllerBattle_SwitchLocalPlayerStatusInfo final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_SwitchLocalPlayerStatusInfo) == 0x000001, "Wrong alignment on PlayerControllerBattle_SwitchLocalPlayerStatusInfo");
static_assert(sizeof(PlayerControllerBattle_SwitchLocalPlayerStatusInfo) == 0x000001, "Wrong size on PlayerControllerBattle_SwitchLocalPlayerStatusInfo");
static_assert(offsetof(PlayerControllerBattle_SwitchLocalPlayerStatusInfo, bVisible) == 0x000000, "Member 'PlayerControllerBattle_SwitchLocalPlayerStatusInfo::bVisible' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.SwitchLvUpShortCutVisibility
// 0x0001 (0x0001 - 0x0000)
struct PlayerControllerBattle_SwitchLvUpShortCutVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_SwitchLvUpShortCutVisibility) == 0x000001, "Wrong alignment on PlayerControllerBattle_SwitchLvUpShortCutVisibility");
static_assert(sizeof(PlayerControllerBattle_SwitchLvUpShortCutVisibility) == 0x000001, "Wrong size on PlayerControllerBattle_SwitchLvUpShortCutVisibility");
static_assert(offsetof(PlayerControllerBattle_SwitchLvUpShortCutVisibility, bVisible) == 0x000000, "Member 'PlayerControllerBattle_SwitchLvUpShortCutVisibility::bVisible' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.SwitchMiscInfoVisibility
// 0x0001 (0x0001 - 0x0000)
struct PlayerControllerBattle_SwitchMiscInfoVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_SwitchMiscInfoVisibility) == 0x000001, "Wrong alignment on PlayerControllerBattle_SwitchMiscInfoVisibility");
static_assert(sizeof(PlayerControllerBattle_SwitchMiscInfoVisibility) == 0x000001, "Wrong size on PlayerControllerBattle_SwitchMiscInfoVisibility");
static_assert(offsetof(PlayerControllerBattle_SwitchMiscInfoVisibility, bVisible) == 0x000000, "Member 'PlayerControllerBattle_SwitchMiscInfoVisibility::bVisible' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.SwitchPlusUltraVisibility
// 0x0001 (0x0001 - 0x0000)
struct PlayerControllerBattle_SwitchPlusUltraVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_SwitchPlusUltraVisibility) == 0x000001, "Wrong alignment on PlayerControllerBattle_SwitchPlusUltraVisibility");
static_assert(sizeof(PlayerControllerBattle_SwitchPlusUltraVisibility) == 0x000001, "Wrong size on PlayerControllerBattle_SwitchPlusUltraVisibility");
static_assert(offsetof(PlayerControllerBattle_SwitchPlusUltraVisibility, bVisible) == 0x000000, "Member 'PlayerControllerBattle_SwitchPlusUltraVisibility::bVisible' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.SwitchShortcutInfoVisibility
// 0x0001 (0x0001 - 0x0000)
struct PlayerControllerBattle_SwitchShortcutInfoVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_SwitchShortcutInfoVisibility) == 0x000001, "Wrong alignment on PlayerControllerBattle_SwitchShortcutInfoVisibility");
static_assert(sizeof(PlayerControllerBattle_SwitchShortcutInfoVisibility) == 0x000001, "Wrong size on PlayerControllerBattle_SwitchShortcutInfoVisibility");
static_assert(offsetof(PlayerControllerBattle_SwitchShortcutInfoVisibility, bVisible) == 0x000000, "Member 'PlayerControllerBattle_SwitchShortcutInfoVisibility::bVisible' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.BP_GetCommandHUDControlComponent
// 0x0008 (0x0008 - 0x0000)
struct PlayerControllerBattle_BP_GetCommandHUDControlComponent final
{
public:
	class UHudCommandControlComponent*            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_BP_GetCommandHUDControlComponent) == 0x000008, "Wrong alignment on PlayerControllerBattle_BP_GetCommandHUDControlComponent");
static_assert(sizeof(PlayerControllerBattle_BP_GetCommandHUDControlComponent) == 0x000008, "Wrong size on PlayerControllerBattle_BP_GetCommandHUDControlComponent");
static_assert(offsetof(PlayerControllerBattle_BP_GetCommandHUDControlComponent, ReturnValue) == 0x000000, "Member 'PlayerControllerBattle_BP_GetCommandHUDControlComponent::ReturnValue' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.BP_GetControlledCharacter
// 0x0008 (0x0008 - 0x0000)
struct PlayerControllerBattle_BP_GetControlledCharacter final
{
public:
	class ACharacterBattle*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_BP_GetControlledCharacter) == 0x000008, "Wrong alignment on PlayerControllerBattle_BP_GetControlledCharacter");
static_assert(sizeof(PlayerControllerBattle_BP_GetControlledCharacter) == 0x000008, "Wrong size on PlayerControllerBattle_BP_GetControlledCharacter");
static_assert(offsetof(PlayerControllerBattle_BP_GetControlledCharacter, ReturnValue) == 0x000000, "Member 'PlayerControllerBattle_BP_GetControlledCharacter::ReturnValue' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.GetCommentaryVoiceComponent
// 0x0008 (0x0008 - 0x0000)
struct PlayerControllerBattle_GetCommentaryVoiceComponent final
{
public:
	class UCommentaryVoiceComponent*              ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_GetCommentaryVoiceComponent) == 0x000008, "Wrong alignment on PlayerControllerBattle_GetCommentaryVoiceComponent");
static_assert(sizeof(PlayerControllerBattle_GetCommentaryVoiceComponent) == 0x000008, "Wrong size on PlayerControllerBattle_GetCommentaryVoiceComponent");
static_assert(offsetof(PlayerControllerBattle_GetCommentaryVoiceComponent, ReturnValue) == 0x000000, "Member 'PlayerControllerBattle_GetCommentaryVoiceComponent::ReturnValue' has a wrong offset!");

// Function InGameModule.PlayerControllerBattle.ServerTravel
// 0x0010 (0x0010 - 0x0000)
struct PlayerControllerBattle_ServerTravel final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerControllerBattle_ServerTravel) == 0x000008, "Wrong alignment on PlayerControllerBattle_ServerTravel");
static_assert(sizeof(PlayerControllerBattle_ServerTravel) == 0x000010, "Wrong size on PlayerControllerBattle_ServerTravel");
static_assert(offsetof(PlayerControllerBattle_ServerTravel, URL) == 0x000000, "Member 'PlayerControllerBattle_ServerTravel::URL' has a wrong offset!");

// Function InGameModule.SupplyActorBase.OnCollapseInAirEvent
// 0x0008 (0x0008 - 0x0000)
struct SupplyActorBase_OnCollapseInAirEvent final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SupplyActorBase_OnCollapseInAirEvent) == 0x000008, "Wrong alignment on SupplyActorBase_OnCollapseInAirEvent");
static_assert(sizeof(SupplyActorBase_OnCollapseInAirEvent) == 0x000008, "Wrong size on SupplyActorBase_OnCollapseInAirEvent");
static_assert(offsetof(SupplyActorBase_OnCollapseInAirEvent, Actor) == 0x000000, "Member 'SupplyActorBase_OnCollapseInAirEvent::Actor' has a wrong offset!");

// Function InGameModule.ItemBase.OnInteractToClient_RPC
// 0x0008 (0x0008 - 0x0000)
struct ItemBase_OnInteractToClient_RPC final
{
public:
	class APlayerState*                           PalyerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ItemBase_OnInteractToClient_RPC) == 0x000008, "Wrong alignment on ItemBase_OnInteractToClient_RPC");
static_assert(sizeof(ItemBase_OnInteractToClient_RPC) == 0x000008, "Wrong size on ItemBase_OnInteractToClient_RPC");
static_assert(offsetof(ItemBase_OnInteractToClient_RPC, PalyerState) == 0x000000, "Member 'ItemBase_OnInteractToClient_RPC::PalyerState' has a wrong offset!");

// Function InGameModule.BattleBriefingSignalPinWidget.CommitPin
// 0x000C (0x000C - 0x0000)
struct BattleBriefingSignalPinWidget_CommitPin final
{
public:
	struct FVector2D                              PinUpPosition;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlert;                                            // 0x0008(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BattleBriefingSignalPinWidget_CommitPin) == 0x000004, "Wrong alignment on BattleBriefingSignalPinWidget_CommitPin");
static_assert(sizeof(BattleBriefingSignalPinWidget_CommitPin) == 0x00000C, "Wrong size on BattleBriefingSignalPinWidget_CommitPin");
static_assert(offsetof(BattleBriefingSignalPinWidget_CommitPin, PinUpPosition) == 0x000000, "Member 'BattleBriefingSignalPinWidget_CommitPin::PinUpPosition' has a wrong offset!");
static_assert(offsetof(BattleBriefingSignalPinWidget_CommitPin, bAlert) == 0x000008, "Member 'BattleBriefingSignalPinWidget_CommitPin::bAlert' has a wrong offset!");

// DelegateFunction InGameModule.BattleBriefingSignalPinWidget.CommitPinDelegate__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BattleBriefingSignalPinWidget_CommitPinDelegate__DelegateSignature final
{
public:
	bool                                          bAlert;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattleBriefingSignalPinWidget_CommitPinDelegate__DelegateSignature) == 0x000001, "Wrong alignment on BattleBriefingSignalPinWidget_CommitPinDelegate__DelegateSignature");
static_assert(sizeof(BattleBriefingSignalPinWidget_CommitPinDelegate__DelegateSignature) == 0x000001, "Wrong size on BattleBriefingSignalPinWidget_CommitPinDelegate__DelegateSignature");
static_assert(offsetof(BattleBriefingSignalPinWidget_CommitPinDelegate__DelegateSignature, bAlert) == 0x000000, "Member 'BattleBriefingSignalPinWidget_CommitPinDelegate__DelegateSignature::bAlert' has a wrong offset!");

// Function InGameModule.AbilityIconWidget.BP_SetAvility
// 0x0008 (0x0008 - 0x0000)
struct AbilityIconWidget_BP_SetAvility final
{
public:
	ECharacterId                                  CharacterId;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttackId                                     AttackId;                                          // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VariationNo;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityIconWidget_BP_SetAvility) == 0x000004, "Wrong alignment on AbilityIconWidget_BP_SetAvility");
static_assert(sizeof(AbilityIconWidget_BP_SetAvility) == 0x000008, "Wrong size on AbilityIconWidget_BP_SetAvility");
static_assert(offsetof(AbilityIconWidget_BP_SetAvility, CharacterId) == 0x000000, "Member 'AbilityIconWidget_BP_SetAvility::CharacterId' has a wrong offset!");
static_assert(offsetof(AbilityIconWidget_BP_SetAvility, AttackId) == 0x000001, "Member 'AbilityIconWidget_BP_SetAvility::AttackId' has a wrong offset!");
static_assert(offsetof(AbilityIconWidget_BP_SetAvility, VariationNo) == 0x000004, "Member 'AbilityIconWidget_BP_SetAvility::VariationNo' has a wrong offset!");

// Function InGameModule.AbilityIconWidget.BP_SetLevel
// 0x0004 (0x0004 - 0x0000)
struct AbilityIconWidget_BP_SetLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityIconWidget_BP_SetLevel) == 0x000004, "Wrong alignment on AbilityIconWidget_BP_SetLevel");
static_assert(sizeof(AbilityIconWidget_BP_SetLevel) == 0x000004, "Wrong size on AbilityIconWidget_BP_SetLevel");
static_assert(offsetof(AbilityIconWidget_BP_SetLevel, Level) == 0x000000, "Member 'AbilityIconWidget_BP_SetLevel::Level' has a wrong offset!");

// Function InGameModule.AbilityInfoWidget.FinishedAbilityTime
// 0x0008 (0x0008 - 0x0000)
struct AbilityInfoWidget_FinishedAbilityTime final
{
public:
	class UAbilityHolder*                         FinishedAbilityHolder;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityInfoWidget_FinishedAbilityTime) == 0x000008, "Wrong alignment on AbilityInfoWidget_FinishedAbilityTime");
static_assert(sizeof(AbilityInfoWidget_FinishedAbilityTime) == 0x000008, "Wrong size on AbilityInfoWidget_FinishedAbilityTime");
static_assert(offsetof(AbilityInfoWidget_FinishedAbilityTime, FinishedAbilityHolder) == 0x000000, "Member 'AbilityInfoWidget_FinishedAbilityTime::FinishedAbilityHolder' has a wrong offset!");

// Function InGameModule.AbilityInfoWidget.PlayAbilitySetAnimation
// 0x0008 (0x0008 - 0x0000)
struct AbilityInfoWidget_PlayAbilitySetAnimation final
{
public:
	class USupply*                                NewSupply;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityInfoWidget_PlayAbilitySetAnimation) == 0x000008, "Wrong alignment on AbilityInfoWidget_PlayAbilitySetAnimation");
static_assert(sizeof(AbilityInfoWidget_PlayAbilitySetAnimation) == 0x000008, "Wrong size on AbilityInfoWidget_PlayAbilitySetAnimation");
static_assert(offsetof(AbilityInfoWidget_PlayAbilitySetAnimation, NewSupply) == 0x000000, "Member 'AbilityInfoWidget_PlayAbilitySetAnimation::NewSupply' has a wrong offset!");

// Function InGameModule.AbilityInfoWidget.StartAbilityTimer
// 0x0008 (0x0008 - 0x0000)
struct AbilityInfoWidget_StartAbilityTimer final
{
public:
	class UAbilityHolder*                         beganAbilityHolder;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityInfoWidget_StartAbilityTimer) == 0x000008, "Wrong alignment on AbilityInfoWidget_StartAbilityTimer");
static_assert(sizeof(AbilityInfoWidget_StartAbilityTimer) == 0x000008, "Wrong size on AbilityInfoWidget_StartAbilityTimer");
static_assert(offsetof(AbilityInfoWidget_StartAbilityTimer, beganAbilityHolder) == 0x000000, "Member 'AbilityInfoWidget_StartAbilityTimer::beganAbilityHolder' has a wrong offset!");

// Function InGameModule.AbilityInfoWidget.UpdateEventAbility
// 0x0008 (0x0008 - 0x0000)
struct AbilityInfoWidget_UpdateEventAbility final
{
public:
	class USupply*                                NewSupply;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityInfoWidget_UpdateEventAbility) == 0x000008, "Wrong alignment on AbilityInfoWidget_UpdateEventAbility");
static_assert(sizeof(AbilityInfoWidget_UpdateEventAbility) == 0x000008, "Wrong size on AbilityInfoWidget_UpdateEventAbility");
static_assert(offsetof(AbilityInfoWidget_UpdateEventAbility, NewSupply) == 0x000000, "Member 'AbilityInfoWidget_UpdateEventAbility::NewSupply' has a wrong offset!");

// Function InGameModule.AbilityLevelCounter.SetLevel
// 0x0004 (0x0004 - 0x0000)
struct AbilityLevelCounter_SetLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityLevelCounter_SetLevel) == 0x000004, "Wrong alignment on AbilityLevelCounter_SetLevel");
static_assert(sizeof(AbilityLevelCounter_SetLevel) == 0x000004, "Wrong size on AbilityLevelCounter_SetLevel");
static_assert(offsetof(AbilityLevelCounter_SetLevel, Level) == 0x000000, "Member 'AbilityLevelCounter_SetLevel::Level' has a wrong offset!");

// Function InGameModule.ActionBattleBase.BP_ActionPingDelay
// 0x0020 (0x0020 - 0x0000)
struct ActionBattleBase_BP_ActionPingDelay final
{
public:
	bool                                          bWaitForSpecificPing;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TargetPing;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActionBattleBase_BP_ActionPingDelay) == 0x000008, "Wrong alignment on ActionBattleBase_BP_ActionPingDelay");
static_assert(sizeof(ActionBattleBase_BP_ActionPingDelay) == 0x000020, "Wrong size on ActionBattleBase_BP_ActionPingDelay");
static_assert(offsetof(ActionBattleBase_BP_ActionPingDelay, bWaitForSpecificPing) == 0x000000, "Member 'ActionBattleBase_BP_ActionPingDelay::bWaitForSpecificPing' has a wrong offset!");
static_assert(offsetof(ActionBattleBase_BP_ActionPingDelay, TargetPing) == 0x000004, "Member 'ActionBattleBase_BP_ActionPingDelay::TargetPing' has a wrong offset!");
static_assert(offsetof(ActionBattleBase_BP_ActionPingDelay, LatentInfo) == 0x000008, "Member 'ActionBattleBase_BP_ActionPingDelay::LatentInfo' has a wrong offset!");

// Function InGameModule.ActionBattleBase.BP_AddUniqueUseCount
// 0x0004 (0x0004 - 0x0000)
struct ActionBattleBase_BP_AddUniqueUseCount final
{
public:
	int32                                         UniqueNum;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActionBattleBase_BP_AddUniqueUseCount) == 0x000004, "Wrong alignment on ActionBattleBase_BP_AddUniqueUseCount");
static_assert(sizeof(ActionBattleBase_BP_AddUniqueUseCount) == 0x000004, "Wrong size on ActionBattleBase_BP_AddUniqueUseCount");
static_assert(offsetof(ActionBattleBase_BP_AddUniqueUseCount, UniqueNum) == 0x000000, "Member 'ActionBattleBase_BP_AddUniqueUseCount::UniqueNum' has a wrong offset!");

// Function InGameModule.ActionBattleBase.BP_AnimEndDelay
// 0x0020 (0x0020 - 0x0000)
struct ActionBattleBase_BP_AnimEndDelay final
{
public:
	EAnimationSlot                                Slot;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OnBlendOut;                                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActionBattleBase_BP_AnimEndDelay) == 0x000008, "Wrong alignment on ActionBattleBase_BP_AnimEndDelay");
static_assert(sizeof(ActionBattleBase_BP_AnimEndDelay) == 0x000020, "Wrong size on ActionBattleBase_BP_AnimEndDelay");
static_assert(offsetof(ActionBattleBase_BP_AnimEndDelay, Slot) == 0x000000, "Member 'ActionBattleBase_BP_AnimEndDelay::Slot' has a wrong offset!");
static_assert(offsetof(ActionBattleBase_BP_AnimEndDelay, OnBlendOut) == 0x000001, "Member 'ActionBattleBase_BP_AnimEndDelay::OnBlendOut' has a wrong offset!");
static_assert(offsetof(ActionBattleBase_BP_AnimEndDelay, LatentInfo) == 0x000008, "Member 'ActionBattleBase_BP_AnimEndDelay::LatentInfo' has a wrong offset!");

// Function InGameModule.ActionBattleBase.BP_ClearCenterRotation
// 0x0004 (0x0004 - 0x0000)
struct ActionBattleBase_BP_ClearCenterRotation final
{
public:
	float                                         ReverseRate;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActionBattleBase_BP_ClearCenterRotation) == 0x000004, "Wrong alignment on ActionBattleBase_BP_ClearCenterRotation");
static_assert(sizeof(ActionBattleBase_BP_ClearCenterRotation) == 0x000004, "Wrong size on ActionBattleBase_BP_ClearCenterRotation");
static_assert(offsetof(ActionBattleBase_BP_ClearCenterRotation, ReverseRate) == 0x000000, "Member 'ActionBattleBase_BP_ClearCenterRotation::ReverseRate' has a wrong offset!");

// Function InGameModule.ActionBattleBase.BP_CommandDelay
// 0x0020 (0x0020 - 0x0000)
struct ActionBattleBase_BP_CommandDelay final
{
public:
	ECommandId                                    CommandID;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActionBattleBase_BP_CommandDelay) == 0x000008, "Wrong alignment on ActionBattleBase_BP_CommandDelay");
static_assert(sizeof(ActionBattleBase_BP_CommandDelay) == 0x000020, "Wrong size on ActionBattleBase_BP_CommandDelay");
static_assert(offsetof(ActionBattleBase_BP_CommandDelay, CommandID) == 0x000000, "Member 'ActionBattleBase_BP_CommandDelay::CommandID' has a wrong offset!");
static_assert(offsetof(ActionBattleBase_BP_CommandDelay, LatentInfo) == 0x000008, "Member 'ActionBattleBase_BP_CommandDelay::LatentInfo' has a wrong offset!");

// Function InGameModule.ActionBattleBase.BP_NegotiationDelay
// 0x0020 (0x0020 - 0x0000)
struct ActionBattleBase_BP_NegotiationDelay final
{
public:
	float                                         MaxDuration;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
