#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MasterDataModule

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum MasterDataModule.EMdKpiSupplyType
// NumValues: 0x0006
enum class EMdKpiSupplyType : uint8
{
	Invalid                                  = 0,
	USE_COUNT                                = 1,
	PICK_COUNT                               = 2,
	OPEN_COUNT                               = 3,
	CITIZEN_ACTION_COUNT                     = 4,
	Max                                      = 5,
};

// Enum MasterDataModule.EMdPenaltyType
// NumValues: 0x000E
enum class EMdPenaltyType : uint8
{
	Invalid                                  = 0,
	ReportedProfile                          = 1,
	ReportedCheatTool                        = 2,
	ReportedHarassment                       = 3,
	ReportedVoiceChat                        = 4,
	ReportedTextChat                         = 5,
	Reported6Times                           = 6,
	Disconnected                             = 7,
	Disconnected3Times                       = 8,
	IntentionalRetire                        = 9,
	ReportedGuildProfile                     = 10,
	DetectionedCheat                         = 11,
	CustomMatchingSpoofCheat                 = 12,
	Max                                      = 13,
};

// Enum MasterDataModule.EMdRarity
// NumValues: 0x0006
enum class EMdRarity : uint8
{
	Invalid                                  = 0,
	C                                        = 1,
	R                                        = 2,
	SR                                       = 3,
	SSR                                      = 4,
	Max                                      = 5,
};

// Enum MasterDataModule.EMdRarityItemCategory
// NumValues: 0x0008
enum class EMdRarityItemCategory : uint8
{
	Invalid                                  = 0,
	COSTUME                                  = 1,
	EMOTE                                    = 2,
	VOICE                                    = 3,
	CURRENCY                                 = 4,
	CHARACTER                                = 5,
	VARIATION                                = 6,
	Max                                      = 7,
};

// Enum MasterDataModule.EMdMissionTransition
// NumValues: 0x0011
enum class EMdMissionTransition : uint8
{
	Invalid                                  = 0,
	NO_TRANSITION                            = 1,
	DAILY                                    = 2,
	WEEKLY                                   = 3,
	BATTLE                                   = 4,
	TRAINING                                 = 5,
	MY_PROFILE                               = 6,
	MY_AD                                    = 7,
	FRIEND_LIST                              = 8,
	SHOP                                     = 9,
	GUILD                                    = 10,
	RANKING                                  = 11,
	ACCOUNT_LINKAGE                          = 12,
	SETTING                                  = 13,
	PRESET                                   = 14,
	GASHA                                    = 15,
	Max                                      = 16,
};

// Enum MasterDataModule.EMdPlayMenuHamburgerMenuList
// NumValues: 0x0018
enum class EMdPlayMenuHamburgerMenuList : uint8
{
	Invalid                                  = 0,
	PROFILE                                  = 1,
	GALLERY                                  = 2,
	RANKING                                  = 3,
	GUILD                                    = 4,
	SETTING                                  = 5,
	NOTICE                                   = 6,
	HELP                                     = 7,
	INQUIRIES                                = 8,
	ACCOUNT_LINKAGE                          = 9,
	GASHA_HISTORY                            = 10,
	ABOUT_PAID_COINS                         = 11,
	COPYRIGHT                                = 12,
	RETURN_TITLE                             = 13,
	EXIT_GAME                                = 14,
	TERMS_OF_SERVICE                         = 15,
	PRIVACY_POLICY                           = 16,
	ABOUT_DATA_USAGE                         = 17,
	SPECIFIED_COMMERCIAL_TRANSACTION_LAW     = 18,
	ACT_ON_SETTLEMENT                        = 19,
	VERSION_WINDOW                           = 20,
	STAFFROLL                                = 21,
	LOGIN_BONUS                              = 22,
	Max                                      = 23,
};

// Enum MasterDataModule.EMdMissionType
// NumValues: 0x0004
enum class EMdMissionType : uint8
{
	Invalid                                  = 0,
	BATTLE                                   = 1,
	SYSTEM                                   = 2,
	Max                                      = 3,
};

// Enum MasterDataModule.EMdMissionCategory
// NumValues: 0x0007
enum class EMdMissionCategory : uint8
{
	Invalid                                  = 0,
	DAILY                                    = 1,
	WEEKLY                                   = 2,
	SEASON                                   = 3,
	SPECIAL                                  = 4,
	EVENT                                    = 5,
	Max                                      = 6,
};

// Enum MasterDataModule.EMdCharacterAssign
// NumValues: 0x0005
enum class EMdCharacterAssign : uint8
{
	Invalid                                  = 0,
	Undef                                    = 1,
	HERO                                     = 2,
	VILLAIN                                  = 3,
	Max                                      = 4,
};

// Enum MasterDataModule.EMdCharacterCategory
// NumValues: 0x000C
enum class EMdCharacterCategory : uint8
{
	Invalid                                  = 0,
	Undef                                    = 1,
	YueiHighSchool1stA                       = 2,
	YueiHighSchool1stB                       = 3,
	YueiHighSchoolStudent                    = 4,
	YueiHighSchoolTeacher                    = 5,
	ProfessionalHero                         = 6,
	VillainUnion                             = 7,
	Villain                                  = 8,
	ShieHassaiKai                            = 9,
	Avatar                                   = 10,
	Max                                      = 11,
};

// Enum MasterDataModule.EMdMatchType
// NumValues: 0x0004
enum class EMdMatchType : uint8
{
	Invalid                                  = 0,
	NORMAL_MATCH                             = 1,
	RANK_MATCH                               = 2,
	Max                                      = 3,
};

// Enum MasterDataModule.EMdExpType
// NumValues: 0x0004
enum class EMdExpType : uint8
{
	Invalid                                  = 0,
	PLAYER_LEVEL                             = 1,
	SEASON_PASS                              = 2,
	Max                                      = 3,
};

// Enum MasterDataModule.EMdBonusExpTargetType
// NumValues: 0x0009
enum class EMdBonusExpTargetType : uint8
{
	Invalid                                  = 0,
	GUILD_RESCUE_FACILITY_LEVEL              = 1,
	GUILD_TRAINING_FACILITY_LEVEL            = 2,
	GUILD_BUSINESS_FACILITY_LEVEL            = 3,
	GUILD_LICENSE_EXP_BOOST                  = 4,
	TEAM_FRIEND_COUNT                        = 5,
	TEAM_GUILD_MEMBER_COUNT                  = 6,
	EVENT                                    = 7,
	Max                                      = 8,
};

// Enum MasterDataModule.EMdCalcType
// NumValues: 0x0007
enum class EMdCalcType : uint8
{
	Invalid                                  = 0,
	CONST_VALUE                              = 1,
	ADD                                      = 2,
	SUB                                      = 3,
	SUB_RATIO                                = 4,
	MULT                                     = 5,
	Max                                      = 6,
};

// Enum MasterDataModule.EMdRankTargetType
// NumValues: 0x000B
enum class EMdRankTargetType : uint8
{
	Invalid                                  = 0,
	DAMAGE                                   = 1,
	KO_COUNT                                 = 2,
	TEAM_KO_COUNT                            = 3,
	KO_ASSIST_COUNT                          = 4,
	SCORE_RANKING                            = 5,
	TEAM_RANKING                             = 6,
	PHASE_TOP_COUNT                          = 7,
	SUPPORT_POINT                            = 8,
	ENTRY_COST                               = 9,
	Max                                      = 10,
};

// Enum MasterDataModule.EMdScoreRank
// NumValues: 0x0007
enum class EMdScoreRank : uint8
{
	Invalid                                  = 0,
	D                                        = 1,
	C                                        = 2,
	B                                        = 3,
	A                                        = 4,
	S                                        = 5,
	Max                                      = 6,
};

// Enum MasterDataModule.EMdGameMode
// NumValues: 0x000D
enum class EMdGameMode : uint8
{
	Invalid                                  = 0,
	COMMON                                   = 1,
	TEAM_BATTLE                              = 2,
	SQUAD_BATTLE                             = 3,
	SQUAD_BATTLE_2                           = 4,
	SQUAD_KINGS_BATTLE                       = 5,
	TEAM_ORB_BATTLE                          = 6,
	TRAINING                                 = 7,
	TUTORIAL                                 = 8,
	CPU_BSQUAD_BATTLE                        = 9,
	SOLO_BATTLE                              = 10,
	CUSTOM_MATCH                             = 11,
	Max                                      = 12,
};

// Enum MasterDataModule.EMdMissionTargetType
// NumValues: 0x0059
enum class EMdMissionTargetType : uint8
{
	Invalid                                  = 0,
	TOTAL_BATTLE_COUNT                       = 1,
	TOTAL_DESIGNATION_TEAM_BATTLE_COUNT      = 2,
	TOTAL_LIFE_TIME                          = 3,
	TOTAL_KO_COUNT                           = 4,
	TOTAL_SPECIAL_ACTION_KO_COUNT            = 5,
	TOTAL_ANNIHILATION_KO_TEAM_COUNT         = 6,
	TOTAL_DOWN_COUNT                         = 7,
	HERO_DOWN_VILLAIN                        = 8,
	VILLAIN_DOWN_HERO                        = 9,
	TOTAL_DESIGNATION_DISTANCE_DOWN_COUNT    = 10,
	TOTAL_DAMAGE                             = 11,
	TOTAL_PROTECT_DAMAGE                     = 12,
	TOTAL_PROTECT_HIT_COUNT                  = 13,
	TOTAL_MOVE_DISTANCE                      = 14,
	TOTAL_SPECIAL_ACTION_MOVE_DISTANCE       = 15,
	TOTAL_USE_SKILL_COUNT                    = 16,
	TOTAL_ABNORMAL_CONDITION_COUNT           = 17,
	TOTAL_GIVE_ABNORMAL_CONDITION_COUNT      = 18,
	TOTAL_ABNORMAL_CONDITION_DAMAGE          = 19,
	TOTAL_USE_ABILITY_COUNT                  = 20,
	TOTAL_SKILL_LEVEL_COUNT                  = 21,
	TOTAL_SPECIAL_ACTION_COUNT               = 22,
	TOTAL_CHAMPION_COUNT                     = 23,
	TOTAL_CHAMPION_CHARACTER_COUNT           = 24,
	TOTAL_CONTINUE_CHAMPION_COUNT            = 25,
	TOTAL_KO_CHAMPION_COUNT                  = 26,
	TOTAL_FRIEND_TEAM_CHAMPION_COUNT         = 27,
	TOTAL_GUILD_TEAM_CHAMPION_COUNT          = 28,
	TOTAL_NO_DOWN_CHAMPION_COUNT             = 29,
	TOTAL_NO_DOWN_TEAM_CHAMPION_COUNT        = 30,
	TOTAL_NO_KO_CHAMPION_COUNT               = 31,
	TOTAL_NO_KO_TEAM_CHAMPION_COUNT          = 32,
	TOTAL_SCORE_TOP_COUNT                    = 33,
	TOTAL_DAMAGE_PHASE_TOP_COUNT             = 34,
	TOTAL_KO_PHASE_TOP_COUNT                 = 35,
	TOTAL_CITIZEN_ACTION_PHASE_TOP_COUNT     = 36,
	TOTAL_SUPPLY_SUPPORT_PHASE_TOP_COUNT     = 37,
	TOTAL_RECOVERY_HP_COUNT                  = 38,
	TOTAL_RECOVERY_HP_VALUE                  = 39,
	TOTAL_RECOVERY_SUPPORT_HP_COUNT          = 40,
	TOTAL_RECOVERY_SUPPORT_HP_VALUE          = 41,
	TOTAL_RECOVERY_GP_COUNT                  = 42,
	TOTAL_RECOVERY_GP_VALUE                  = 43,
	TOTAL_RECOVERY_SUPPORT_GP_COUNT          = 44,
	TOTAL_RECOVERY_SUPPORT_GP_VALUE          = 45,
	TOTAL_CITIZEN_ACTION_COUNT               = 46,
	TOTAL_BATTLE_ENTER_TOP_COUNT             = 47,
	TOTAL_GET_SUPPLY_COUNT                   = 48,
	TOTAL_OPEN_SUPPLY_BOX_COUNT              = 49,
	TOTAL_BREAK_BUILDING_COUNT               = 50,
	TOTAL_BURN_TREE_COUNT                    = 51,
	TOTAL_RESCUE_COUNT                       = 52,
	TOTAL_SPECIAL_ACTION_RESCUE_COUNT        = 53,
	TOTAL_HIT_COUNT                          = 54,
	TOTAL_ABNORMAL_CONDITION_SKILL_HIT_COUNT = 55,
	TOTAL_COSTUME_COUNT                      = 56,
	LOGIN_OPERATING_DAY_COUNT                = 57,
	TOTAL_GASHA_COUNT                        = 58,
	TOTAL_FRIEND_COUNT                       = 59,
	TOTAL_GET_GOLD                           = 60,
	TOTAL_USE_GOLD                           = 61,
	EMBLEM_GET                               = 62,
	CHARACTER_GET                            = 63,
	CHANGE_COSTUME_COUNT                     = 64,
	RANK_UP                                  = 65,
	PLAYER_LEVEL                             = 66,
	RELEASE_GALLERY_ILLUSTRATION             = 67,
	GIVE_LIKE                                = 68,
	PRESET_USE                               = 69,
	CREATE_AD                                = 70,
	CREATE_AVATAR                            = 71,
	DEFEAT_BATTLE                            = 72,
	EVENT_POINT                              = 73,
	DAILY_CLEAR_WEEKLY                       = 74,
	WEEKLY_CLEAR_COUNT                       = 75,
	TRADE_SPLINTER_ITEM                      = 76,
	TUTORIAL_END                             = 77,
	LINK_ACCOUNT                             = 78,
	POSSESSION_EMOTE                         = 79,
	POSSESSION_VOICE                         = 80,
	POSSESSION_AD_PARTS                      = 81,
	POSSESSION_AVATAR_PARTS                  = 82,
	TOTAL_RANK_CHAMPION_COUNT                = 83,
	TOTAL_RANK_KO_COUNT                      = 84,
	TOTAL_RANK_SCORE_TOP_COUNT               = 85,
	ACHIEVEMENT_DATA                         = 86,
	TOTAL_SPECIAL_ACTION_KILL_COUNT          = 87,
	Max                                      = 88,
};

// Enum MasterDataModule.EMdScoreTargetType
// NumValues: 0x0020
enum class EMdScoreTargetType : uint8
{
	Invalid                                  = 0,
	WIN                                      = 1,
	TOP_DAMAGE                               = 2,
	TOP_KO                                   = 3,
	TOP_CITIZEN_ACTION                       = 4,
	TOP_SUPPLY_SUPPORT                       = 5,
	LIFE_TIME                                = 6,
	LEVEL_UP                                 = 7,
	DAMAGE                                   = 8,
	PROTECT_DAMAGE                           = 9,
	PROTECT_DAMAGE_COUNT                     = 10,
	KO_COUNT                                 = 11,
	CONTINUOUS_KO_COUNT                      = 12,
	STRONG_KO_COUNT                          = 13,
	REVENGE_KO_COUNT                         = 14,
	PLUS_ULTRA                               = 15,
	PLUS_ULTRA_KO                            = 16,
	KO_ASSIST                                = 17,
	GET_SUPPLY_COUNT                         = 18,
	USE_SUPPLY_COUNT                         = 19,
	SUPPLY_SUPPORT                           = 20,
	MOVE_DISTANCE                            = 21,
	ABILITY_COUNT                            = 22,
	RECOVERY_ALL_COUNT                       = 23,
	RESCUE_COUNT                             = 24,
	REVIVE_COUNT                             = 25,
	CHEER_COUNT                              = 26,
	CHEER_PLAYER_COUNT                       = 27,
	CHAMPION_CHEER                           = 28,
	CITIZEN_ACTION                           = 29,
	COOP_ACTION                              = 30,
	Max                                      = 31,
};

// Enum MasterDataModule.EMdScoreType
// NumValues: 0x0005
enum class EMdScoreType : uint8
{
	Invalid                                  = 0,
	MAGNIFICATION                            = 1,
	RATIO                                    = 2,
	FLAG                                     = 3,
	Max                                      = 4,
};

// Enum MasterDataModule.EMdScoreCategory
// NumValues: 0x0004
enum class EMdScoreCategory : uint8
{
	Invalid                                  = 0,
	BATTLE                                   = 1,
	SUPPORT                                  = 2,
	Max                                      = 3,
};

// Enum MasterDataModule.EMdItemKind
// NumValues: 0x0005
enum class EMdItemKind : uint8
{
	Invalid                                  = 0,
	ITEM_TICKET                              = 1,
	ITEM_PASS                                = 2,
	ITEM_CURRENCY                            = 3,
	Max                                      = 4,
};

// Enum MasterDataModule.EMdAbilityType
// NumValues: 0x0009
enum class EMdAbilityType : uint8
{
	Invalid                                  = 0,
	Undef                                    = 1,
	Power                                    = 2,
	Support                                  = 3,
	Speed                                    = 4,
	Defense                                  = 5,
	Technique                                = 6,
	Special                                  = 7,
	Max                                      = 8,
};

// Enum MasterDataModule.EMdCameraName
// NumValues: 0x000B
enum class EMdCameraName : uint8
{
	Invalid                                  = 0,
	Common                                   = 1,
	DefaultCamera                            = 2,
	DashCamera                               = 3,
	DownCamera                               = 4,
	CrouchCamera                             = 5,
	WallCrawlCamera                          = 6,
	AimingCamera                             = 7,
	AimingCrouchCamera                       = 8,
	GuardPantie                              = 9,
	Max                                      = 10,
};

// Enum MasterDataModule.EMdCalcOperator
// NumValues: 0x0005
enum class EMdCalcOperator : uint8
{
	Invalid                                  = 0,
	Scale                                    = 1,
	Diff                                     = 2,
	Displace                                 = 3,
	Max                                      = 4,
};

// Enum MasterDataModule.EMdLocalization
// NumValues: 0x0008
enum class EMdLocalization : uint8
{
	Invalid                                  = 0,
	Ja                                       = 1,
	EnUS                                     = 2,
	Fr                                       = 3,
	De                                       = 4,
	It                                       = 5,
	Es                                       = 6,
	Max                                      = 7,
};

// Enum MasterDataModule.EAbandonedVoiceVoiceType
// NumValues: 0x0005
enum class EAbandonedVoiceVoiceType : uint8
{
	Invalid                                  = 0,
	EVENT                                    = 1,
	GASHA_UPDATE                             = 2,
	SHOP_ITEM_UPDATE                         = 3,
	Max                                      = 4,
};

// Enum MasterDataModule.ECameraOffsetTargetParam
// NumValues: 0x000A
enum class ECameraOffsetTargetParam : uint8
{
	Invalid                                  = 0,
	Distance                                 = 1,
	Horizontal                               = 2,
	Height                                   = 3,
	Angle                                    = 4,
	RotationSpeed                            = 5,
	ReticleHeight                            = 6,
	ActorScale                               = 7,
	ActorScaleHeight                         = 8,
	Max                                      = 9,
};

// Enum MasterDataModule.ECharacterMagazineUseType
// NumValues: 0x0004
enum class ECharacterMagazineUseType : uint8
{
	Invalid                                  = 0,
	ONE_SHOT                                 = 1,
	PER_SEC                                  = 2,
	Max                                      = 3,
};

// Enum MasterDataModule.EConfigKeyValueEkey
// NumValues: 0x0028
enum class EConfigKeyValueEkey : uint8
{
	Invalid                                  = 0,
	BuyProLicenseBonusExp                    = 1,
	ProLicenseShopItemCode                   = 2,
	ProLicenseWithExpShopItemCode            = 3,
	PremiumLoginBonusShopItemCode            = 4,
	PremiumLoginBonusExpirationDate          = 5,
	UnlockPresetPriceGold3                   = 6,
	UnlockPresetPriceGold4                   = 7,
	UnlockPresetPriceGold5                   = 8,
	UnlockPresetPriceGold6                   = 9,
	UnlockMyAdPriceGold2                     = 10,
	UnlockMyAdPriceGold3                     = 11,
	UnlockMyAdPriceGold4                     = 12,
	DeliveryMyAdPriceGold                    = 13,
	GuildRatioRankingReward1                 = 14,
	GuildRatioRankingReward2                 = 15,
	GuildRatioRankingReward3                 = 16,
	GuildRatioRankingReward4                 = 17,
	GuildRatioRankingReward5                 = 18,
	CharacterShopCode                        = 19,
	CharacterRentalPointMAX                  = 20,
	CharacterRentalPointRecovery             = 21,
	SpecialLicenseExpPrice                   = 22,
	SpecialLicenseExpCount                   = 23,
	MaxAuralLevel                            = 24,
	MaxBillboardChartRankings                = 25,
	MaxMVPRankings                           = 26,
	MaxOfficeRankings                        = 27,
	LicenseExpMax                            = 28,
	StartCountdownToBattle                   = 29,
	ForceStartCountdownToBattle              = 30,
	BriefingOpenWaitTimeSwitch               = 31,
	BriefingOpenWaitTimePS                   = 32,
	BriefingOpenWaitTimeXBox                 = 33,
	BriefingOpenWaitTimeSteam                = 34,
	BriefingSequenceWaitTimeSwitch           = 35,
	BriefingSequenceWaitTimePS               = 36,
	BriefingSequenceWaitTimeXBox             = 37,
	BriefingSequenceWaitTimeSteam            = 38,
	Max                                      = 39,
};

// Enum MasterDataModule.ECurrencyType
// NumValues: 0x001C
enum class ECurrencyType : uint8
{
	Invalid                                  = 0,
	REAL_MONEY                               = 1,
	GOLD                                     = 2,
	HERO_CRYSTAL                             = 3,
	HERO_SOUL                                = 4,
	GASHA_TICKET                             = 5,
	GASHA_TICKET_10                          = 6,
	CHARA_TICKET                             = 7,
	COS_TICKET                               = 8,
	GUILD_POINT                              = 9,
	GALLERY_TICKET_1                         = 10,
	GALLERY_TICKET_2                         = 11,
	GALLERY_TICKET_3                         = 12,
	PREMIUM_LOGIN_BONUS_TICKET_1             = 13,
	EVENT_POINT_1                            = 14,
	EVENT_POINT_2                            = 15,
	EVENT_POINT_3                            = 16,
	EVENT_POINT_4                            = 17,
	AURA_0                                   = 18,
	AURA_1                                   = 19,
	AURA_2                                   = 20,
	AURA_3                                   = 21,
	AURA_4                                   = 22,
	AURA_5                                   = 23,
	AURA_6                                   = 24,
	RENTAL_TICKET_1                          = 25,
	SKILL_TICKET_1                           = 26,
	Max                                      = 27,
};

// Enum MasterDataModule.ECustomizeEmoteAiUses
// NumValues: 0x0004
enum class ECustomizeEmoteAiUses : uint8
{
	Invalid                                  = 0,
	None                                     = 1,
	Spawned                                  = 2,
	Max                                      = 3,
};

// Enum MasterDataModule.EEmblemCategory
// NumValues: 0x0004
enum class EEmblemCategory : uint8
{
	Invalid                                  = 0,
	PLAYER                                   = 1,
	GUILD                                    = 2,
	Max                                      = 3,
};

// Enum MasterDataModule.EEventMultipleVoicePlaybackType
// NumValues: 0x0004
enum class EEventMultipleVoicePlaybackType : uint8
{
	Invalid                                  = 0,
	CONTINUOUS                               = 1,
	RANDOM                                   = 2,
	Max                                      = 3,
};

// Enum MasterDataModule.EEventCategory
// NumValues: 0x000A
enum class EEventCategory : uint8
{
	Invalid                                  = 0,
	Battle                                   = 1,
	Drop                                     = 2,
	Guild                                    = 3,
	BoxGasha                                 = 4,
	Mission                                  = 5,
	Fes                                      = 6,
	Bonus                                    = 7,
	RentalBoost                              = 8,
	Max                                      = 9,
};

// Enum MasterDataModule.EGuildActivityLikeTarget
// NumValues: 0x0004
enum class EGuildActivityLikeTarget : uint8
{
	Invalid                                  = 0,
	Personal                                 = 1,
	Everyone                                 = 2,
	Max                                      = 3,
};

// Enum MasterDataModule.ELoginBonusContinuityType
// NumValues: 0x0004
enum class ELoginBonusContinuityType : uint8
{
	Invalid                                  = 0,
	SequenceReward                           = 1,
	FixedDayReward                           = 2,
	Max                                      = 3,
};

// Enum MasterDataModule.ELoginBonusCategory
// NumValues: 0x0006
enum class ELoginBonusCategory : uint8
{
	Invalid                                  = 0,
	DailyFree                                = 1,
	DailyPremium                             = 2,
	Event                                    = 3,
	Campaign                                 = 4,
	Max                                      = 5,
};

// Enum MasterDataModule.ELotteryBoxType
// NumValues: 0x0005
enum class ELotteryBoxType : uint8
{
	Invalid                                  = 0,
	NONE                                     = 1,
	LIMITED                                  = 2,
	UNLIMITED                                = 3,
	Max                                      = 4,
};

// Enum MasterDataModule.ELotteryLotteryType
// NumValues: 0x0007
enum class ELotteryLotteryType : uint8
{
	Invalid                                  = 0,
	LOTTERY_NORMAL                           = 1,
	LOTTERY_BOX                              = 2,
	LOTTERY_STEP                             = 3,
	LOTTERY_UPPER_LIMIT                      = 4,
	LOTTERY_RETRYABLE                        = 5,
	Max                                      = 6,
};

// Enum MasterDataModule.EMGuildLeaguesReduceBorderType
// NumValues: 0x0004
enum class EMGuildLeaguesReduceBorderType : uint8
{
	Invalid                                  = 0,
	Count                                    = 1,
	Rate                                     = 2,
	Max                                      = 3,
};

// Enum MasterDataModule.EMGuildLeaguesRaiseBorderUnit
// NumValues: 0x0004
enum class EMGuildLeaguesRaiseBorderUnit : uint8
{
	Invalid                                  = 0,
	Count                                    = 1,
	Rate                                     = 2,
	Max                                      = 3,
};

// Enum MasterDataModule.EMissionJudge
// NumValues: 0x0005
enum class EMissionJudge : uint8
{
	Invalid                                  = 0,
	API_SERVER                               = 1,
	DEDICATED_SERVER                         = 2,
	CLIENT                                   = 3,
	Max                                      = 4,
};

// Enum MasterDataModule.EMRankingPeriodType
// NumValues: 0x0005
enum class EMRankingPeriodType : uint8
{
	Invalid                                  = 0,
	Season                                   = 1,
	Monthly                                  = 2,
	Event                                    = 3,
	Max                                      = 4,
};

// Enum MasterDataModule.EMRankingTarget
// NumValues: 0x0007
enum class EMRankingTarget : uint8
{
	Invalid                                  = 0,
	Like                                     = 1,
	RankPoint                                = 2,
	ContributionPoint                        = 3,
	Score                                    = 4,
	MaxScoreTopTen                           = 5,
	Max                                      = 6,
};

// Enum MasterDataModule.EMRankingTotallingUnit
// NumValues: 0x0004
enum class EMRankingTotallingUnit : uint8
{
	Invalid                                  = 0,
	Player                                   = 1,
	Guild                                    = 2,
	Max                                      = 3,
};

// Enum MasterDataModule.EMyAdPartsCategory
// NumValues: 0x0005
enum class EMyAdPartsCategory : uint8
{
	Invalid                                  = 0,
	MESSAGE                                  = 1,
	BACKGROUND                               = 2,
	EFFECT                                   = 3,
	Max                                      = 4,
};

// Enum MasterDataModule.ENotificationTextNoticeType
// NumValues: 0x0012
enum class ENotificationTextNoticeType : uint8
{
	Invalid                                  = 0,
	Maintenance                              = 1,
	Campaign                                 = 2,
	SpecialCampaign                          = 3,
	Information                              = 4,
	Gasha                                    = 5,
	Update                                   = 6,
	Event                                    = 7,
	BattleEvent                              = 8,
	DropEvent                                = 9,
	GuildEvent                               = 10,
	BoxEvent                                 = 11,
	MissionEvent                             = 12,
	FesEvent                                 = 13,
	BonusEvent                               = 14,
	RentalBoostEvent                         = 15,
	Birthday                                 = 16,
	Max                                      = 17,
};

// Enum MasterDataModule.EPlayModeModeCategory
// NumValues: 0x000B
enum class EPlayModeModeCategory : uint8
{
	Invalid                                  = 0,
	EVENT_BATTLE                             = 1,
	FREE_MATCH                               = 2,
	RANK_MATCH                               = 3,
	TRAINING                                 = 4,
	TUTORIAL                                 = 5,
	CPU_BATTLE_EASY                          = 6,
	CPU_BATTLE_NORMAL                        = 7,
	CPU_BATTLE_HARD                          = 8,
	CUSTOMMATCH                              = 9,
	Max                                      = 10,
};

// Enum MasterDataModule.ERankExpRankCategory
// NumValues: 0x0006
enum class ERankExpRankCategory : uint8
{
	Invalid                                  = 0,
	Ace                                      = 1,
	Pro                                      = 2,
	Amateur                                  = 3,
	Beginner                                 = 4,
	Max                                      = 5,
};

// Enum MasterDataModule.ERecommendNoticeApplyAction
// NumValues: 0x0008
enum class ERecommendNoticeApplyAction : uint8
{
	Invalid                                  = 0,
	BuyLicense                               = 1,
	MyAd                                     = 2,
	TeamUp                                   = 3,
	ApplyGuild                               = 4,
	SendGuildInvitation                      = 5,
	ApplyFriend                              = 6,
	Max                                      = 7,
};

// Enum MasterDataModule.EScreenName
// NumValues: 0x0021
enum class EScreenName : uint8
{
	Invalid                                  = 0,
	Title                                    = 1,
	Eula                                     = 2,
	MainMenu                                 = 3,
	TeamUp                                   = 4,
	SearchTeam                               = 5,
	BattleReady                              = 6,
	VisualLobby                              = 7,
	RankMatchTeamUp                          = 8,
	FreeMatchTeamUp                          = 9,
	CPUMatchTeamUp                           = 10,
	EventMatchTeamUp                         = 11,
	Tutorial                                 = 12,
	Watch                                    = 13,
	Result                                   = 14,
	Equipment                                = 15,
	MyAd                                     = 16,
	PickupPlayer                             = 17,
	Avatar                                   = 18,
	Shop                                     = 19,
	PremiumShop                              = 20,
	GashaTop                                 = 21,
	Gasha                                    = 22,
	SeasonPass                               = 23,
	Profile                                  = 24,
	Gallery                                  = 25,
	Ranking                                  = 26,
	Guild                                    = 27,
	Config                                   = 28,
	Mission                                  = 29,
	Training                                 = 30,
	Event                                    = 31,
	Max                                      = 32,
};

// Enum MasterDataModule.ESeasonPassCategory
// NumValues: 0x0006
enum class ESeasonPassCategory : uint8
{
	Invalid                                  = 0,
	BEGINNER_PASS                            = 1,
	FREE_SEASON_PASS                         = 2,
	PAID_SEASON_PASS                         = 3,
	SPECIAL_SEASON_PASS                      = 4,
	Max                                      = 5,
};

// Enum MasterDataModule.EShopCategory
// NumValues: 0x0005
enum class EShopCategory : uint8
{
	Invalid                                  = 0,
	Premium                                  = 1,
	Normal                                   = 2,
	Misc                                     = 3,
	Max                                      = 4,
};

// Enum MasterDataModule.EShopItemStockReplacement
// NumValues: 0x0004
enum class EShopItemStockReplacement : uint8
{
	Invalid                                  = 0,
	None                                     = 1,
	HasProLicense                            = 2,
	Max                                      = 3,
};

// Enum MasterDataModule.EShopItemBuyScreen
// NumValues: 0x0005
enum class EShopItemBuyScreen : uint8
{
	Invalid                                  = 0,
	ProLicense                               = 1,
	SpecialLicenseExp                        = 2,
	PremiumLoginBonus                        = 3,
	Max                                      = 4,
};

// Enum MasterDataModule.EShopItemDisplaySize
// NumValues: 0x0005
enum class EShopItemDisplaySize : uint8
{
	Invalid                                  = 0,
	SMALL                                    = 1,
	MEDIUM                                   = 2,
	LARGE                                    = 3,
	Max                                      = 4,
};

// ScriptStruct MasterDataModule.MasterDataGuildInstitution
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FMasterDataGuildInstitution final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Code;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Cost;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Percent;                                           // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RescueCorrectionPercent;                           // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TrainingCorrectionPercent;                         // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OfficeCorrectionPercent;                           // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMasterDataGuildInstitution) == 0x000008, "Wrong alignment on FMasterDataGuildInstitution");
static_assert(sizeof(FMasterDataGuildInstitution) == 0x000028, "Wrong size on FMasterDataGuildInstitution");
static_assert(offsetof(FMasterDataGuildInstitution, Code) == 0x000008, "Member 'FMasterDataGuildInstitution::Code' has a wrong offset!");
static_assert(offsetof(FMasterDataGuildInstitution, Level) == 0x00000C, "Member 'FMasterDataGuildInstitution::Level' has a wrong offset!");
static_assert(offsetof(FMasterDataGuildInstitution, Cost) == 0x000010, "Member 'FMasterDataGuildInstitution::Cost' has a wrong offset!");
static_assert(offsetof(FMasterDataGuildInstitution, Percent) == 0x000014, "Member 'FMasterDataGuildInstitution::Percent' has a wrong offset!");
static_assert(offsetof(FMasterDataGuildInstitution, RescueCorrectionPercent) == 0x000018, "Member 'FMasterDataGuildInstitution::RescueCorrectionPercent' has a wrong offset!");
static_assert(offsetof(FMasterDataGuildInstitution, TrainingCorrectionPercent) == 0x00001C, "Member 'FMasterDataGuildInstitution::TrainingCorrectionPercent' has a wrong offset!");
static_assert(offsetof(FMasterDataGuildInstitution, OfficeCorrectionPercent) == 0x000020, "Member 'FMasterDataGuildInstitution::OfficeCorrectionPercent' has a wrong offset!");

// ScriptStruct MasterDataModule.MasterDataCharacter
// 0x00A8 (0x00A8 - 0x0000)
struct FMasterDataCharacter
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Code;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name;                                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FString                                 NameAlphabet;                                      // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VariationGroupCode;                                // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SpecialAction1Code;                                // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SpecialAction2Code;                                // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Playable;                                          // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMdCharacterAssign                            Assign;                                            // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMdAbilityType                                CpuRoleType;                                       // 0x0049(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SortIndex;                                         // 0x004C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CustomizeCostumeGroupCode;                         // 0x0050(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CustomizeEmoteGroupCode;                           // 0x0054(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CustomizeVoiceGroupCode;                           // 0x0058(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ShopItemCode;                                      // 0x005C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetName;                                         // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0070(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         ObtainFrom;                                        // 0x0088(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DefaultCode;                                       // 0x008C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SpawnCpu;                                          // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMdRarity                                     Rarity;                                            // 0x0094(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DefaultEquipSetGroupCode;                          // 0x0098(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PickUpGashaCode;                                   // 0x009C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UseRentalPoint;                                    // 0x00A0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMasterDataCharacter) == 0x000008, "Wrong alignment on FMasterDataCharacter");
static_assert(sizeof(FMasterDataCharacter) == 0x0000A8, "Wrong size on FMasterDataCharacter");
static_assert(offsetof(FMasterDataCharacter, Code) == 0x000008, "Member 'FMasterDataCharacter::Code' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, Name) == 0x000010, "Member 'FMasterDataCharacter::Name' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, NameAlphabet) == 0x000028, "Member 'FMasterDataCharacter::NameAlphabet' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, VariationGroupCode) == 0x000038, "Member 'FMasterDataCharacter::VariationGroupCode' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, SpecialAction1Code) == 0x00003C, "Member 'FMasterDataCharacter::SpecialAction1Code' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, SpecialAction2Code) == 0x000040, "Member 'FMasterDataCharacter::SpecialAction2Code' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, Playable) == 0x000044, "Member 'FMasterDataCharacter::Playable' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, Assign) == 0x000048, "Member 'FMasterDataCharacter::Assign' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, CpuRoleType) == 0x000049, "Member 'FMasterDataCharacter::CpuRoleType' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, SortIndex) == 0x00004C, "Member 'FMasterDataCharacter::SortIndex' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, CustomizeCostumeGroupCode) == 0x000050, "Member 'FMasterDataCharacter::CustomizeCostumeGroupCode' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, CustomizeEmoteGroupCode) == 0x000054, "Member 'FMasterDataCharacter::CustomizeEmoteGroupCode' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, CustomizeVoiceGroupCode) == 0x000058, "Member 'FMasterDataCharacter::CustomizeVoiceGroupCode' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, ShopItemCode) == 0x00005C, "Member 'FMasterDataCharacter::ShopItemCode' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, AssetName) == 0x000060, "Member 'FMasterDataCharacter::AssetName' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, Description) == 0x000070, "Member 'FMasterDataCharacter::Description' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, ObtainFrom) == 0x000088, "Member 'FMasterDataCharacter::ObtainFrom' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, DefaultCode) == 0x00008C, "Member 'FMasterDataCharacter::DefaultCode' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, SpawnCpu) == 0x000090, "Member 'FMasterDataCharacter::SpawnCpu' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, Rarity) == 0x000094, "Member 'FMasterDataCharacter::Rarity' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, DefaultEquipSetGroupCode) == 0x000098, "Member 'FMasterDataCharacter::DefaultEquipSetGroupCode' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, PickUpGashaCode) == 0x00009C, "Member 'FMasterDataCharacter::PickUpGashaCode' has a wrong offset!");
static_assert(offsetof(FMasterDataCharacter, UseRentalPoint) == 0x0000A0, "Member 'FMasterDataCharacter::UseRentalPoint' has a wrong offset!");

// ScriptStruct MasterDataModule.MasterDataPackDescription
// 0x0028 (0x0028 - 0x0000)
struct FMasterDataPackDescription final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Code;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName;                                       // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMasterDataPackDescription) == 0x000008, "Wrong alignment on FMasterDataPackDescription");
static_assert(sizeof(FMasterDataPackDescription) == 0x000028, "Wrong size on FMasterDataPackDescription");
static_assert(offsetof(FMasterDataPackDescription, Code) == 0x000008, "Member 'FMasterDataPackDescription::Code' has a wrong offset!");
static_assert(offsetof(FMasterDataPackDescription, DisplayName) == 0x000010, "Member 'FMasterDataPackDescription::DisplayName' has a wrong offset!");

// ScriptStruct MasterDataModule.MasterDataVariation
// 0x0058 (0x0058 - 0x0000)
struct FMasterDataVariation final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Code;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Name;                                              // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Character;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GroupCode;                                         // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SkillGroupCode;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CharacterParam;                                    // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ObtainFrom;                                        // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ShopItemCode;                                      // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMdRarity                                     Rarity;                                            // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              AvailableAt;                                       // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              ExpireAt;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Memo;                                              // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Description;                                       // 0x0050(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMasterDataVariation) == 0x000008, "Wrong alignment on FMasterDataVariation");
static_assert(sizeof(FMasterDataVariation) == 0x000058, "Wrong size on FMasterDataVariation");
static_assert(offsetof(FMasterDataVariation, Code) == 0x000008, "Member 'FMasterDataVariation::Code' has a wrong offset!");
static_assert(offsetof(FMasterDataVariation, Name) == 0x00000C, "Member 'FMasterDataVariation::Name' has a wrong offset!");
static_assert(offsetof(FMasterDataVariation, Character) == 0x000010, "Member 'FMasterDataVariation::Character' has a wrong offset!");
static_assert(offsetof(FMasterDataVariation, GroupCode) == 0x000014, "Member 'FMasterDataVariation::GroupCode' has a wrong offset!");
static_assert(offsetof(FMasterDataVariation, SkillGroupCode) == 0x000018, "Member 'FMasterDataVariation::SkillGroupCode' has a wrong offset!");
static_assert(offsetof(FMasterDataVariation, CharacterParam) == 0x00001C, "Member 'FMasterDataVariation::CharacterParam' has a wrong offset!");
static_assert(offsetof(FMasterDataVariation, ObtainFrom) == 0x000020, "Member 'FMasterDataVariation::ObtainFrom' has a wrong offset!");
static_assert(offsetof(FMasterDataVariation, ShopItemCode) == 0x000024, "Member 'FMasterDataVariation::ShopItemCode' has a wrong offset!");
static_assert(offsetof(FMasterDataVariation, Rarity) == 0x000028, "Member 'FMasterDataVariation::Rarity' has a wrong offset!");
static_assert(offsetof(FMasterDataVariation, AvailableAt) == 0x000030, "Member 'FMasterDataVariation::AvailableAt' has a wrong offset!");
static_assert(offsetof(FMasterDataVariation, ExpireAt) == 0x000038, "Member 'FMasterDataVariation::ExpireAt' has a wrong offset!");
static_assert(offsetof(FMasterDataVariation, Memo) == 0x000040, "Member 'FMasterDataVariation::Memo' has a wrong offset!");
static_assert(offsetof(FMasterDataVariation, Description) == 0x000050, "Member 'FMasterDataVariation::Description' has a wrong offset!");

// ScriptStruct MasterDataModule.MasterDataNotificationText
// 0x0070 (0x0070 - 0x0000)
struct FMasterDataNotificationText final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Code;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   ExplanationText;                                   // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	ENotificationTextNoticeType                   NoticeType;                                        // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ImageCode;                                         // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              AvailableAt;                                       // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              ExpireAt;                                          // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetName;                                         // 0x0058(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DisplayItem;                                       // 0x0068(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CharaCode;                                         // 0x006C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMasterDataNotificationText) == 0x000008, "Wrong alignment on FMasterDataNotificationText");
static_assert(sizeof(FMasterDataNotificationText) == 0x000070, "Wrong size on FMasterDataNotificationText");
static_assert(offsetof(FMasterDataNotificationText, Code) == 0x000008, "Member 'FMasterDataNotificationText::Code' has a wrong offset!");
static_assert(offsetof(FMasterDataNotificationText, Text) == 0x000010, "Member 'FMasterDataNotificationText::Text' has a wrong offset!");
static_assert(offsetof(FMasterDataNotificationText, ExplanationText) == 0x000028, "Member 'FMasterDataNotificationText::ExplanationText' has a wrong offset!");
static_assert(offsetof(FMasterDataNotificationText, NoticeType) == 0x000040, "Member 'FMasterDataNotificationText::NoticeType' has a wrong offset!");
static_assert(offsetof(FMasterDataNotificationText, ImageCode) == 0x000044, "Member 'FMasterDataNotificationText::ImageCode' has a wrong offset!");
static_assert(offsetof(FMasterDataNotificationText, AvailableAt) == 0x000048, "Member 'FMasterDataNotificationText::AvailableAt' has a wrong offset!");
static_assert(offsetof(FMasterDataNotificationText, ExpireAt) == 0x000050, "Member 'FMasterDataNotificationText::ExpireAt' has a wrong offset!");
static_assert(offsetof(FMasterDataNotificationText, AssetName) == 0x000058, "Member 'FMasterDataNotificationText::AssetName' has a wrong offset!");
static_assert(offsetof(FMasterDataNotificationText, DisplayItem) == 0x000068, "Member 'FMasterDataNotificationText::DisplayItem' has a wrong offset!");
static_assert(offsetof(FMasterDataNotificationText, CharaCode) == 0x00006C, "Member 'FMasterDataNotificationText::CharaCode' has a wrong offset!");

