#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OutGameModule

#include "Basic.hpp"

#include "UIFramework_structs.hpp"
#include "UIFramework_classes.hpp"
#include "CommonModule_structs.hpp"
#include "GameModule_structs.hpp"
#include "GameModule_classes.hpp"
#include "OutGameModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "MasterDataModule_structs.hpp"
#include "BackendSubsystem_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "InputCore_structs.hpp"
#include "Slate_structs.hpp"
#include "BykingUnrealModule_structs.hpp"


namespace SDK
{

// Class OutGameModule.AboutDataUsage
// 0x0000 (0x0350 - 0x0350)
class UAboutDataUsage final : public UWidgetBase
{
public:
	void RequestFetch();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AboutDataUsage">();
	}
	static class UAboutDataUsage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAboutDataUsage>();
	}
};
static_assert(alignof(UAboutDataUsage) == 0x000008, "Wrong alignment on UAboutDataUsage");
static_assert(sizeof(UAboutDataUsage) == 0x000350, "Wrong size on UAboutDataUsage");

// Class OutGameModule.PlayMenuHamburgerListEntryObject
// 0x0020 (0x0050 - 0x0030)
class UPlayMenuHamburgerListEntryObject final : public UListViewEntryObjectBase
{
public:
	class FText                                   _listNameText;                                     // 0x0030(0x0018)(BlueprintVisible, ExposeOnSpawn, NativeAccessSpecifierPublic)
	bool                                          _useFade;                                          // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMdPlayMenuHamburgerMenuList                  MenuType;                                          // 0x0049(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _isEnable;                                         // 0x004A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bNonDownArrow;                                    // 0x004B(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayMenuHamburgerListEntryObject">();
	}
	static class UPlayMenuHamburgerListEntryObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayMenuHamburgerListEntryObject>();
	}
};
static_assert(alignof(UPlayMenuHamburgerListEntryObject) == 0x000008, "Wrong alignment on UPlayMenuHamburgerListEntryObject");
static_assert(sizeof(UPlayMenuHamburgerListEntryObject) == 0x000050, "Wrong size on UPlayMenuHamburgerListEntryObject");
static_assert(offsetof(UPlayMenuHamburgerListEntryObject, _listNameText) == 0x000030, "Member 'UPlayMenuHamburgerListEntryObject::_listNameText' has a wrong offset!");
static_assert(offsetof(UPlayMenuHamburgerListEntryObject, _useFade) == 0x000048, "Member 'UPlayMenuHamburgerListEntryObject::_useFade' has a wrong offset!");
static_assert(offsetof(UPlayMenuHamburgerListEntryObject, MenuType) == 0x000049, "Member 'UPlayMenuHamburgerListEntryObject::MenuType' has a wrong offset!");
static_assert(offsetof(UPlayMenuHamburgerListEntryObject, _isEnable) == 0x00004A, "Member 'UPlayMenuHamburgerListEntryObject::_isEnable' has a wrong offset!");
static_assert(offsetof(UPlayMenuHamburgerListEntryObject, _bNonDownArrow) == 0x00004B, "Member 'UPlayMenuHamburgerListEntryObject::_bNonDownArrow' has a wrong offset!");

// Class OutGameModule.AccountLinkageWidget
// 0x0048 (0x0398 - 0x0350)
class UAccountLinkageWidget : public UWidgetBase
{
public:
	uint8                                         Pad_350[0x10];                                     // 0x0350(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetSwitcher*                        _linkageSwitcher;                                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetGeneralWindow*                   _otherWindowFrame;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 _imageQrCodeDynamic;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             _linkableText;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetGeneralWindowFrame*              _linkableWindowFrame;                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetGeneralWindow*                   _linkedWindowFrame;                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetGeneralWindow*                   _linkedConformWindowFrame;                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnClickedBlockBGLinkableWindow();
	void OnClickedBlockBGLinkedConfirmWindow();
	void OnClickedBlockBGLinkedWindow();
	void OnClickedBlockBGMaintenanceWindow();
	void OnClosedLinkableWindow();
	void OnClosedLinkedConfirmWindow();
	void OnClosedLinkedWindow();
	void OnClosedMaintenanceWindow();
	void OnDecideLinkableWindow(class UAppWidget* Widget, EWidgetInputType InputType, bool LeftButton);
	void OnDecideLinkedConfirmWindow(class UAppWidget* Widget, EWidgetInputType InputType, bool LeftButton);
	void OnDecideLinkedWindow(class UAppWidget* Widget, EWidgetInputType InputType, bool LeftButton);
	void OnDecideMaintenanceWindow(class UAppWidget* Widget, EWidgetInputType InputType, bool LeftButton);
	void OnLoadCompletedCheckBnIdStatus(int32 RequestId);
	void OnLoadCompletedLoadBnIdQrCodeImage(int32 RequestId);
	void OnReceivedCloseWebApiErrorWindow();
	void OnReceivedWebApiError();
	void OnUpdateCompletedResetBnIdLink(int32 RequestId);
	void OpenNetworkWaiting();
	void RequestCheckBnIdStatus();
	void RequestLoadBnIdQrCodeImage();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AccountLinkageWidget">();
	}
	static class UAccountLinkageWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccountLinkageWidget>();
	}
};
static_assert(alignof(UAccountLinkageWidget) == 0x000008, "Wrong alignment on UAccountLinkageWidget");
static_assert(sizeof(UAccountLinkageWidget) == 0x000398, "Wrong size on UAccountLinkageWidget");
static_assert(offsetof(UAccountLinkageWidget, _linkageSwitcher) == 0x000360, "Member 'UAccountLinkageWidget::_linkageSwitcher' has a wrong offset!");
static_assert(offsetof(UAccountLinkageWidget, _otherWindowFrame) == 0x000368, "Member 'UAccountLinkageWidget::_otherWindowFrame' has a wrong offset!");
static_assert(offsetof(UAccountLinkageWidget, _imageQrCodeDynamic) == 0x000370, "Member 'UAccountLinkageWidget::_imageQrCodeDynamic' has a wrong offset!");
static_assert(offsetof(UAccountLinkageWidget, _linkableText) == 0x000378, "Member 'UAccountLinkageWidget::_linkableText' has a wrong offset!");
static_assert(offsetof(UAccountLinkageWidget, _linkableWindowFrame) == 0x000380, "Member 'UAccountLinkageWidget::_linkableWindowFrame' has a wrong offset!");
static_assert(offsetof(UAccountLinkageWidget, _linkedWindowFrame) == 0x000388, "Member 'UAccountLinkageWidget::_linkedWindowFrame' has a wrong offset!");
static_assert(offsetof(UAccountLinkageWidget, _linkedConformWindowFrame) == 0x000390, "Member 'UAccountLinkageWidget::_linkedConformWindowFrame' has a wrong offset!");

// Class OutGameModule.AccountSelectWidget
// 0x0008 (0x0358 - 0x0350)
class UAccountSelectWidget final : public UWidgetBase
{
public:
	class UWidgetGeneralWindow*                   _popupWindowWidget;                                // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ClosePopup(class UAppWidget* Widget, EWidgetInputType InputType, bool LeftButton);
	void OnClosedFailedPopup();
	void OnClosedSuccessPopup();
	void OnErrorFadeOut();
	void OnErrorWindowClosed();
	void OnFadeOut();
	void OnNativeFadeIn();
	void OnNativeFadeOut();
	void OnOpenPopup();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AccountSelectWidget">();
	}
	static class UAccountSelectWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccountSelectWidget>();
	}
};
static_assert(alignof(UAccountSelectWidget) == 0x000008, "Wrong alignment on UAccountSelectWidget");
static_assert(sizeof(UAccountSelectWidget) == 0x000358, "Wrong size on UAccountSelectWidget");
static_assert(offsetof(UAccountSelectWidget, _popupWindowWidget) == 0x000350, "Member 'UAccountSelectWidget::_popupWindowWidget' has a wrong offset!");

// Class OutGameModule.PlayMenuBattleRuleWidget
// 0x0148 (0x05D0 - 0x0488)
class UPlayMenuBattleRuleWidget final : public UWidgetButton
{
public:
	bool                                          _bIsGrayOut;                                       // 0x0488(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 _stageImage;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 _characterImage;                                   // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAdjustTextWidget*                      _battleRuleAdjustText;                             // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 _battleRuleTextBG;                                 // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             _battleRuleModeTex;                                // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 _ruleBgImage;                                      // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 _ruleBgdot;                                        // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             _battleMemberNumText;                              // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             _battleMemberMinNumText;                           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 _fromImage;                                        // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCanvasPanel*                           _timerPanel;                                       // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTimeWidget*                            _playModeTimer;                                    // 0x04E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPaperFlipbook*                         _stageFB;                                          // 0x04F0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EPlayModeModeCategory, struct FBattleInfo> _modeCategoryInfo;                                 // 0x04F8(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<EMdGameMode, struct FBattleInfo>         _modeOverrideGameModeCategoryInfo;                 // 0x0548(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class USoundAtomCue*                          _pressAtomCue;                                     // 0x0598(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAtomCue*                          _focusAtomCue;                                     // 0x05A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAtomCue*                          _pressUnSelectedAtomCue;                           // 0x05A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlayModeModeCategory                         _debguCategoryColor;                               // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B1[0x7];                                      // 0x05B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         _atomComp;                                         // 0x05B8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5C0[0x10];                                     // 0x05C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetSelectedBattleRuleStageData(int32* StageCode);
	void OnChangeBattleRule();
	void OnChangeBattleSequence(EBattleStartSequenceType Sequence);
	void OnGrayOutEvent(bool bIsGrayOut);
	void OnPressButtonWidget(class UAppWidget* Button, EWidgetInputType InputType);
	void OnSquadInfoChanged();
	void OnSquadNumChanged(int32 SquadNum);
	void OnUpdateTutorial();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayMenuBattleRuleWidget">();
	}
	static class UPlayMenuBattleRuleWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayMenuBattleRuleWidget>();
	}
};
static_assert(alignof(UPlayMenuBattleRuleWidget) == 0x000008, "Wrong alignment on UPlayMenuBattleRuleWidget");
static_assert(sizeof(UPlayMenuBattleRuleWidget) == 0x0005D0, "Wrong size on UPlayMenuBattleRuleWidget");
static_assert(offsetof(UPlayMenuBattleRuleWidget, _bIsGrayOut) == 0x000488, "Member 'UPlayMenuBattleRuleWidget::_bIsGrayOut' has a wrong offset!");
static_assert(offsetof(UPlayMenuBattleRuleWidget, _stageImage) == 0x000490, "Member 'UPlayMenuBattleRuleWidget::_stageImage' has a wrong offset!");
static_assert(offsetof(UPlayMenuBattleRuleWidget, _characterImage) == 0x000498, "Member 'UPlayMenuBattleRuleWidget::_characterImage' has a wrong offset!");
static_assert(offsetof(UPlayMenuBattleRuleWidget, _battleRuleAdjustText) == 0x0004A0, "Member 'UPlayMenuBattleRuleWidget::_battleRuleAdjustText' has a wrong offset!");
static_assert(offsetof(UPlayMenuBattleRuleWidget, _battleRuleTextBG) == 0x0004A8, "Member 'UPlayMenuBattleRuleWidget::_battleRuleTextBG' has a wrong offset!");
static_assert(offsetof(UPlayMenuBattleRuleWidget, _battleRuleModeTex) == 0x0004B0, "Member 'UPlayMenuBattleRuleWidget::_battleRuleModeTex' has a wrong offset!");
static_assert(offsetof(UPlayMenuBattleRuleWidget, _ruleBgImage) == 0x0004B8, "Member 'UPlayMenuBattleRuleWidget::_ruleBgImage' has a wrong offset!");
static_assert(offsetof(UPlayMenuBattleRuleWidget, _ruleBgdot) == 0x0004C0, "Member 'UPlayMenuBattleRuleWidget::_ruleBgdot' has a wrong offset!");
static_assert(offsetof(UPlayMenuBattleRuleWidget, _battleMemberNumText) == 0x0004C8, "Member 'UPlayMenuBattleRuleWidget::_battleMemberNumText' has a wrong offset!");
static_assert(offsetof(UPlayMenuBattleRuleWidget, _battleMemberMinNumText) == 0x0004D0, "Member 'UPlayMenuBattleRuleWidget::_battleMemberMinNumText' has a wrong offset!");
static_assert(offsetof(UPlayMenuBattleRuleWidget, _fromImage) == 0x0004D8, "Member 'UPlayMenuBattleRuleWidget::_fromImage' has a wrong offset!");
static_assert(offsetof(UPlayMenuBattleRuleWidget, _timerPanel) == 0x0004E0, "Member 'UPlayMenuBattleRuleWidget::_timerPanel' has a wrong offset!");
static_assert(offsetof(UPlayMenuBattleRuleWidget, _playModeTimer) == 0x0004E8, "Member 'UPlayMenuBattleRuleWidget::_playModeTimer' has a wrong offset!");
static_assert(offsetof(UPlayMenuBattleRuleWidget, _stageFB) == 0x0004F0, "Member 'UPlayMenuBattleRuleWidget::_stageFB' has a wrong offset!");
static_assert(offsetof(UPlayMenuBattleRuleWidget, _modeCategoryInfo) == 0x0004F8, "Member 'UPlayMenuBattleRuleWidget::_modeCategoryInfo' has a wrong offset!");
static_assert(offsetof(UPlayMenuBattleRuleWidget, _modeOverrideGameModeCategoryInfo) == 0x000548, "Member 'UPlayMenuBattleRuleWidget::_modeOverrideGameModeCategoryInfo' has a wrong offset!");
static_assert(offsetof(UPlayMenuBattleRuleWidget, _pressAtomCue) == 0x000598, "Member 'UPlayMenuBattleRuleWidget::_pressAtomCue' has a wrong offset!");
static_assert(offsetof(UPlayMenuBattleRuleWidget, _focusAtomCue) == 0x0005A0, "Member 'UPlayMenuBattleRuleWidget::_focusAtomCue' has a wrong offset!");
static_assert(offsetof(UPlayMenuBattleRuleWidget, _pressUnSelectedAtomCue) == 0x0005A8, "Member 'UPlayMenuBattleRuleWidget::_pressUnSelectedAtomCue' has a wrong offset!");
static_assert(offsetof(UPlayMenuBattleRuleWidget, _debguCategoryColor) == 0x0005B0, "Member 'UPlayMenuBattleRuleWidget::_debguCategoryColor' has a wrong offset!");
static_assert(offsetof(UPlayMenuBattleRuleWidget, _atomComp) == 0x0005B8, "Member 'UPlayMenuBattleRuleWidget::_atomComp' has a wrong offset!");

// Class OutGameModule.AnimationOutGame
// 0x0010 (0x0720 - 0x0710)
class UAnimationOutGame final : public UAnimation
{
public:
	uint8                                         Pad_710[0x10];                                     // 0x0710(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_PlayAnimationOutGame(EAnimOutGameId ID, float PlayRate, float BlendInTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimationOutGame">();
	}
	static class UAnimationOutGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimationOutGame>();
	}
};
static_assert(alignof(UAnimationOutGame) == 0x000010, "Wrong alignment on UAnimationOutGame");
static_assert(sizeof(UAnimationOutGame) == 0x000720, "Wrong size on UAnimationOutGame");

// Class OutGameModule.AvatarCreateAppWidget
// 0x00A8 (0x0490 - 0x03E8)
class UAvatarCreateAppWidget : public UAppWidget
{
public:
	FMulticastInlineDelegateProperty_             _onDecideDelegate;                                 // 0x03E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F8[0x20];                                     // 0x03F8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomTileView*                        _tileView;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _bUseIconPositionOverride;                         // 0x0420(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              _iconPosition;                                     // 0x0424(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAnchorData                            CategoryAnchor;                                    // 0x042C(0x0028)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FAnchorData                            SelectedItemAnchor;                                // 0x0454(0x0028)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_47C[0x14];                                     // 0x047C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UAvatarCreateBaseListEntryObject* BP_GetEntryObject();
	void BP_SetFocusItem(int32 FocusIndex);
	void BP_SetFocusTop();
	void DoCustomWidgetNavigation(EUINavigation UiNavigation);
	void OnDecideEvent(class UAppWidget* Widget, EWidgetInputType InputType);
	void OnFocusEvent(class UAppWidget* Widget, EWidgetInputType InputType);
	void OnPressEvent(class UAppWidget* Widget, EWidgetInputType InputType);
	void OnRemoveFocusEvent(class UAppWidget* Widget, EWidgetInputType InputType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AvatarCreateAppWidget">();
	}
	static class UAvatarCreateAppWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvatarCreateAppWidget>();
	}
};
static_assert(alignof(UAvatarCreateAppWidget) == 0x000008, "Wrong alignment on UAvatarCreateAppWidget");
static_assert(sizeof(UAvatarCreateAppWidget) == 0x000490, "Wrong size on UAvatarCreateAppWidget");
static_assert(offsetof(UAvatarCreateAppWidget, _onDecideDelegate) == 0x0003E8, "Member 'UAvatarCreateAppWidget::_onDecideDelegate' has a wrong offset!");
static_assert(offsetof(UAvatarCreateAppWidget, _tileView) == 0x000418, "Member 'UAvatarCreateAppWidget::_tileView' has a wrong offset!");
static_assert(offsetof(UAvatarCreateAppWidget, _bUseIconPositionOverride) == 0x000420, "Member 'UAvatarCreateAppWidget::_bUseIconPositionOverride' has a wrong offset!");
static_assert(offsetof(UAvatarCreateAppWidget, _iconPosition) == 0x000424, "Member 'UAvatarCreateAppWidget::_iconPosition' has a wrong offset!");
static_assert(offsetof(UAvatarCreateAppWidget, CategoryAnchor) == 0x00042C, "Member 'UAvatarCreateAppWidget::CategoryAnchor' has a wrong offset!");
static_assert(offsetof(UAvatarCreateAppWidget, SelectedItemAnchor) == 0x000454, "Member 'UAvatarCreateAppWidget::SelectedItemAnchor' has a wrong offset!");

// Class OutGameModule.PlayMenuMaintenance
// 0x0020 (0x0370 - 0x0350)
class UPlayMenuMaintenance final : public UWidgetBase
{
public:
	class UAdjustTextWidget*                      _adjustText;                                       // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         _alwaysDisplayMinutes;                             // 0x0358(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _delayDelate;                                      // 0x035C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         _bDebugMaintenanceTimeMinutes;                     // 0x0360(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           _rentalRecoveryHandle;                             // 0x0368(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnFinishedScrollEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayMenuMaintenance">();
	}
	static class UPlayMenuMaintenance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayMenuMaintenance>();
	}
};
static_assert(alignof(UPlayMenuMaintenance) == 0x000008, "Wrong alignment on UPlayMenuMaintenance");
static_assert(sizeof(UPlayMenuMaintenance) == 0x000370, "Wrong size on UPlayMenuMaintenance");
static_assert(offsetof(UPlayMenuMaintenance, _adjustText) == 0x000350, "Member 'UPlayMenuMaintenance::_adjustText' has a wrong offset!");
static_assert(offsetof(UPlayMenuMaintenance, _alwaysDisplayMinutes) == 0x000358, "Member 'UPlayMenuMaintenance::_alwaysDisplayMinutes' has a wrong offset!");
static_assert(offsetof(UPlayMenuMaintenance, _delayDelate) == 0x00035C, "Member 'UPlayMenuMaintenance::_delayDelate' has a wrong offset!");
static_assert(offsetof(UPlayMenuMaintenance, _bDebugMaintenanceTimeMinutes) == 0x000360, "Member 'UPlayMenuMaintenance::_bDebugMaintenanceTimeMinutes' has a wrong offset!");
static_assert(offsetof(UPlayMenuMaintenance, _rentalRecoveryHandle) == 0x000368, "Member 'UPlayMenuMaintenance::_rentalRecoveryHandle' has a wrong offset!");

// Class OutGameModule.AvatarCreateSlotWidgetBase
// 0x0150 (0x04A0 - 0x0350)
class UAvatarCreateSlotWidgetBase : public UWidgetBase
{
public:
	class UTextBlock*                             _itemTextBlock;                                    // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             _selectedTextBlock;                                // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScaleBox*                              _itemTextScaleBox;                                 // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScaleBox*                              _selectedScaleBox;                                 // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScaleBox*                              _guideScaleBox;                                    // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 _image;                                            // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 _speakerIcon;                                      // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetButton*                          _speakerButton;                                    // 0x0388(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_390[0xF8];                                     // 0x0390(0x00F8)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           _imageDataImage;                                   // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundAtomCue*                          _sound;                                            // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAtomComponent*                         Conponent;                                         // 0x0498(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UAvatarCreateSlotWidgetBase* BP_SetuptImageWidget(const struct FAvatarCreateImageData& ImageData);
	class UAvatarCreateSlotWidgetBase* BP_SetuptMenuWidget(const struct FAvatarCreateMenuData& MenuData);
	void BP_SetVoiceData(const struct FAvatarCreateVoiceData& VoiceData);
	void BP_UpdateImageStyle();
	bool BP_UpdateSoundWidgetDiplay(bool Hidden);
	void BP_UpdateStyle();
	void OnPressButton(class UAppWidget* Widget, EWidgetInputType InputType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AvatarCreateSlotWidgetBase">();
	}
	static class UAvatarCreateSlotWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvatarCreateSlotWidgetBase>();
	}
};
static_assert(alignof(UAvatarCreateSlotWidgetBase) == 0x000008, "Wrong alignment on UAvatarCreateSlotWidgetBase");
static_assert(sizeof(UAvatarCreateSlotWidgetBase) == 0x0004A0, "Wrong size on UAvatarCreateSlotWidgetBase");
static_assert(offsetof(UAvatarCreateSlotWidgetBase, _itemTextBlock) == 0x000350, "Member 'UAvatarCreateSlotWidgetBase::_itemTextBlock' has a wrong offset!");
static_assert(offsetof(UAvatarCreateSlotWidgetBase, _selectedTextBlock) == 0x000358, "Member 'UAvatarCreateSlotWidgetBase::_selectedTextBlock' has a wrong offset!");
static_assert(offsetof(UAvatarCreateSlotWidgetBase, _itemTextScaleBox) == 0x000360, "Member 'UAvatarCreateSlotWidgetBase::_itemTextScaleBox' has a wrong offset!");
static_assert(offsetof(UAvatarCreateSlotWidgetBase, _selectedScaleBox) == 0x000368, "Member 'UAvatarCreateSlotWidgetBase::_selectedScaleBox' has a wrong offset!");
static_assert(offsetof(UAvatarCreateSlotWidgetBase, _guideScaleBox) == 0x000370, "Member 'UAvatarCreateSlotWidgetBase::_guideScaleBox' has a wrong offset!");
static_assert(offsetof(UAvatarCreateSlotWidgetBase, _image) == 0x000378, "Member 'UAvatarCreateSlotWidgetBase::_image' has a wrong offset!");
static_assert(offsetof(UAvatarCreateSlotWidgetBase, _speakerIcon) == 0x000380, "Member 'UAvatarCreateSlotWidgetBase::_speakerIcon' has a wrong offset!");
static_assert(offsetof(UAvatarCreateSlotWidgetBase, _speakerButton) == 0x000388, "Member 'UAvatarCreateSlotWidgetBase::_speakerButton' has a wrong offset!");
static_assert(offsetof(UAvatarCreateSlotWidgetBase, _imageDataImage) == 0x000488, "Member 'UAvatarCreateSlotWidgetBase::_imageDataImage' has a wrong offset!");
static_assert(offsetof(UAvatarCreateSlotWidgetBase, _sound) == 0x000490, "Member 'UAvatarCreateSlotWidgetBase::_sound' has a wrong offset!");
static_assert(offsetof(UAvatarCreateSlotWidgetBase, Conponent) == 0x000498, "Member 'UAvatarCreateSlotWidgetBase::Conponent' has a wrong offset!");

// Class OutGameModule.AvatarCreateBattleStyleSlotWidget
// 0x0008 (0x04A8 - 0x04A0)
class UAvatarCreateBattleStyleSlotWidget final : public UAvatarCreateSlotWidgetBase
{
public:
	uint8                                         Pad_4A0[0x8];                                      // 0x04A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UPaperSprite* BP_GetBattleStlyeImage(ECharacterId CharaID) const;
	class FText BP_GetBattleStlyeText(ECharacterId CharaID) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AvatarCreateBattleStyleSlotWidget">();
	}
	static class UAvatarCreateBattleStyleSlotWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvatarCreateBattleStyleSlotWidget>();
	}
};
static_assert(alignof(UAvatarCreateBattleStyleSlotWidget) == 0x000008, "Wrong alignment on UAvatarCreateBattleStyleSlotWidget");
static_assert(sizeof(UAvatarCreateBattleStyleSlotWidget) == 0x0004A8, "Wrong size on UAvatarCreateBattleStyleSlotWidget");

// Class OutGameModule.PlayMenuRequestMessage
// 0x0000 (0x0350 - 0x0350)
class UPlayMenuRequestMessage final : public UWidgetBase
{
public:
	void OnNewInviteFlag(bool Flag);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayMenuRequestMessage">();
	}
	static class UPlayMenuRequestMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayMenuRequestMessage>();
	}
};
static_assert(alignof(UPlayMenuRequestMessage) == 0x000008, "Wrong alignment on UPlayMenuRequestMessage");
static_assert(sizeof(UPlayMenuRequestMessage) == 0x000350, "Wrong size on UPlayMenuRequestMessage");

// Class OutGameModule.AvatarCreateBattleStyleWidget
// 0x0038 (0x04C8 - 0x0490)
class UAvatarCreateBattleStyleWidget final : public UAvatarCreateAppWidget
{
public:
	class UWidgetButton*                          _cancelButton;                                     // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 _selectedWindowBackGround;                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 _selectedWindowFram;                               // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 _selectedWindowTopBar;                             // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClippingWidget*                        _header;                                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 _blockBackGround;                                  // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _bLevelLoad;                                       // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CloseWindow();
	void OnDecideButtonWidget(class UAppWidget* Button, EWidgetInputType InputType);
	struct FEventReply OnMouseButtonDownBackGround(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnNegativeButtonWidget(class UAppWidget* Button, EWidgetInputType InputType);
	void OnPressButtonWidget(class UAppWidget* Button, EWidgetInputType InputType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AvatarCreateBattleStyleWidget">();
	}
	static class UAvatarCreateBattleStyleWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvatarCreateBattleStyleWidget>();
	}
};
static_assert(alignof(UAvatarCreateBattleStyleWidget) == 0x000008, "Wrong alignment on UAvatarCreateBattleStyleWidget");
static_assert(sizeof(UAvatarCreateBattleStyleWidget) == 0x0004C8, "Wrong size on UAvatarCreateBattleStyleWidget");
static_assert(offsetof(UAvatarCreateBattleStyleWidget, _cancelButton) == 0x000490, "Member 'UAvatarCreateBattleStyleWidget::_cancelButton' has a wrong offset!");
static_assert(offsetof(UAvatarCreateBattleStyleWidget, _selectedWindowBackGround) == 0x000498, "Member 'UAvatarCreateBattleStyleWidget::_selectedWindowBackGround' has a wrong offset!");
static_assert(offsetof(UAvatarCreateBattleStyleWidget, _selectedWindowFram) == 0x0004A0, "Member 'UAvatarCreateBattleStyleWidget::_selectedWindowFram' has a wrong offset!");
static_assert(offsetof(UAvatarCreateBattleStyleWidget, _selectedWindowTopBar) == 0x0004A8, "Member 'UAvatarCreateBattleStyleWidget::_selectedWindowTopBar' has a wrong offset!");
static_assert(offsetof(UAvatarCreateBattleStyleWidget, _header) == 0x0004B0, "Member 'UAvatarCreateBattleStyleWidget::_header' has a wrong offset!");
static_assert(offsetof(UAvatarCreateBattleStyleWidget, _blockBackGround) == 0x0004B8, "Member 'UAvatarCreateBattleStyleWidget::_blockBackGround' has a wrong offset!");
static_assert(offsetof(UAvatarCreateBattleStyleWidget, _bLevelLoad) == 0x0004C0, "Member 'UAvatarCreateBattleStyleWidget::_bLevelLoad' has a wrong offset!");

// Class OutGameModule.AvatarCreateButtonWidget
// 0x0028 (0x0378 - 0x0350)
class UAvatarCreateButtonWidget final : public UWidgetBase
{
public:
	class UAvatarCreateBaseListEntryObject*       _entryObject;                                      // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNamedSlot*                             _buttonFunctionNamedSlot;                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNamedSlot*                             _buttonImageNamedSlot;                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UProgressBar*                           _buttonImage;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 _checkImage;                                       // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UAvatarCreateFunctionSlotWidget* BP_GetFunctionSlotWidget();
	void BP_SetEntryObject(class UAvatarCreateBaseListEntryObject* Item);
	void BP_SetupButtonStyle(float ProgressRate, const struct FLinearColor& ProgressColor, const struct FSlateColor& Color, ESlateVisibility ImageVisibility, class UUserWidget* NamedSlotWidget, class UUserWidget* NamedFunctionSlotWidget);

	class UAvatarCreateBaseListEntryObject* BP_GetEntryObject() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AvatarCreateButtonWidget">();
	}
	static class UAvatarCreateButtonWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvatarCreateButtonWidget>();
	}
};
static_assert(alignof(UAvatarCreateButtonWidget) == 0x000008, "Wrong alignment on UAvatarCreateButtonWidget");
static_assert(sizeof(UAvatarCreateButtonWidget) == 0x000378, "Wrong size on UAvatarCreateButtonWidget");
static_assert(offsetof(UAvatarCreateButtonWidget, _entryObject) == 0x000350, "Member 'UAvatarCreateButtonWidget::_entryObject' has a wrong offset!");
static_assert(offsetof(UAvatarCreateButtonWidget, _buttonFunctionNamedSlot) == 0x000358, "Member 'UAvatarCreateButtonWidget::_buttonFunctionNamedSlot' has a wrong offset!");
static_assert(offsetof(UAvatarCreateButtonWidget, _buttonImageNamedSlot) == 0x000360, "Member 'UAvatarCreateButtonWidget::_buttonImageNamedSlot' has a wrong offset!");
static_assert(offsetof(UAvatarCreateButtonWidget, _buttonImage) == 0x000368, "Member 'UAvatarCreateButtonWidget::_buttonImage' has a wrong offset!");
static_assert(offsetof(UAvatarCreateButtonWidget, _checkImage) == 0x000370, "Member 'UAvatarCreateButtonWidget::_checkImage' has a wrong offset!");

// Class OutGameModule.PlayMenuMyADDisplay
// 0x0010 (0x0360 - 0x0350)
class UPlayMenuMyADDisplay final : public UWidgetBase
{
public:
	class UMyADDisplayWidget*                     _displayAD;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAdjustTextWidget*                      _playerName;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayMenuMyADDisplay">();
	}
	static class UPlayMenuMyADDisplay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayMenuMyADDisplay>();
	}
};
static_assert(alignof(UPlayMenuMyADDisplay) == 0x000008, "Wrong alignment on UPlayMenuMyADDisplay");
static_assert(sizeof(UPlayMenuMyADDisplay) == 0x000360, "Wrong size on UPlayMenuMyADDisplay");
static_assert(offsetof(UPlayMenuMyADDisplay, _displayAD) == 0x000350, "Member 'UPlayMenuMyADDisplay::_displayAD' has a wrong offset!");
static_assert(offsetof(UPlayMenuMyADDisplay, _playerName) == 0x000358, "Member 'UPlayMenuMyADDisplay::_playerName' has a wrong offset!");

// Class OutGameModule.AvatarCreateColorButtonWidget
// 0x0028 (0x04B0 - 0x0488)
class UAvatarCreateColorButtonWidget final : public UWidgetButton
{
public:
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 _equipImage;                                       // 0x0490(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 _backImage;                                        // 0x0498(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAvatarCreateDetailColorListEntryObject* _entryObject;                                      // 0x04A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4A8[0x8];                                      // 0x04A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AvatarCreateColorButtonWidget">();
	}
	static class UAvatarCreateColorButtonWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvatarCreateColorButtonWidget>();
	}
};
static_assert(alignof(UAvatarCreateColorButtonWidget) == 0x000008, "Wrong alignment on UAvatarCreateColorButtonWidget");
static_assert(sizeof(UAvatarCreateColorButtonWidget) == 0x0004B0, "Wrong size on UAvatarCreateColorButtonWidget");
static_assert(offsetof(UAvatarCreateColorButtonWidget, _equipImage) == 0x000490, "Member 'UAvatarCreateColorButtonWidget::_equipImage' has a wrong offset!");
static_assert(offsetof(UAvatarCreateColorButtonWidget, _backImage) == 0x000498, "Member 'UAvatarCreateColorButtonWidget::_backImage' has a wrong offset!");
static_assert(offsetof(UAvatarCreateColorButtonWidget, _entryObject) == 0x0004A0, "Member 'UAvatarCreateColorButtonWidget::_entryObject' has a wrong offset!");

// Class OutGameModule.AvatarCreateColorListWidget
// 0x0080 (0x0480 - 0x0400)
class UAvatarCreateColorListWidget final : public UCustomTileViewHasWidget
{
public:
	TMap<EAvatarDetailedAppearanceColorSettingItem, EAvatarColorParts> _colorParts;                                       // 0x0400(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)
	class UAvatarCreateColorButtonWidget*         _colorDisplayButton;                               // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAvatarCreateColorButtonWidget*         _colorDisplayButton2;                              // 0x0458(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isOpenedPalette;                                  // 0x0460(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 _blackBack;                                        // 0x0468(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_470[0x10];                                     // 0x0470(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClosePalette();
	void DoCustomWidgetNavigation(EUINavigation UiNavigation);
	void OnAddFocusPaletteButtonEvent(class UAppWidget* Widget, EWidgetInputType InputType);
	void OnDecideDisplayButtonEvent(class UAppWidget* Widget, EWidgetInputType InputType);
	void OnDecidePaletteButtonEvent(class UAppWidget* Widget, EWidgetInputType InputType);
	void OnPressDisplayButtonEvent(class UAppWidget* Widget, EWidgetInputType InputType);
	void OnPressPaletteButtonEvent(class UAppWidget* Widget, EWidgetInputType InputType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AvatarCreateColorListWidget">();
	}
	static class UAvatarCreateColorListWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvatarCreateColorListWidget>();
	}
};
static_assert(alignof(UAvatarCreateColorListWidget) == 0x000008, "Wrong alignment on UAvatarCreateColorListWidget");
static_assert(sizeof(UAvatarCreateColorListWidget) == 0x000480, "Wrong size on UAvatarCreateColorListWidget");
static_assert(offsetof(UAvatarCreateColorListWidget, _colorParts) == 0x000400, "Member 'UAvatarCreateColorListWidget::_colorParts' has a wrong offset!");
static_assert(offsetof(UAvatarCreateColorListWidget, _colorDisplayButton) == 0x000450, "Member 'UAvatarCreateColorListWidget::_colorDisplayButton' has a wrong offset!");
static_assert(offsetof(UAvatarCreateColorListWidget, _colorDisplayButton2) == 0x000458, "Member 'UAvatarCreateColorListWidget::_colorDisplayButton2' has a wrong offset!");
static_assert(offsetof(UAvatarCreateColorListWidget, _isOpenedPalette) == 0x000460, "Member 'UAvatarCreateColorListWidget::_isOpenedPalette' has a wrong offset!");
static_assert(offsetof(UAvatarCreateColorListWidget, _blackBack) == 0x000468, "Member 'UAvatarCreateColorListWidget::_blackBack' has a wrong offset!");

// Class OutGameModule.PlayMenuHamburgerWidget
// 0x0070 (0x0470 - 0x0400)
class UPlayMenuHamburgerWidget final : public UCustomTileViewHasWidget
{
public:
	class UTileView*                              _debugTileView;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPlatformWidgetButton*                  _debugButton;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                           _debugserver;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundAtomCue*                          _openAtomCue;                                      // 0x0418(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPlayMenuHamburgerLargeIconWidget*      _largeIcon01;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPlayMenuHamburgerLargeIconWidget*      _largeIcon02;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPlayMenuHamburgerLargeIconWidget*      _largeIcon03;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPlayMenuHamburgerLargeIconWidget*      _largeIcon04;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetGeneralEmptyWindow*              _emptyWindow;                                      // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetGeneralWindow*                   _titleReturnWindow;                                // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UReturnButtonWidget*                    _returnButton;                                     // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_458[0x10];                                     // 0x0458(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	EMdPlayMenuHamburgerMenuList                  _selectMenuList;                                   // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CallDebugMenuCosmosWebApi();
	void CallDebugMenuMasterData();
	void CallDebugMenuVoiceChat();
	void CloseEmptyWindow();
	int32 GetLargeIconFocusIndex();
	void NonOnlineMatchingStartBattle(const class FString& StageName);
	void OnButtonSelectEvent(EMdPlayMenuHamburgerMenuList Type, bool UseFade);
	void OnCancelEmptyWindow(class UAppWidget* Widget, EWidgetInputType InputType);
	void OnChangeBattleSequence(EBattleStartSequenceType Sequence);
	void OnClose();
	void OnClosedEmptyWindow();
	void OnCloseEvent();
	void OnDebugHoveredChangedEvent(class UObject* Item, bool bHovered);
	void OnDecidePopupWindow(class UAppWidget* Widget, EWidgetInputType InputType, bool LeftButton);
	void OnDecideReturnButton(class UAppWidget* Widget, EWidgetInputType InputType);
	void OnFinishedFadeOut();
	void OnFinishedFadeOutEvent();
	void OnFinishedFadeOutReturnTitle();
	void OnOutsideButtonDownEmptyWindow();
	void OnReturnTitleFinishedFadeOut();
	void OnSelectEvent(class UUserWidget* Widget);
	void OnTileHoveredChangedEvent(class UObject* Item, bool bHovered);
	void OntileViewNavigationDown();
	void OntileViewNavigationUp(int32 CurrentIndex);
	void OpenTitleConfirmationWindow();
	bool SetNextLargeIconFocus(bool Right);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayMenuHamburgerWidget">();
	}
	static class UPlayMenuHamburgerWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayMenuHamburgerWidget>();
	}
};
static_assert(alignof(UPlayMenuHamburgerWidget) == 0x000008, "Wrong alignment on UPlayMenuHamburgerWidget");
static_assert(sizeof(UPlayMenuHamburgerWidget) == 0x000470, "Wrong size on UPlayMenuHamburgerWidget");
static_assert(offsetof(UPlayMenuHamburgerWidget, _debugTileView) == 0x000400, "Member 'UPlayMenuHamburgerWidget::_debugTileView' has a wrong offset!");
static_assert(offsetof(UPlayMenuHamburgerWidget, _debugButton) == 0x000408, "Member 'UPlayMenuHamburgerWidget::_debugButton' has a wrong offset!");
static_assert(offsetof(UPlayMenuHamburgerWidget, _debugserver) == 0x000410, "Member 'UPlayMenuHamburgerWidget::_debugserver' has a wrong offset!");
static_assert(offsetof(UPlayMenuHamburgerWidget, _openAtomCue) == 0x000418, "Member 'UPlayMenuHamburgerWidget::_openAtomCue' has a wrong offset!");
static_assert(offsetof(UPlayMenuHamburgerWidget, _largeIcon01) == 0x000420, "Member 'UPlayMenuHamburgerWidget::_largeIcon01' has a wrong offset!");
static_assert(offsetof(UPlayMenuHamburgerWidget, _largeIcon02) == 0x000428, "Member 'UPlayMenuHamburgerWidget::_largeIcon02' has a wrong offset!");
static_assert(offsetof(UPlayMenuHamburgerWidget, _largeIcon03) == 0x000430, "Member 'UPlayMenuHamburgerWidget::_largeIcon03' has a wrong offset!");
static_assert(offsetof(UPlayMenuHamburgerWidget, _largeIcon04) == 0x000438, "Member 'UPlayMenuHamburgerWidget::_largeIcon04' has a wrong offset!");
static_assert(offsetof(UPlayMenuHamburgerWidget, _emptyWindow) == 0x000440, "Member 'UPlayMenuHamburgerWidget::_emptyWindow' has a wrong offset!");
static_assert(offsetof(UPlayMenuHamburgerWidget, _titleReturnWindow) == 0x000448, "Member 'UPlayMenuHamburgerWidget::_titleReturnWindow' has a wrong offset!");
static_assert(offsetof(UPlayMenuHamburgerWidget, _returnButton) == 0x000450, "Member 'UPlayMenuHamburgerWidget::_returnButton' has a wrong offset!");
static_assert(offsetof(UPlayMenuHamburgerWidget, _selectMenuList) == 0x000468, "Member 'UPlayMenuHamburgerWidget::_selectMenuList' has a wrong offset!");

// Class OutGameModule.AvatarCreateDetailSettingTopWidget
// 0x0028 (0x0410 - 0x03E8)
class UAvatarCreateDetailSettingTopWidget final : public UAppWidget
{
public:
	class UAvatarCreateDetailSettingWidget*       _base;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAvatarCreateDetailSettingWidget*       _color;                                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTabWidget*                             _tabWidget;                                        // 0x03F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                        _tabSwitcher;                                      // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_408[0x8];                                      // 0x0408(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_SetFocusList();
	void ChangeTab(int32 NextTab);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AvatarCreateDetailSettingTopWidget">();
	}
	static class UAvatarCreateDetailSettingTopWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvatarCreateDetailSettingTopWidget>();
	}
};
static_assert(alignof(UAvatarCreateDetailSettingTopWidget) == 0x000008, "Wrong alignment on UAvatarCreateDetailSettingTopWidget");
static_assert(sizeof(UAvatarCreateDetailSettingTopWidget) == 0x000410, "Wrong size on UAvatarCreateDetailSettingTopWidget");
static_assert(offsetof(UAvatarCreateDetailSettingTopWidget, _base) == 0x0003E8, "Member 'UAvatarCreateDetailSettingTopWidget::_base' has a wrong offset!");
static_assert(offsetof(UAvatarCreateDetailSettingTopWidget, _color) == 0x0003F0, "Member 'UAvatarCreateDetailSettingTopWidget::_color' has a wrong offset!");
static_assert(offsetof(UAvatarCreateDetailSettingTopWidget, _tabWidget) == 0x0003F8, "Member 'UAvatarCreateDetailSettingTopWidget::_tabWidget' has a wrong offset!");
static_assert(offsetof(UAvatarCreateDetailSettingTopWidget, _tabSwitcher) == 0x000400, "Member 'UAvatarCreateDetailSettingTopWidget::_tabSwitcher' has a wrong offset!");

// Class OutGameModule.AvatarCreateDetailSettingWidget
// 0x0018 (0x04A8 - 0x0490)
class UAvatarCreateDetailSettingWidget final : public UAvatarCreateAppWidget
{
public:
	FMulticastInlineDelegateProperty_             _OnOpenList;                                       // 0x0490(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
