#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OutGameModule

#include "Basic.hpp"

#include "UIFramework_structs.hpp"
#include "CommonModule_structs.hpp"
#include "GameModule_structs.hpp"
#include "SlateCore_structs.hpp"
#include "BackendSubsystem_structs.hpp"
#include "UMG_structs.hpp"
#include "OutGameModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MasterDataModule_structs.hpp"
#include "InputCore_structs.hpp"
#include "BykingUnrealModule_structs.hpp"


namespace SDK::Params
{

// Function OutGameModule.AccountLinkageWidget.OnDecideLinkableWindow
// 0x0010 (0x0010 - 0x0000)
struct AccountLinkageWidget_OnDecideLinkableWindow final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LeftButton;                                        // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AccountLinkageWidget_OnDecideLinkableWindow) == 0x000008, "Wrong alignment on AccountLinkageWidget_OnDecideLinkableWindow");
static_assert(sizeof(AccountLinkageWidget_OnDecideLinkableWindow) == 0x000010, "Wrong size on AccountLinkageWidget_OnDecideLinkableWindow");
static_assert(offsetof(AccountLinkageWidget_OnDecideLinkableWindow, Widget) == 0x000000, "Member 'AccountLinkageWidget_OnDecideLinkableWindow::Widget' has a wrong offset!");
static_assert(offsetof(AccountLinkageWidget_OnDecideLinkableWindow, InputType) == 0x000008, "Member 'AccountLinkageWidget_OnDecideLinkableWindow::InputType' has a wrong offset!");
static_assert(offsetof(AccountLinkageWidget_OnDecideLinkableWindow, LeftButton) == 0x000009, "Member 'AccountLinkageWidget_OnDecideLinkableWindow::LeftButton' has a wrong offset!");

// Function OutGameModule.AccountLinkageWidget.OnDecideLinkedConfirmWindow
// 0x0010 (0x0010 - 0x0000)
struct AccountLinkageWidget_OnDecideLinkedConfirmWindow final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LeftButton;                                        // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AccountLinkageWidget_OnDecideLinkedConfirmWindow) == 0x000008, "Wrong alignment on AccountLinkageWidget_OnDecideLinkedConfirmWindow");
static_assert(sizeof(AccountLinkageWidget_OnDecideLinkedConfirmWindow) == 0x000010, "Wrong size on AccountLinkageWidget_OnDecideLinkedConfirmWindow");
static_assert(offsetof(AccountLinkageWidget_OnDecideLinkedConfirmWindow, Widget) == 0x000000, "Member 'AccountLinkageWidget_OnDecideLinkedConfirmWindow::Widget' has a wrong offset!");
static_assert(offsetof(AccountLinkageWidget_OnDecideLinkedConfirmWindow, InputType) == 0x000008, "Member 'AccountLinkageWidget_OnDecideLinkedConfirmWindow::InputType' has a wrong offset!");
static_assert(offsetof(AccountLinkageWidget_OnDecideLinkedConfirmWindow, LeftButton) == 0x000009, "Member 'AccountLinkageWidget_OnDecideLinkedConfirmWindow::LeftButton' has a wrong offset!");

// Function OutGameModule.AccountLinkageWidget.OnDecideLinkedWindow
// 0x0010 (0x0010 - 0x0000)
struct AccountLinkageWidget_OnDecideLinkedWindow final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LeftButton;                                        // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AccountLinkageWidget_OnDecideLinkedWindow) == 0x000008, "Wrong alignment on AccountLinkageWidget_OnDecideLinkedWindow");
static_assert(sizeof(AccountLinkageWidget_OnDecideLinkedWindow) == 0x000010, "Wrong size on AccountLinkageWidget_OnDecideLinkedWindow");
static_assert(offsetof(AccountLinkageWidget_OnDecideLinkedWindow, Widget) == 0x000000, "Member 'AccountLinkageWidget_OnDecideLinkedWindow::Widget' has a wrong offset!");
static_assert(offsetof(AccountLinkageWidget_OnDecideLinkedWindow, InputType) == 0x000008, "Member 'AccountLinkageWidget_OnDecideLinkedWindow::InputType' has a wrong offset!");
static_assert(offsetof(AccountLinkageWidget_OnDecideLinkedWindow, LeftButton) == 0x000009, "Member 'AccountLinkageWidget_OnDecideLinkedWindow::LeftButton' has a wrong offset!");

// Function OutGameModule.AccountLinkageWidget.OnDecideMaintenanceWindow
// 0x0010 (0x0010 - 0x0000)
struct AccountLinkageWidget_OnDecideMaintenanceWindow final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LeftButton;                                        // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AccountLinkageWidget_OnDecideMaintenanceWindow) == 0x000008, "Wrong alignment on AccountLinkageWidget_OnDecideMaintenanceWindow");
static_assert(sizeof(AccountLinkageWidget_OnDecideMaintenanceWindow) == 0x000010, "Wrong size on AccountLinkageWidget_OnDecideMaintenanceWindow");
static_assert(offsetof(AccountLinkageWidget_OnDecideMaintenanceWindow, Widget) == 0x000000, "Member 'AccountLinkageWidget_OnDecideMaintenanceWindow::Widget' has a wrong offset!");
static_assert(offsetof(AccountLinkageWidget_OnDecideMaintenanceWindow, InputType) == 0x000008, "Member 'AccountLinkageWidget_OnDecideMaintenanceWindow::InputType' has a wrong offset!");
static_assert(offsetof(AccountLinkageWidget_OnDecideMaintenanceWindow, LeftButton) == 0x000009, "Member 'AccountLinkageWidget_OnDecideMaintenanceWindow::LeftButton' has a wrong offset!");

// Function OutGameModule.AccountLinkageWidget.OnLoadCompletedCheckBnIdStatus
// 0x0004 (0x0004 - 0x0000)
struct AccountLinkageWidget_OnLoadCompletedCheckBnIdStatus final
{
public:
	int32                                         RequestId;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccountLinkageWidget_OnLoadCompletedCheckBnIdStatus) == 0x000004, "Wrong alignment on AccountLinkageWidget_OnLoadCompletedCheckBnIdStatus");
static_assert(sizeof(AccountLinkageWidget_OnLoadCompletedCheckBnIdStatus) == 0x000004, "Wrong size on AccountLinkageWidget_OnLoadCompletedCheckBnIdStatus");
static_assert(offsetof(AccountLinkageWidget_OnLoadCompletedCheckBnIdStatus, RequestId) == 0x000000, "Member 'AccountLinkageWidget_OnLoadCompletedCheckBnIdStatus::RequestId' has a wrong offset!");

// Function OutGameModule.AccountLinkageWidget.OnLoadCompletedLoadBnIdQrCodeImage
// 0x0004 (0x0004 - 0x0000)
struct AccountLinkageWidget_OnLoadCompletedLoadBnIdQrCodeImage final
{
public:
	int32                                         RequestId;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccountLinkageWidget_OnLoadCompletedLoadBnIdQrCodeImage) == 0x000004, "Wrong alignment on AccountLinkageWidget_OnLoadCompletedLoadBnIdQrCodeImage");
static_assert(sizeof(AccountLinkageWidget_OnLoadCompletedLoadBnIdQrCodeImage) == 0x000004, "Wrong size on AccountLinkageWidget_OnLoadCompletedLoadBnIdQrCodeImage");
static_assert(offsetof(AccountLinkageWidget_OnLoadCompletedLoadBnIdQrCodeImage, RequestId) == 0x000000, "Member 'AccountLinkageWidget_OnLoadCompletedLoadBnIdQrCodeImage::RequestId' has a wrong offset!");

// Function OutGameModule.AccountLinkageWidget.OnUpdateCompletedResetBnIdLink
// 0x0004 (0x0004 - 0x0000)
struct AccountLinkageWidget_OnUpdateCompletedResetBnIdLink final
{
public:
	int32                                         RequestId;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccountLinkageWidget_OnUpdateCompletedResetBnIdLink) == 0x000004, "Wrong alignment on AccountLinkageWidget_OnUpdateCompletedResetBnIdLink");
static_assert(sizeof(AccountLinkageWidget_OnUpdateCompletedResetBnIdLink) == 0x000004, "Wrong size on AccountLinkageWidget_OnUpdateCompletedResetBnIdLink");
static_assert(offsetof(AccountLinkageWidget_OnUpdateCompletedResetBnIdLink, RequestId) == 0x000000, "Member 'AccountLinkageWidget_OnUpdateCompletedResetBnIdLink::RequestId' has a wrong offset!");

// Function OutGameModule.AccountSelectWidget.ClosePopup
// 0x0010 (0x0010 - 0x0000)
struct AccountSelectWidget_ClosePopup final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LeftButton;                                        // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AccountSelectWidget_ClosePopup) == 0x000008, "Wrong alignment on AccountSelectWidget_ClosePopup");
static_assert(sizeof(AccountSelectWidget_ClosePopup) == 0x000010, "Wrong size on AccountSelectWidget_ClosePopup");
static_assert(offsetof(AccountSelectWidget_ClosePopup, Widget) == 0x000000, "Member 'AccountSelectWidget_ClosePopup::Widget' has a wrong offset!");
static_assert(offsetof(AccountSelectWidget_ClosePopup, InputType) == 0x000008, "Member 'AccountSelectWidget_ClosePopup::InputType' has a wrong offset!");
static_assert(offsetof(AccountSelectWidget_ClosePopup, LeftButton) == 0x000009, "Member 'AccountSelectWidget_ClosePopup::LeftButton' has a wrong offset!");

// Function OutGameModule.PlayMenuBattleRuleWidget.GetSelectedBattleRuleStageData
// 0x0004 (0x0004 - 0x0000)
struct PlayMenuBattleRuleWidget_GetSelectedBattleRuleStageData final
{
public:
	int32                                         StageCode;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayMenuBattleRuleWidget_GetSelectedBattleRuleStageData) == 0x000004, "Wrong alignment on PlayMenuBattleRuleWidget_GetSelectedBattleRuleStageData");
static_assert(sizeof(PlayMenuBattleRuleWidget_GetSelectedBattleRuleStageData) == 0x000004, "Wrong size on PlayMenuBattleRuleWidget_GetSelectedBattleRuleStageData");
static_assert(offsetof(PlayMenuBattleRuleWidget_GetSelectedBattleRuleStageData, StageCode) == 0x000000, "Member 'PlayMenuBattleRuleWidget_GetSelectedBattleRuleStageData::StageCode' has a wrong offset!");

// Function OutGameModule.PlayMenuBattleRuleWidget.OnChangeBattleSequence
// 0x0001 (0x0001 - 0x0000)
struct PlayMenuBattleRuleWidget_OnChangeBattleSequence final
{
public:
	EBattleStartSequenceType                      Sequence;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayMenuBattleRuleWidget_OnChangeBattleSequence) == 0x000001, "Wrong alignment on PlayMenuBattleRuleWidget_OnChangeBattleSequence");
static_assert(sizeof(PlayMenuBattleRuleWidget_OnChangeBattleSequence) == 0x000001, "Wrong size on PlayMenuBattleRuleWidget_OnChangeBattleSequence");
static_assert(offsetof(PlayMenuBattleRuleWidget_OnChangeBattleSequence, Sequence) == 0x000000, "Member 'PlayMenuBattleRuleWidget_OnChangeBattleSequence::Sequence' has a wrong offset!");

// Function OutGameModule.PlayMenuBattleRuleWidget.OnGrayOutEvent
// 0x0001 (0x0001 - 0x0000)
struct PlayMenuBattleRuleWidget_OnGrayOutEvent final
{
public:
	bool                                          bIsGrayOut;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayMenuBattleRuleWidget_OnGrayOutEvent) == 0x000001, "Wrong alignment on PlayMenuBattleRuleWidget_OnGrayOutEvent");
static_assert(sizeof(PlayMenuBattleRuleWidget_OnGrayOutEvent) == 0x000001, "Wrong size on PlayMenuBattleRuleWidget_OnGrayOutEvent");
static_assert(offsetof(PlayMenuBattleRuleWidget_OnGrayOutEvent, bIsGrayOut) == 0x000000, "Member 'PlayMenuBattleRuleWidget_OnGrayOutEvent::bIsGrayOut' has a wrong offset!");

// Function OutGameModule.PlayMenuBattleRuleWidget.OnPressButtonWidget
// 0x0010 (0x0010 - 0x0000)
struct PlayMenuBattleRuleWidget_OnPressButtonWidget final
{
public:
	class UAppWidget*                             Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PlayMenuBattleRuleWidget_OnPressButtonWidget) == 0x000008, "Wrong alignment on PlayMenuBattleRuleWidget_OnPressButtonWidget");
static_assert(sizeof(PlayMenuBattleRuleWidget_OnPressButtonWidget) == 0x000010, "Wrong size on PlayMenuBattleRuleWidget_OnPressButtonWidget");
static_assert(offsetof(PlayMenuBattleRuleWidget_OnPressButtonWidget, Button) == 0x000000, "Member 'PlayMenuBattleRuleWidget_OnPressButtonWidget::Button' has a wrong offset!");
static_assert(offsetof(PlayMenuBattleRuleWidget_OnPressButtonWidget, InputType) == 0x000008, "Member 'PlayMenuBattleRuleWidget_OnPressButtonWidget::InputType' has a wrong offset!");

// Function OutGameModule.PlayMenuBattleRuleWidget.OnSquadNumChanged
// 0x0004 (0x0004 - 0x0000)
struct PlayMenuBattleRuleWidget_OnSquadNumChanged final
{
public:
	int32                                         SquadNum;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayMenuBattleRuleWidget_OnSquadNumChanged) == 0x000004, "Wrong alignment on PlayMenuBattleRuleWidget_OnSquadNumChanged");
static_assert(sizeof(PlayMenuBattleRuleWidget_OnSquadNumChanged) == 0x000004, "Wrong size on PlayMenuBattleRuleWidget_OnSquadNumChanged");
static_assert(offsetof(PlayMenuBattleRuleWidget_OnSquadNumChanged, SquadNum) == 0x000000, "Member 'PlayMenuBattleRuleWidget_OnSquadNumChanged::SquadNum' has a wrong offset!");

// Function OutGameModule.AnimationOutGame.BP_PlayAnimationOutGame
// 0x000C (0x000C - 0x0000)
struct AnimationOutGame_BP_PlayAnimationOutGame final
{
public:
	EAnimOutGameId                                ID;                                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayRate;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimationOutGame_BP_PlayAnimationOutGame) == 0x000004, "Wrong alignment on AnimationOutGame_BP_PlayAnimationOutGame");
static_assert(sizeof(AnimationOutGame_BP_PlayAnimationOutGame) == 0x00000C, "Wrong size on AnimationOutGame_BP_PlayAnimationOutGame");
static_assert(offsetof(AnimationOutGame_BP_PlayAnimationOutGame, ID) == 0x000000, "Member 'AnimationOutGame_BP_PlayAnimationOutGame::ID' has a wrong offset!");
static_assert(offsetof(AnimationOutGame_BP_PlayAnimationOutGame, PlayRate) == 0x000004, "Member 'AnimationOutGame_BP_PlayAnimationOutGame::PlayRate' has a wrong offset!");
static_assert(offsetof(AnimationOutGame_BP_PlayAnimationOutGame, BlendInTime) == 0x000008, "Member 'AnimationOutGame_BP_PlayAnimationOutGame::BlendInTime' has a wrong offset!");

// Function OutGameModule.AvatarCreateAppWidget.BP_GetEntryObject
// 0x0008 (0x0008 - 0x0000)
struct AvatarCreateAppWidget_BP_GetEntryObject final
{
public:
	class UAvatarCreateBaseListEntryObject*       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AvatarCreateAppWidget_BP_GetEntryObject) == 0x000008, "Wrong alignment on AvatarCreateAppWidget_BP_GetEntryObject");
static_assert(sizeof(AvatarCreateAppWidget_BP_GetEntryObject) == 0x000008, "Wrong size on AvatarCreateAppWidget_BP_GetEntryObject");
static_assert(offsetof(AvatarCreateAppWidget_BP_GetEntryObject, ReturnValue) == 0x000000, "Member 'AvatarCreateAppWidget_BP_GetEntryObject::ReturnValue' has a wrong offset!");

// Function OutGameModule.AvatarCreateAppWidget.BP_SetFocusItem
// 0x0004 (0x0004 - 0x0000)
struct AvatarCreateAppWidget_BP_SetFocusItem final
{
public:
	int32                                         FocusIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AvatarCreateAppWidget_BP_SetFocusItem) == 0x000004, "Wrong alignment on AvatarCreateAppWidget_BP_SetFocusItem");
static_assert(sizeof(AvatarCreateAppWidget_BP_SetFocusItem) == 0x000004, "Wrong size on AvatarCreateAppWidget_BP_SetFocusItem");
static_assert(offsetof(AvatarCreateAppWidget_BP_SetFocusItem, FocusIndex) == 0x000000, "Member 'AvatarCreateAppWidget_BP_SetFocusItem::FocusIndex' has a wrong offset!");

// Function OutGameModule.AvatarCreateAppWidget.DoCustomWidgetNavigation
// 0x0001 (0x0001 - 0x0000)
struct AvatarCreateAppWidget_DoCustomWidgetNavigation final
{
public:
	EUINavigation                                 UiNavigation;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AvatarCreateAppWidget_DoCustomWidgetNavigation) == 0x000001, "Wrong alignment on AvatarCreateAppWidget_DoCustomWidgetNavigation");
static_assert(sizeof(AvatarCreateAppWidget_DoCustomWidgetNavigation) == 0x000001, "Wrong size on AvatarCreateAppWidget_DoCustomWidgetNavigation");
static_assert(offsetof(AvatarCreateAppWidget_DoCustomWidgetNavigation, UiNavigation) == 0x000000, "Member 'AvatarCreateAppWidget_DoCustomWidgetNavigation::UiNavigation' has a wrong offset!");

// Function OutGameModule.AvatarCreateAppWidget.OnDecideEvent
// 0x0010 (0x0010 - 0x0000)
struct AvatarCreateAppWidget_OnDecideEvent final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AvatarCreateAppWidget_OnDecideEvent) == 0x000008, "Wrong alignment on AvatarCreateAppWidget_OnDecideEvent");
static_assert(sizeof(AvatarCreateAppWidget_OnDecideEvent) == 0x000010, "Wrong size on AvatarCreateAppWidget_OnDecideEvent");
static_assert(offsetof(AvatarCreateAppWidget_OnDecideEvent, Widget) == 0x000000, "Member 'AvatarCreateAppWidget_OnDecideEvent::Widget' has a wrong offset!");
static_assert(offsetof(AvatarCreateAppWidget_OnDecideEvent, InputType) == 0x000008, "Member 'AvatarCreateAppWidget_OnDecideEvent::InputType' has a wrong offset!");

// Function OutGameModule.AvatarCreateAppWidget.OnFocusEvent
// 0x0010 (0x0010 - 0x0000)
struct AvatarCreateAppWidget_OnFocusEvent final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AvatarCreateAppWidget_OnFocusEvent) == 0x000008, "Wrong alignment on AvatarCreateAppWidget_OnFocusEvent");
static_assert(sizeof(AvatarCreateAppWidget_OnFocusEvent) == 0x000010, "Wrong size on AvatarCreateAppWidget_OnFocusEvent");
static_assert(offsetof(AvatarCreateAppWidget_OnFocusEvent, Widget) == 0x000000, "Member 'AvatarCreateAppWidget_OnFocusEvent::Widget' has a wrong offset!");
static_assert(offsetof(AvatarCreateAppWidget_OnFocusEvent, InputType) == 0x000008, "Member 'AvatarCreateAppWidget_OnFocusEvent::InputType' has a wrong offset!");

// Function OutGameModule.AvatarCreateAppWidget.OnPressEvent
// 0x0010 (0x0010 - 0x0000)
struct AvatarCreateAppWidget_OnPressEvent final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AvatarCreateAppWidget_OnPressEvent) == 0x000008, "Wrong alignment on AvatarCreateAppWidget_OnPressEvent");
static_assert(sizeof(AvatarCreateAppWidget_OnPressEvent) == 0x000010, "Wrong size on AvatarCreateAppWidget_OnPressEvent");
static_assert(offsetof(AvatarCreateAppWidget_OnPressEvent, Widget) == 0x000000, "Member 'AvatarCreateAppWidget_OnPressEvent::Widget' has a wrong offset!");
static_assert(offsetof(AvatarCreateAppWidget_OnPressEvent, InputType) == 0x000008, "Member 'AvatarCreateAppWidget_OnPressEvent::InputType' has a wrong offset!");

// Function OutGameModule.AvatarCreateAppWidget.OnRemoveFocusEvent
// 0x0010 (0x0010 - 0x0000)
struct AvatarCreateAppWidget_OnRemoveFocusEvent final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AvatarCreateAppWidget_OnRemoveFocusEvent) == 0x000008, "Wrong alignment on AvatarCreateAppWidget_OnRemoveFocusEvent");
static_assert(sizeof(AvatarCreateAppWidget_OnRemoveFocusEvent) == 0x000010, "Wrong size on AvatarCreateAppWidget_OnRemoveFocusEvent");
static_assert(offsetof(AvatarCreateAppWidget_OnRemoveFocusEvent, Widget) == 0x000000, "Member 'AvatarCreateAppWidget_OnRemoveFocusEvent::Widget' has a wrong offset!");
static_assert(offsetof(AvatarCreateAppWidget_OnRemoveFocusEvent, InputType) == 0x000008, "Member 'AvatarCreateAppWidget_OnRemoveFocusEvent::InputType' has a wrong offset!");

// Function OutGameModule.AvatarCreateSlotWidgetBase.BP_SetuptImageWidget
// 0x0080 (0x0080 - 0x0000)
struct AvatarCreateSlotWidgetBase_BP_SetuptImageWidget final
{
public:
	struct FAvatarCreateImageData                 ImageData;                                         // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UAvatarCreateSlotWidgetBase*            ReturnValue;                                       // 0x0078(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AvatarCreateSlotWidgetBase_BP_SetuptImageWidget) == 0x000008, "Wrong alignment on AvatarCreateSlotWidgetBase_BP_SetuptImageWidget");
static_assert(sizeof(AvatarCreateSlotWidgetBase_BP_SetuptImageWidget) == 0x000080, "Wrong size on AvatarCreateSlotWidgetBase_BP_SetuptImageWidget");
static_assert(offsetof(AvatarCreateSlotWidgetBase_BP_SetuptImageWidget, ImageData) == 0x000000, "Member 'AvatarCreateSlotWidgetBase_BP_SetuptImageWidget::ImageData' has a wrong offset!");
static_assert(offsetof(AvatarCreateSlotWidgetBase_BP_SetuptImageWidget, ReturnValue) == 0x000078, "Member 'AvatarCreateSlotWidgetBase_BP_SetuptImageWidget::ReturnValue' has a wrong offset!");

// Function OutGameModule.AvatarCreateSlotWidgetBase.BP_SetuptMenuWidget
// 0x00F0 (0x00F0 - 0x0000)
struct AvatarCreateSlotWidgetBase_BP_SetuptMenuWidget final
{
public:
	struct FAvatarCreateMenuData                  MenuData;                                          // 0x0000(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UAvatarCreateSlotWidgetBase*            ReturnValue;                                       // 0x00E8(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AvatarCreateSlotWidgetBase_BP_SetuptMenuWidget) == 0x000008, "Wrong alignment on AvatarCreateSlotWidgetBase_BP_SetuptMenuWidget");
static_assert(sizeof(AvatarCreateSlotWidgetBase_BP_SetuptMenuWidget) == 0x0000F0, "Wrong size on AvatarCreateSlotWidgetBase_BP_SetuptMenuWidget");
static_assert(offsetof(AvatarCreateSlotWidgetBase_BP_SetuptMenuWidget, MenuData) == 0x000000, "Member 'AvatarCreateSlotWidgetBase_BP_SetuptMenuWidget::MenuData' has a wrong offset!");
static_assert(offsetof(AvatarCreateSlotWidgetBase_BP_SetuptMenuWidget, ReturnValue) == 0x0000E8, "Member 'AvatarCreateSlotWidgetBase_BP_SetuptMenuWidget::ReturnValue' has a wrong offset!");

// Function OutGameModule.AvatarCreateSlotWidgetBase.BP_SetVoiceData
// 0x0008 (0x0008 - 0x0000)
struct AvatarCreateSlotWidgetBase_BP_SetVoiceData final
{
public:
	struct FAvatarCreateVoiceData                 VoiceData;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AvatarCreateSlotWidgetBase_BP_SetVoiceData) == 0x000004, "Wrong alignment on AvatarCreateSlotWidgetBase_BP_SetVoiceData");
static_assert(sizeof(AvatarCreateSlotWidgetBase_BP_SetVoiceData) == 0x000008, "Wrong size on AvatarCreateSlotWidgetBase_BP_SetVoiceData");
static_assert(offsetof(AvatarCreateSlotWidgetBase_BP_SetVoiceData, VoiceData) == 0x000000, "Member 'AvatarCreateSlotWidgetBase_BP_SetVoiceData::VoiceData' has a wrong offset!");

// Function OutGameModule.AvatarCreateSlotWidgetBase.BP_UpdateSoundWidgetDiplay
// 0x0002 (0x0002 - 0x0000)
struct AvatarCreateSlotWidgetBase_BP_UpdateSoundWidgetDiplay final
{
public:
	bool                                          Hidden;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AvatarCreateSlotWidgetBase_BP_UpdateSoundWidgetDiplay) == 0x000001, "Wrong alignment on AvatarCreateSlotWidgetBase_BP_UpdateSoundWidgetDiplay");
static_assert(sizeof(AvatarCreateSlotWidgetBase_BP_UpdateSoundWidgetDiplay) == 0x000002, "Wrong size on AvatarCreateSlotWidgetBase_BP_UpdateSoundWidgetDiplay");
static_assert(offsetof(AvatarCreateSlotWidgetBase_BP_UpdateSoundWidgetDiplay, Hidden) == 0x000000, "Member 'AvatarCreateSlotWidgetBase_BP_UpdateSoundWidgetDiplay::Hidden' has a wrong offset!");
static_assert(offsetof(AvatarCreateSlotWidgetBase_BP_UpdateSoundWidgetDiplay, ReturnValue) == 0x000001, "Member 'AvatarCreateSlotWidgetBase_BP_UpdateSoundWidgetDiplay::ReturnValue' has a wrong offset!");

// Function OutGameModule.AvatarCreateSlotWidgetBase.OnPressButton
// 0x0010 (0x0010 - 0x0000)
struct AvatarCreateSlotWidgetBase_OnPressButton final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AvatarCreateSlotWidgetBase_OnPressButton) == 0x000008, "Wrong alignment on AvatarCreateSlotWidgetBase_OnPressButton");
static_assert(sizeof(AvatarCreateSlotWidgetBase_OnPressButton) == 0x000010, "Wrong size on AvatarCreateSlotWidgetBase_OnPressButton");
static_assert(offsetof(AvatarCreateSlotWidgetBase_OnPressButton, Widget) == 0x000000, "Member 'AvatarCreateSlotWidgetBase_OnPressButton::Widget' has a wrong offset!");
static_assert(offsetof(AvatarCreateSlotWidgetBase_OnPressButton, InputType) == 0x000008, "Member 'AvatarCreateSlotWidgetBase_OnPressButton::InputType' has a wrong offset!");

// Function OutGameModule.AvatarCreateBattleStyleSlotWidget.BP_GetBattleStlyeImage
// 0x0010 (0x0010 - 0x0000)
struct AvatarCreateBattleStyleSlotWidget_BP_GetBattleStlyeImage final
{
public:
	ECharacterId                                  CharaID;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AvatarCreateBattleStyleSlotWidget_BP_GetBattleStlyeImage) == 0x000008, "Wrong alignment on AvatarCreateBattleStyleSlotWidget_BP_GetBattleStlyeImage");
static_assert(sizeof(AvatarCreateBattleStyleSlotWidget_BP_GetBattleStlyeImage) == 0x000010, "Wrong size on AvatarCreateBattleStyleSlotWidget_BP_GetBattleStlyeImage");
static_assert(offsetof(AvatarCreateBattleStyleSlotWidget_BP_GetBattleStlyeImage, CharaID) == 0x000000, "Member 'AvatarCreateBattleStyleSlotWidget_BP_GetBattleStlyeImage::CharaID' has a wrong offset!");
static_assert(offsetof(AvatarCreateBattleStyleSlotWidget_BP_GetBattleStlyeImage, ReturnValue) == 0x000008, "Member 'AvatarCreateBattleStyleSlotWidget_BP_GetBattleStlyeImage::ReturnValue' has a wrong offset!");

// Function OutGameModule.AvatarCreateBattleStyleSlotWidget.BP_GetBattleStlyeText
// 0x0020 (0x0020 - 0x0000)
struct AvatarCreateBattleStyleSlotWidget_BP_GetBattleStlyeText final
{
public:
	ECharacterId                                  CharaID;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AvatarCreateBattleStyleSlotWidget_BP_GetBattleStlyeText) == 0x000008, "Wrong alignment on AvatarCreateBattleStyleSlotWidget_BP_GetBattleStlyeText");
static_assert(sizeof(AvatarCreateBattleStyleSlotWidget_BP_GetBattleStlyeText) == 0x000020, "Wrong size on AvatarCreateBattleStyleSlotWidget_BP_GetBattleStlyeText");
static_assert(offsetof(AvatarCreateBattleStyleSlotWidget_BP_GetBattleStlyeText, CharaID) == 0x000000, "Member 'AvatarCreateBattleStyleSlotWidget_BP_GetBattleStlyeText::CharaID' has a wrong offset!");
static_assert(offsetof(AvatarCreateBattleStyleSlotWidget_BP_GetBattleStlyeText, ReturnValue) == 0x000008, "Member 'AvatarCreateBattleStyleSlotWidget_BP_GetBattleStlyeText::ReturnValue' has a wrong offset!");

// Function OutGameModule.PlayMenuRequestMessage.OnNewInviteFlag
// 0x0001 (0x0001 - 0x0000)
struct PlayMenuRequestMessage_OnNewInviteFlag final
{
public:
	bool                                          Flag;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayMenuRequestMessage_OnNewInviteFlag) == 0x000001, "Wrong alignment on PlayMenuRequestMessage_OnNewInviteFlag");
static_assert(sizeof(PlayMenuRequestMessage_OnNewInviteFlag) == 0x000001, "Wrong size on PlayMenuRequestMessage_OnNewInviteFlag");
static_assert(offsetof(PlayMenuRequestMessage_OnNewInviteFlag, Flag) == 0x000000, "Member 'PlayMenuRequestMessage_OnNewInviteFlag::Flag' has a wrong offset!");

// Function OutGameModule.AvatarCreateBattleStyleWidget.OnDecideButtonWidget
// 0x0010 (0x0010 - 0x0000)
struct AvatarCreateBattleStyleWidget_OnDecideButtonWidget final
{
public:
	class UAppWidget*                             Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AvatarCreateBattleStyleWidget_OnDecideButtonWidget) == 0x000008, "Wrong alignment on AvatarCreateBattleStyleWidget_OnDecideButtonWidget");
static_assert(sizeof(AvatarCreateBattleStyleWidget_OnDecideButtonWidget) == 0x000010, "Wrong size on AvatarCreateBattleStyleWidget_OnDecideButtonWidget");
static_assert(offsetof(AvatarCreateBattleStyleWidget_OnDecideButtonWidget, Button) == 0x000000, "Member 'AvatarCreateBattleStyleWidget_OnDecideButtonWidget::Button' has a wrong offset!");
static_assert(offsetof(AvatarCreateBattleStyleWidget_OnDecideButtonWidget, InputType) == 0x000008, "Member 'AvatarCreateBattleStyleWidget_OnDecideButtonWidget::InputType' has a wrong offset!");

// Function OutGameModule.AvatarCreateBattleStyleWidget.OnMouseButtonDownBackGround
// 0x0160 (0x0160 - 0x0000)
struct AvatarCreateBattleStyleWidget_OnMouseButtonDownBackGround final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AvatarCreateBattleStyleWidget_OnMouseButtonDownBackGround) == 0x000008, "Wrong alignment on AvatarCreateBattleStyleWidget_OnMouseButtonDownBackGround");
static_assert(sizeof(AvatarCreateBattleStyleWidget_OnMouseButtonDownBackGround) == 0x000160, "Wrong size on AvatarCreateBattleStyleWidget_OnMouseButtonDownBackGround");
static_assert(offsetof(AvatarCreateBattleStyleWidget_OnMouseButtonDownBackGround, MyGeometry) == 0x000000, "Member 'AvatarCreateBattleStyleWidget_OnMouseButtonDownBackGround::MyGeometry' has a wrong offset!");
static_assert(offsetof(AvatarCreateBattleStyleWidget_OnMouseButtonDownBackGround, MouseEvent) == 0x000038, "Member 'AvatarCreateBattleStyleWidget_OnMouseButtonDownBackGround::MouseEvent' has a wrong offset!");
static_assert(offsetof(AvatarCreateBattleStyleWidget_OnMouseButtonDownBackGround, ReturnValue) == 0x0000A8, "Member 'AvatarCreateBattleStyleWidget_OnMouseButtonDownBackGround::ReturnValue' has a wrong offset!");

// Function OutGameModule.AvatarCreateBattleStyleWidget.OnNegativeButtonWidget
// 0x0010 (0x0010 - 0x0000)
struct AvatarCreateBattleStyleWidget_OnNegativeButtonWidget final
{
public:
	class UAppWidget*                             Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AvatarCreateBattleStyleWidget_OnNegativeButtonWidget) == 0x000008, "Wrong alignment on AvatarCreateBattleStyleWidget_OnNegativeButtonWidget");
static_assert(sizeof(AvatarCreateBattleStyleWidget_OnNegativeButtonWidget) == 0x000010, "Wrong size on AvatarCreateBattleStyleWidget_OnNegativeButtonWidget");
static_assert(offsetof(AvatarCreateBattleStyleWidget_OnNegativeButtonWidget, Button) == 0x000000, "Member 'AvatarCreateBattleStyleWidget_OnNegativeButtonWidget::Button' has a wrong offset!");
static_assert(offsetof(AvatarCreateBattleStyleWidget_OnNegativeButtonWidget, InputType) == 0x000008, "Member 'AvatarCreateBattleStyleWidget_OnNegativeButtonWidget::InputType' has a wrong offset!");

// Function OutGameModule.AvatarCreateBattleStyleWidget.OnPressButtonWidget
// 0x0010 (0x0010 - 0x0000)
struct AvatarCreateBattleStyleWidget_OnPressButtonWidget final
{
public:
	class UAppWidget*                             Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AvatarCreateBattleStyleWidget_OnPressButtonWidget) == 0x000008, "Wrong alignment on AvatarCreateBattleStyleWidget_OnPressButtonWidget");
static_assert(sizeof(AvatarCreateBattleStyleWidget_OnPressButtonWidget) == 0x000010, "Wrong size on AvatarCreateBattleStyleWidget_OnPressButtonWidget");
static_assert(offsetof(AvatarCreateBattleStyleWidget_OnPressButtonWidget, Button) == 0x000000, "Member 'AvatarCreateBattleStyleWidget_OnPressButtonWidget::Button' has a wrong offset!");
static_assert(offsetof(AvatarCreateBattleStyleWidget_OnPressButtonWidget, InputType) == 0x000008, "Member 'AvatarCreateBattleStyleWidget_OnPressButtonWidget::InputType' has a wrong offset!");

// Function OutGameModule.AvatarCreateButtonWidget.BP_GetFunctionSlotWidget
// 0x0008 (0x0008 - 0x0000)
struct AvatarCreateButtonWidget_BP_GetFunctionSlotWidget final
{
public:
	class UAvatarCreateFunctionSlotWidget*        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AvatarCreateButtonWidget_BP_GetFunctionSlotWidget) == 0x000008, "Wrong alignment on AvatarCreateButtonWidget_BP_GetFunctionSlotWidget");
static_assert(sizeof(AvatarCreateButtonWidget_BP_GetFunctionSlotWidget) == 0x000008, "Wrong size on AvatarCreateButtonWidget_BP_GetFunctionSlotWidget");
static_assert(offsetof(AvatarCreateButtonWidget_BP_GetFunctionSlotWidget, ReturnValue) == 0x000000, "Member 'AvatarCreateButtonWidget_BP_GetFunctionSlotWidget::ReturnValue' has a wrong offset!");

// Function OutGameModule.AvatarCreateButtonWidget.BP_SetEntryObject
// 0x0008 (0x0008 - 0x0000)
struct AvatarCreateButtonWidget_BP_SetEntryObject final
{
public:
	class UAvatarCreateBaseListEntryObject*       Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AvatarCreateButtonWidget_BP_SetEntryObject) == 0x000008, "Wrong alignment on AvatarCreateButtonWidget_BP_SetEntryObject");
static_assert(sizeof(AvatarCreateButtonWidget_BP_SetEntryObject) == 0x000008, "Wrong size on AvatarCreateButtonWidget_BP_SetEntryObject");
static_assert(offsetof(AvatarCreateButtonWidget_BP_SetEntryObject, Item) == 0x000000, "Member 'AvatarCreateButtonWidget_BP_SetEntryObject::Item' has a wrong offset!");

// Function OutGameModule.AvatarCreateButtonWidget.BP_SetupButtonStyle
// 0x0058 (0x0058 - 0x0000)
struct AvatarCreateButtonWidget_BP_SetupButtonStyle final
{
public:
	float                                         ProgressRate;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ProgressColor;                                     // 0x0004(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            Color;                                             // 0x0018(0x0028)(Parm, NativeAccessSpecifierPublic)
	ESlateVisibility                              ImageVisibility;                                   // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            NamedSlotWidget;                                   // 0x0048(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            NamedFunctionSlotWidget;                           // 0x0050(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AvatarCreateButtonWidget_BP_SetupButtonStyle) == 0x000008, "Wrong alignment on AvatarCreateButtonWidget_BP_SetupButtonStyle");
static_assert(sizeof(AvatarCreateButtonWidget_BP_SetupButtonStyle) == 0x000058, "Wrong size on AvatarCreateButtonWidget_BP_SetupButtonStyle");
static_assert(offsetof(AvatarCreateButtonWidget_BP_SetupButtonStyle, ProgressRate) == 0x000000, "Member 'AvatarCreateButtonWidget_BP_SetupButtonStyle::ProgressRate' has a wrong offset!");
static_assert(offsetof(AvatarCreateButtonWidget_BP_SetupButtonStyle, ProgressColor) == 0x000004, "Member 'AvatarCreateButtonWidget_BP_SetupButtonStyle::ProgressColor' has a wrong offset!");
static_assert(offsetof(AvatarCreateButtonWidget_BP_SetupButtonStyle, Color) == 0x000018, "Member 'AvatarCreateButtonWidget_BP_SetupButtonStyle::Color' has a wrong offset!");
static_assert(offsetof(AvatarCreateButtonWidget_BP_SetupButtonStyle, ImageVisibility) == 0x000040, "Member 'AvatarCreateButtonWidget_BP_SetupButtonStyle::ImageVisibility' has a wrong offset!");
static_assert(offsetof(AvatarCreateButtonWidget_BP_SetupButtonStyle, NamedSlotWidget) == 0x000048, "Member 'AvatarCreateButtonWidget_BP_SetupButtonStyle::NamedSlotWidget' has a wrong offset!");
static_assert(offsetof(AvatarCreateButtonWidget_BP_SetupButtonStyle, NamedFunctionSlotWidget) == 0x000050, "Member 'AvatarCreateButtonWidget_BP_SetupButtonStyle::NamedFunctionSlotWidget' has a wrong offset!");

// Function OutGameModule.AvatarCreateButtonWidget.BP_GetEntryObject
// 0x0008 (0x0008 - 0x0000)
struct AvatarCreateButtonWidget_BP_GetEntryObject final
{
public:
	class UAvatarCreateBaseListEntryObject*       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AvatarCreateButtonWidget_BP_GetEntryObject) == 0x000008, "Wrong alignment on AvatarCreateButtonWidget_BP_GetEntryObject");
static_assert(sizeof(AvatarCreateButtonWidget_BP_GetEntryObject) == 0x000008, "Wrong size on AvatarCreateButtonWidget_BP_GetEntryObject");
static_assert(offsetof(AvatarCreateButtonWidget_BP_GetEntryObject, ReturnValue) == 0x000000, "Member 'AvatarCreateButtonWidget_BP_GetEntryObject::ReturnValue' has a wrong offset!");

// Function OutGameModule.AvatarCreateColorListWidget.DoCustomWidgetNavigation
// 0x0001 (0x0001 - 0x0000)
struct AvatarCreateColorListWidget_DoCustomWidgetNavigation final
{
public:
	EUINavigation                                 UiNavigation;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AvatarCreateColorListWidget_DoCustomWidgetNavigation) == 0x000001, "Wrong alignment on AvatarCreateColorListWidget_DoCustomWidgetNavigation");
static_assert(sizeof(AvatarCreateColorListWidget_DoCustomWidgetNavigation) == 0x000001, "Wrong size on AvatarCreateColorListWidget_DoCustomWidgetNavigation");
static_assert(offsetof(AvatarCreateColorListWidget_DoCustomWidgetNavigation, UiNavigation) == 0x000000, "Member 'AvatarCreateColorListWidget_DoCustomWidgetNavigation::UiNavigation' has a wrong offset!");

// Function OutGameModule.AvatarCreateColorListWidget.OnAddFocusPaletteButtonEvent
// 0x0010 (0x0010 - 0x0000)
struct AvatarCreateColorListWidget_OnAddFocusPaletteButtonEvent final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AvatarCreateColorListWidget_OnAddFocusPaletteButtonEvent) == 0x000008, "Wrong alignment on AvatarCreateColorListWidget_OnAddFocusPaletteButtonEvent");
static_assert(sizeof(AvatarCreateColorListWidget_OnAddFocusPaletteButtonEvent) == 0x000010, "Wrong size on AvatarCreateColorListWidget_OnAddFocusPaletteButtonEvent");
static_assert(offsetof(AvatarCreateColorListWidget_OnAddFocusPaletteButtonEvent, Widget) == 0x000000, "Member 'AvatarCreateColorListWidget_OnAddFocusPaletteButtonEvent::Widget' has a wrong offset!");
static_assert(offsetof(AvatarCreateColorListWidget_OnAddFocusPaletteButtonEvent, InputType) == 0x000008, "Member 'AvatarCreateColorListWidget_OnAddFocusPaletteButtonEvent::InputType' has a wrong offset!");

// Function OutGameModule.AvatarCreateColorListWidget.OnDecideDisplayButtonEvent
// 0x0010 (0x0010 - 0x0000)
struct AvatarCreateColorListWidget_OnDecideDisplayButtonEvent final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AvatarCreateColorListWidget_OnDecideDisplayButtonEvent) == 0x000008, "Wrong alignment on AvatarCreateColorListWidget_OnDecideDisplayButtonEvent");
static_assert(sizeof(AvatarCreateColorListWidget_OnDecideDisplayButtonEvent) == 0x000010, "Wrong size on AvatarCreateColorListWidget_OnDecideDisplayButtonEvent");
static_assert(offsetof(AvatarCreateColorListWidget_OnDecideDisplayButtonEvent, Widget) == 0x000000, "Member 'AvatarCreateColorListWidget_OnDecideDisplayButtonEvent::Widget' has a wrong offset!");
static_assert(offsetof(AvatarCreateColorListWidget_OnDecideDisplayButtonEvent, InputType) == 0x000008, "Member 'AvatarCreateColorListWidget_OnDecideDisplayButtonEvent::InputType' has a wrong offset!");

// Function OutGameModule.AvatarCreateColorListWidget.OnDecidePaletteButtonEvent
// 0x0010 (0x0010 - 0x0000)
struct AvatarCreateColorListWidget_OnDecidePaletteButtonEvent final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AvatarCreateColorListWidget_OnDecidePaletteButtonEvent) == 0x000008, "Wrong alignment on AvatarCreateColorListWidget_OnDecidePaletteButtonEvent");
static_assert(sizeof(AvatarCreateColorListWidget_OnDecidePaletteButtonEvent) == 0x000010, "Wrong size on AvatarCreateColorListWidget_OnDecidePaletteButtonEvent");
static_assert(offsetof(AvatarCreateColorListWidget_OnDecidePaletteButtonEvent, Widget) == 0x000000, "Member 'AvatarCreateColorListWidget_OnDecidePaletteButtonEvent::Widget' has a wrong offset!");
static_assert(offsetof(AvatarCreateColorListWidget_OnDecidePaletteButtonEvent, InputType) == 0x000008, "Member 'AvatarCreateColorListWidget_OnDecidePaletteButtonEvent::InputType' has a wrong offset!");

// Function OutGameModule.AvatarCreateColorListWidget.OnPressDisplayButtonEvent
// 0x0010 (0x0010 - 0x0000)
struct AvatarCreateColorListWidget_OnPressDisplayButtonEvent final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AvatarCreateColorListWidget_OnPressDisplayButtonEvent) == 0x000008, "Wrong alignment on AvatarCreateColorListWidget_OnPressDisplayButtonEvent");
static_assert(sizeof(AvatarCreateColorListWidget_OnPressDisplayButtonEvent) == 0x000010, "Wrong size on AvatarCreateColorListWidget_OnPressDisplayButtonEvent");
static_assert(offsetof(AvatarCreateColorListWidget_OnPressDisplayButtonEvent, Widget) == 0x000000, "Member 'AvatarCreateColorListWidget_OnPressDisplayButtonEvent::Widget' has a wrong offset!");
static_assert(offsetof(AvatarCreateColorListWidget_OnPressDisplayButtonEvent, InputType) == 0x000008, "Member 'AvatarCreateColorListWidget_OnPressDisplayButtonEvent::InputType' has a wrong offset!");

// Function OutGameModule.AvatarCreateColorListWidget.OnPressPaletteButtonEvent
// 0x0010 (0x0010 - 0x0000)
struct AvatarCreateColorListWidget_OnPressPaletteButtonEvent final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AvatarCreateColorListWidget_OnPressPaletteButtonEvent) == 0x000008, "Wrong alignment on AvatarCreateColorListWidget_OnPressPaletteButtonEvent");
static_assert(sizeof(AvatarCreateColorListWidget_OnPressPaletteButtonEvent) == 0x000010, "Wrong size on AvatarCreateColorListWidget_OnPressPaletteButtonEvent");
static_assert(offsetof(AvatarCreateColorListWidget_OnPressPaletteButtonEvent, Widget) == 0x000000, "Member 'AvatarCreateColorListWidget_OnPressPaletteButtonEvent::Widget' has a wrong offset!");
static_assert(offsetof(AvatarCreateColorListWidget_OnPressPaletteButtonEvent, InputType) == 0x000008, "Member 'AvatarCreateColorListWidget_OnPressPaletteButtonEvent::InputType' has a wrong offset!");

// Function OutGameModule.PlayMenuHamburgerWidget.GetLargeIconFocusIndex
// 0x0004 (0x0004 - 0x0000)
struct PlayMenuHamburgerWidget_GetLargeIconFocusIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayMenuHamburgerWidget_GetLargeIconFocusIndex) == 0x000004, "Wrong alignment on PlayMenuHamburgerWidget_GetLargeIconFocusIndex");
static_assert(sizeof(PlayMenuHamburgerWidget_GetLargeIconFocusIndex) == 0x000004, "Wrong size on PlayMenuHamburgerWidget_GetLargeIconFocusIndex");
static_assert(offsetof(PlayMenuHamburgerWidget_GetLargeIconFocusIndex, ReturnValue) == 0x000000, "Member 'PlayMenuHamburgerWidget_GetLargeIconFocusIndex::ReturnValue' has a wrong offset!");

// Function OutGameModule.PlayMenuHamburgerWidget.NonOnlineMatchingStartBattle
// 0x0010 (0x0010 - 0x0000)
struct PlayMenuHamburgerWidget_NonOnlineMatchingStartBattle final
{
public:
	class FString                                 StageName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayMenuHamburgerWidget_NonOnlineMatchingStartBattle) == 0x000008, "Wrong alignment on PlayMenuHamburgerWidget_NonOnlineMatchingStartBattle");
static_assert(sizeof(PlayMenuHamburgerWidget_NonOnlineMatchingStartBattle) == 0x000010, "Wrong size on PlayMenuHamburgerWidget_NonOnlineMatchingStartBattle");
static_assert(offsetof(PlayMenuHamburgerWidget_NonOnlineMatchingStartBattle, StageName) == 0x000000, "Member 'PlayMenuHamburgerWidget_NonOnlineMatchingStartBattle::StageName' has a wrong offset!");

// Function OutGameModule.PlayMenuHamburgerWidget.OnButtonSelectEvent
