#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIFramework

#include "Basic.hpp"

#include "UIFramework_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UIFramework.WidgetBase.BP_NativePlayAll
// 0x0014 (0x0014 - 0x0000)
struct WidgetBase_BP_NativePlayAll final
{
public:
	class FName                                   AnimationName;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LoopCount;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsReverse;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WidgetBase_BP_NativePlayAll) == 0x000004, "Wrong alignment on WidgetBase_BP_NativePlayAll");
static_assert(sizeof(WidgetBase_BP_NativePlayAll) == 0x000014, "Wrong size on WidgetBase_BP_NativePlayAll");
static_assert(offsetof(WidgetBase_BP_NativePlayAll, AnimationName) == 0x000000, "Member 'WidgetBase_BP_NativePlayAll::AnimationName' has a wrong offset!");
static_assert(offsetof(WidgetBase_BP_NativePlayAll, LoopCount) == 0x000008, "Member 'WidgetBase_BP_NativePlayAll::LoopCount' has a wrong offset!");
static_assert(offsetof(WidgetBase_BP_NativePlayAll, StartTime) == 0x00000C, "Member 'WidgetBase_BP_NativePlayAll::StartTime' has a wrong offset!");
static_assert(offsetof(WidgetBase_BP_NativePlayAll, IsReverse) == 0x000010, "Member 'WidgetBase_BP_NativePlayAll::IsReverse' has a wrong offset!");

// Function UIFramework.WidgetBase.BP_PlayAll
// 0x0018 (0x0018 - 0x0000)
struct WidgetBase_BP_PlayAll final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LoopCount;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsReverse;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WidgetBase_BP_PlayAll) == 0x000008, "Wrong alignment on WidgetBase_BP_PlayAll");
static_assert(sizeof(WidgetBase_BP_PlayAll) == 0x000018, "Wrong size on WidgetBase_BP_PlayAll");
static_assert(offsetof(WidgetBase_BP_PlayAll, Animation) == 0x000000, "Member 'WidgetBase_BP_PlayAll::Animation' has a wrong offset!");
static_assert(offsetof(WidgetBase_BP_PlayAll, LoopCount) == 0x000008, "Member 'WidgetBase_BP_PlayAll::LoopCount' has a wrong offset!");
static_assert(offsetof(WidgetBase_BP_PlayAll, StartTime) == 0x00000C, "Member 'WidgetBase_BP_PlayAll::StartTime' has a wrong offset!");
static_assert(offsetof(WidgetBase_BP_PlayAll, IsReverse) == 0x000010, "Member 'WidgetBase_BP_PlayAll::IsReverse' has a wrong offset!");

// Function UIFramework.WidgetBase.CopyWidgetAnimations
// 0x0010 (0x0010 - 0x0000)
struct WidgetBase_CopyWidgetAnimations final
{
public:
	class UWidgetBase*                            base;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllChildren;                                      // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverride;                                         // 0x0009(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WidgetBase_CopyWidgetAnimations) == 0x000008, "Wrong alignment on WidgetBase_CopyWidgetAnimations");
static_assert(sizeof(WidgetBase_CopyWidgetAnimations) == 0x000010, "Wrong size on WidgetBase_CopyWidgetAnimations");
static_assert(offsetof(WidgetBase_CopyWidgetAnimations, base) == 0x000000, "Member 'WidgetBase_CopyWidgetAnimations::base' has a wrong offset!");
static_assert(offsetof(WidgetBase_CopyWidgetAnimations, bAllChildren) == 0x000008, "Member 'WidgetBase_CopyWidgetAnimations::bAllChildren' has a wrong offset!");
static_assert(offsetof(WidgetBase_CopyWidgetAnimations, bOverride) == 0x000009, "Member 'WidgetBase_CopyWidgetAnimations::bOverride' has a wrong offset!");

// Function UIFramework.WidgetBase.DelayInitializePriorityInput
// 0x0004 (0x0004 - 0x0000)
struct WidgetBase_DelayInitializePriorityInput final
{
public:
	int32                                         NewZOrder;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WidgetBase_DelayInitializePriorityInput) == 0x000004, "Wrong alignment on WidgetBase_DelayInitializePriorityInput");
static_assert(sizeof(WidgetBase_DelayInitializePriorityInput) == 0x000004, "Wrong size on WidgetBase_DelayInitializePriorityInput");
static_assert(offsetof(WidgetBase_DelayInitializePriorityInput, NewZOrder) == 0x000000, "Member 'WidgetBase_DelayInitializePriorityInput::NewZOrder' has a wrong offset!");

// Function UIFramework.WidgetBase.GetOwningLevelName
// 0x0008 (0x0008 - 0x0000)
struct WidgetBase_GetOwningLevelName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WidgetBase_GetOwningLevelName) == 0x000004, "Wrong alignment on WidgetBase_GetOwningLevelName");
static_assert(sizeof(WidgetBase_GetOwningLevelName) == 0x000008, "Wrong size on WidgetBase_GetOwningLevelName");
static_assert(offsetof(WidgetBase_GetOwningLevelName, ReturnValue) == 0x000000, "Member 'WidgetBase_GetOwningLevelName::ReturnValue' has a wrong offset!");

// Function UIFramework.WidgetBase.InitWidgetAnimations
// 0x0001 (0x0001 - 0x0000)
struct WidgetBase_InitWidgetAnimations final
{
public:
	bool                                          bAllChildren;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WidgetBase_InitWidgetAnimations) == 0x000001, "Wrong alignment on WidgetBase_InitWidgetAnimations");
static_assert(sizeof(WidgetBase_InitWidgetAnimations) == 0x000001, "Wrong size on WidgetBase_InitWidgetAnimations");
static_assert(offsetof(WidgetBase_InitWidgetAnimations, bAllChildren) == 0x000000, "Member 'WidgetBase_InitWidgetAnimations::bAllChildren' has a wrong offset!");

// Function UIFramework.WidgetBase.ReplaceWidgetAnimation
// 0x0018 (0x0018 - 0x0000)
struct WidgetBase_ReplaceWidgetAnimation final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetAnimation*                       WidgetAnimation;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllChildren;                                      // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WidgetBase_ReplaceWidgetAnimation) == 0x000008, "Wrong alignment on WidgetBase_ReplaceWidgetAnimation");
static_assert(sizeof(WidgetBase_ReplaceWidgetAnimation) == 0x000018, "Wrong size on WidgetBase_ReplaceWidgetAnimation");
static_assert(offsetof(WidgetBase_ReplaceWidgetAnimation, Name_0) == 0x000000, "Member 'WidgetBase_ReplaceWidgetAnimation::Name_0' has a wrong offset!");
static_assert(offsetof(WidgetBase_ReplaceWidgetAnimation, WidgetAnimation) == 0x000008, "Member 'WidgetBase_ReplaceWidgetAnimation::WidgetAnimation' has a wrong offset!");
static_assert(offsetof(WidgetBase_ReplaceWidgetAnimation, bAllChildren) == 0x000010, "Member 'WidgetBase_ReplaceWidgetAnimation::bAllChildren' has a wrong offset!");

// Function UIFramework.WidgetBase.ReplaceWidgetAnimations
// 0x0058 (0x0058 - 0x0000)
struct WidgetBase_ReplaceWidgetAnimations final
{
public:
	TMap<class FName, class UWidgetAnimation*>    WidgetAnimations;                                  // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bAllChildren;                                      // 0x0050(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WidgetBase_ReplaceWidgetAnimations) == 0x000008, "Wrong alignment on WidgetBase_ReplaceWidgetAnimations");
static_assert(sizeof(WidgetBase_ReplaceWidgetAnimations) == 0x000058, "Wrong size on WidgetBase_ReplaceWidgetAnimations");
static_assert(offsetof(WidgetBase_ReplaceWidgetAnimations, WidgetAnimations) == 0x000000, "Member 'WidgetBase_ReplaceWidgetAnimations::WidgetAnimations' has a wrong offset!");
static_assert(offsetof(WidgetBase_ReplaceWidgetAnimations, bAllChildren) == 0x000050, "Member 'WidgetBase_ReplaceWidgetAnimations::bAllChildren' has a wrong offset!");

// Function UIFramework.WidgetBase.SendToBP_WidgetBaseDesignatedEvent
// 0x0001 (0x0001 - 0x0000)
struct WidgetBase_SendToBP_WidgetBaseDesignatedEvent final
{
public:
	EWidgetBaseEventChannel                       InChannel;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WidgetBase_SendToBP_WidgetBaseDesignatedEvent) == 0x000001, "Wrong alignment on WidgetBase_SendToBP_WidgetBaseDesignatedEvent");
static_assert(sizeof(WidgetBase_SendToBP_WidgetBaseDesignatedEvent) == 0x000001, "Wrong size on WidgetBase_SendToBP_WidgetBaseDesignatedEvent");
static_assert(offsetof(WidgetBase_SendToBP_WidgetBaseDesignatedEvent, InChannel) == 0x000000, "Member 'WidgetBase_SendToBP_WidgetBaseDesignatedEvent::InChannel' has a wrong offset!");

// Function UIFramework.WidgetBase.SetCanTick
// 0x0001 (0x0001 - 0x0000)
struct WidgetBase_SetCanTick final
{
public:
	bool                                          bCanTick;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WidgetBase_SetCanTick) == 0x000001, "Wrong alignment on WidgetBase_SetCanTick");
static_assert(sizeof(WidgetBase_SetCanTick) == 0x000001, "Wrong size on WidgetBase_SetCanTick");
static_assert(offsetof(WidgetBase_SetCanTick, bCanTick) == 0x000000, "Member 'WidgetBase_SetCanTick::bCanTick' has a wrong offset!");

// Function UIFramework.WidgetBase.StopWidgetAnimation
// 0x000C (0x000C - 0x0000)
struct WidgetBase_StopWidgetAnimation final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllChildren;                                      // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WidgetBase_StopWidgetAnimation) == 0x000004, "Wrong alignment on WidgetBase_StopWidgetAnimation");
static_assert(sizeof(WidgetBase_StopWidgetAnimation) == 0x00000C, "Wrong size on WidgetBase_StopWidgetAnimation");
static_assert(offsetof(WidgetBase_StopWidgetAnimation, Name_0) == 0x000000, "Member 'WidgetBase_StopWidgetAnimation::Name_0' has a wrong offset!");
static_assert(offsetof(WidgetBase_StopWidgetAnimation, bAllChildren) == 0x000008, "Member 'WidgetBase_StopWidgetAnimation::bAllChildren' has a wrong offset!");

// Function UIFramework.WidgetBase.StopWidgetAnimations
// 0x0018 (0x0018 - 0x0000)
struct WidgetBase_StopWidgetAnimations final
{
public:
	TArray<class FName>                           Names;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bAllChildren;                                      // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WidgetBase_StopWidgetAnimations) == 0x000008, "Wrong alignment on WidgetBase_StopWidgetAnimations");
static_assert(sizeof(WidgetBase_StopWidgetAnimations) == 0x000018, "Wrong size on WidgetBase_StopWidgetAnimations");
static_assert(offsetof(WidgetBase_StopWidgetAnimations, Names) == 0x000000, "Member 'WidgetBase_StopWidgetAnimations::Names' has a wrong offset!");
static_assert(offsetof(WidgetBase_StopWidgetAnimations, bAllChildren) == 0x000010, "Member 'WidgetBase_StopWidgetAnimations::bAllChildren' has a wrong offset!");

// Function UIFramework.WidgetBase.StopWidgetAnimationsAll
// 0x0001 (0x0001 - 0x0000)
struct WidgetBase_StopWidgetAnimationsAll final
{
public:
	bool                                          bAllChildren;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WidgetBase_StopWidgetAnimationsAll) == 0x000001, "Wrong alignment on WidgetBase_StopWidgetAnimationsAll");
static_assert(sizeof(WidgetBase_StopWidgetAnimationsAll) == 0x000001, "Wrong size on WidgetBase_StopWidgetAnimationsAll");
static_assert(offsetof(WidgetBase_StopWidgetAnimationsAll, bAllChildren) == 0x000000, "Member 'WidgetBase_StopWidgetAnimationsAll::bAllChildren' has a wrong offset!");

// Function UIFramework.WidgetBase.GetChildWidgets
// 0x0010 (0x0010 - 0x0000)
struct WidgetBase_GetChildWidgets final
{
public:
	TArray<class UWidgetBase*>                    ReturnValue;                                       // 0x0000(0x0010)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(WidgetBase_GetChildWidgets) == 0x000008, "Wrong alignment on WidgetBase_GetChildWidgets");
static_assert(sizeof(WidgetBase_GetChildWidgets) == 0x000010, "Wrong size on WidgetBase_GetChildWidgets");
static_assert(offsetof(WidgetBase_GetChildWidgets, ReturnValue) == 0x000000, "Member 'WidgetBase_GetChildWidgets::ReturnValue' has a wrong offset!");

// Function UIFramework.CustomListView.AddScrollOffset
// 0x0004 (0x0004 - 0x0000)
struct CustomListView_AddScrollOffset final
{
public:
	float                                         AddScrollOffset_0;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomListView_AddScrollOffset) == 0x000004, "Wrong alignment on CustomListView_AddScrollOffset");
static_assert(sizeof(CustomListView_AddScrollOffset) == 0x000004, "Wrong size on CustomListView_AddScrollOffset");
static_assert(offsetof(CustomListView_AddScrollOffset, AddScrollOffset_0) == 0x000000, "Member 'CustomListView_AddScrollOffset::AddScrollOffset_0' has a wrong offset!");

// Function UIFramework.CustomListView.AddScrollOffsetByAnalogStick
// 0x0050 (0x0050 - 0x0000)
struct CustomListView_AddScrollOffsetByAnalogStick final
{
public:
	struct FAnalogInputEvent                      InAnalogEvent;                                     // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ScrollSpeed;                                       // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultSpeedRate;                                  // 0x0044(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSpeedRate;                                      // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AddSpeedRate;                                      // 0x004C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomListView_AddScrollOffsetByAnalogStick) == 0x000008, "Wrong alignment on CustomListView_AddScrollOffsetByAnalogStick");
static_assert(sizeof(CustomListView_AddScrollOffsetByAnalogStick) == 0x000050, "Wrong size on CustomListView_AddScrollOffsetByAnalogStick");
static_assert(offsetof(CustomListView_AddScrollOffsetByAnalogStick, InAnalogEvent) == 0x000000, "Member 'CustomListView_AddScrollOffsetByAnalogStick::InAnalogEvent' has a wrong offset!");
static_assert(offsetof(CustomListView_AddScrollOffsetByAnalogStick, ScrollSpeed) == 0x000040, "Member 'CustomListView_AddScrollOffsetByAnalogStick::ScrollSpeed' has a wrong offset!");
static_assert(offsetof(CustomListView_AddScrollOffsetByAnalogStick, DefaultSpeedRate) == 0x000044, "Member 'CustomListView_AddScrollOffsetByAnalogStick::DefaultSpeedRate' has a wrong offset!");
static_assert(offsetof(CustomListView_AddScrollOffsetByAnalogStick, MaxSpeedRate) == 0x000048, "Member 'CustomListView_AddScrollOffsetByAnalogStick::MaxSpeedRate' has a wrong offset!");
static_assert(offsetof(CustomListView_AddScrollOffsetByAnalogStick, AddSpeedRate) == 0x00004C, "Member 'CustomListView_AddScrollOffsetByAnalogStick::AddSpeedRate' has a wrong offset!");

// Function UIFramework.WidgetWindowFrame.OnButtonAddedToFocusEvent
// 0x0010 (0x0010 - 0x0000)
struct WidgetWindowFrame_OnButtonAddedToFocusEvent final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WidgetWindowFrame_OnButtonAddedToFocusEvent) == 0x000008, "Wrong alignment on WidgetWindowFrame_OnButtonAddedToFocusEvent");
static_assert(sizeof(WidgetWindowFrame_OnButtonAddedToFocusEvent) == 0x000010, "Wrong size on WidgetWindowFrame_OnButtonAddedToFocusEvent");
static_assert(offsetof(WidgetWindowFrame_OnButtonAddedToFocusEvent, Widget) == 0x000000, "Member 'WidgetWindowFrame_OnButtonAddedToFocusEvent::Widget' has a wrong offset!");
static_assert(offsetof(WidgetWindowFrame_OnButtonAddedToFocusEvent, InputType) == 0x000008, "Member 'WidgetWindowFrame_OnButtonAddedToFocusEvent::InputType' has a wrong offset!");

// Function UIFramework.WidgetWindowFrame.OnButtonDecideEvent
// 0x0010 (0x0010 - 0x0000)
struct WidgetWindowFrame_OnButtonDecideEvent final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WidgetWindowFrame_OnButtonDecideEvent) == 0x000008, "Wrong alignment on WidgetWindowFrame_OnButtonDecideEvent");
static_assert(sizeof(WidgetWindowFrame_OnButtonDecideEvent) == 0x000010, "Wrong size on WidgetWindowFrame_OnButtonDecideEvent");
static_assert(offsetof(WidgetWindowFrame_OnButtonDecideEvent, Widget) == 0x000000, "Member 'WidgetWindowFrame_OnButtonDecideEvent::Widget' has a wrong offset!");
static_assert(offsetof(WidgetWindowFrame_OnButtonDecideEvent, InputType) == 0x000008, "Member 'WidgetWindowFrame_OnButtonDecideEvent::InputType' has a wrong offset!");

// Function UIFramework.WidgetWindowFrame.OnButtonOnLongDecideEvent
// 0x0010 (0x0010 - 0x0000)
struct WidgetWindowFrame_OnButtonOnLongDecideEvent final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WidgetWindowFrame_OnButtonOnLongDecideEvent) == 0x000008, "Wrong alignment on WidgetWindowFrame_OnButtonOnLongDecideEvent");
static_assert(sizeof(WidgetWindowFrame_OnButtonOnLongDecideEvent) == 0x000010, "Wrong size on WidgetWindowFrame_OnButtonOnLongDecideEvent");
static_assert(offsetof(WidgetWindowFrame_OnButtonOnLongDecideEvent, Widget) == 0x000000, "Member 'WidgetWindowFrame_OnButtonOnLongDecideEvent::Widget' has a wrong offset!");
static_assert(offsetof(WidgetWindowFrame_OnButtonOnLongDecideEvent, InputType) == 0x000008, "Member 'WidgetWindowFrame_OnButtonOnLongDecideEvent::InputType' has a wrong offset!");

// Function UIFramework.WidgetWindowFrame.OnButtonPressEvent
// 0x0010 (0x0010 - 0x0000)
struct WidgetWindowFrame_OnButtonPressEvent final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WidgetWindowFrame_OnButtonPressEvent) == 0x000008, "Wrong alignment on WidgetWindowFrame_OnButtonPressEvent");
static_assert(sizeof(WidgetWindowFrame_OnButtonPressEvent) == 0x000010, "Wrong size on WidgetWindowFrame_OnButtonPressEvent");
static_assert(offsetof(WidgetWindowFrame_OnButtonPressEvent, Widget) == 0x000000, "Member 'WidgetWindowFrame_OnButtonPressEvent::Widget' has a wrong offset!");
static_assert(offsetof(WidgetWindowFrame_OnButtonPressEvent, InputType) == 0x000008, "Member 'WidgetWindowFrame_OnButtonPressEvent::InputType' has a wrong offset!");

// Function UIFramework.WidgetWindowFrame.OnButtonRemovedFromFocusEvent
// 0x0010 (0x0010 - 0x0000)
struct WidgetWindowFrame_OnButtonRemovedFromFocusEvent final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WidgetWindowFrame_OnButtonRemovedFromFocusEvent) == 0x000008, "Wrong alignment on WidgetWindowFrame_OnButtonRemovedFromFocusEvent");
static_assert(sizeof(WidgetWindowFrame_OnButtonRemovedFromFocusEvent) == 0x000010, "Wrong size on WidgetWindowFrame_OnButtonRemovedFromFocusEvent");
static_assert(offsetof(WidgetWindowFrame_OnButtonRemovedFromFocusEvent, Widget) == 0x000000, "Member 'WidgetWindowFrame_OnButtonRemovedFromFocusEvent::Widget' has a wrong offset!");
static_assert(offsetof(WidgetWindowFrame_OnButtonRemovedFromFocusEvent, InputType) == 0x000008, "Member 'WidgetWindowFrame_OnButtonRemovedFromFocusEvent::InputType' has a wrong offset!");

// Function UIFramework.WidgetWindowFrame.ReplaceBase1Slot
// 0x0008 (0x0008 - 0x0000)
struct WidgetWindowFrame_ReplaceBase1Slot final
{
public:
	class UNamedSlot*                             Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WidgetWindowFrame_ReplaceBase1Slot) == 0x000008, "Wrong alignment on WidgetWindowFrame_ReplaceBase1Slot");
static_assert(sizeof(WidgetWindowFrame_ReplaceBase1Slot) == 0x000008, "Wrong size on WidgetWindowFrame_ReplaceBase1Slot");
static_assert(offsetof(WidgetWindowFrame_ReplaceBase1Slot, Source) == 0x000000, "Member 'WidgetWindowFrame_ReplaceBase1Slot::Source' has a wrong offset!");

// Function UIFramework.WidgetWindowFrame.ReplaceBase2Slot
// 0x0008 (0x0008 - 0x0000)
struct WidgetWindowFrame_ReplaceBase2Slot final
{
public:
	class UNamedSlot*                             Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WidgetWindowFrame_ReplaceBase2Slot) == 0x000008, "Wrong alignment on WidgetWindowFrame_ReplaceBase2Slot");
static_assert(sizeof(WidgetWindowFrame_ReplaceBase2Slot) == 0x000008, "Wrong size on WidgetWindowFrame_ReplaceBase2Slot");
static_assert(offsetof(WidgetWindowFrame_ReplaceBase2Slot, Source) == 0x000000, "Member 'WidgetWindowFrame_ReplaceBase2Slot::Source' has a wrong offset!");

// Function UIFramework.WidgetWindowFrame.ReplaceContentsSlot
// 0x0008 (0x0008 - 0x0000)
struct WidgetWindowFrame_ReplaceContentsSlot final
{
public:
	class UNamedSlot*                             Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WidgetWindowFrame_ReplaceContentsSlot) == 0x000008, "Wrong alignment on WidgetWindowFrame_ReplaceContentsSlot");
static_assert(sizeof(WidgetWindowFrame_ReplaceContentsSlot) == 0x000008, "Wrong size on WidgetWindowFrame_ReplaceContentsSlot");
static_assert(offsetof(WidgetWindowFrame_ReplaceContentsSlot, Source) == 0x000000, "Member 'WidgetWindowFrame_ReplaceContentsSlot::Source' has a wrong offset!");

// Function UIFramework.WidgetWindowFrame.GetButtonCount
// 0x0001 (0x0001 - 0x0000)
struct WidgetWindowFrame_GetButtonCount final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WidgetWindowFrame_GetButtonCount) == 0x000001, "Wrong alignment on WidgetWindowFrame_GetButtonCount");
static_assert(sizeof(WidgetWindowFrame_GetButtonCount) == 0x000001, "Wrong size on WidgetWindowFrame_GetButtonCount");
static_assert(offsetof(WidgetWindowFrame_GetButtonCount, ReturnValue) == 0x000000, "Member 'WidgetWindowFrame_GetButtonCount::ReturnValue' has a wrong offset!");

// Function UIFramework.WidgetWindowFrame.GetWindowSize
// 0x0004 (0x0004 - 0x0000)
struct WidgetWindowFrame_GetWindowSize final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WidgetWindowFrame_GetWindowSize) == 0x000004, "Wrong alignment on WidgetWindowFrame_GetWindowSize");
static_assert(sizeof(WidgetWindowFrame_GetWindowSize) == 0x000004, "Wrong size on WidgetWindowFrame_GetWindowSize");
static_assert(offsetof(WidgetWindowFrame_GetWindowSize, ReturnValue) == 0x000000, "Member 'WidgetWindowFrame_GetWindowSize::ReturnValue' has a wrong offset!");

// Function UIFramework.AppWidgetWork.BP_CreateWidget
// 0x0020 (0x0020 - 0x0000)
struct AppWidgetWork_BP_CreateWidget final
{
public:
	TSubclassOf<class UUserWidget>                WidgetClass;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAppWidgetPriority                            Priority;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubPriority;                                       // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAddToScreen;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppWidgetWork_BP_CreateWidget) == 0x000008, "Wrong alignment on AppWidgetWork_BP_CreateWidget");
static_assert(sizeof(AppWidgetWork_BP_CreateWidget) == 0x000020, "Wrong size on AppWidgetWork_BP_CreateWidget");
static_assert(offsetof(AppWidgetWork_BP_CreateWidget, WidgetClass) == 0x000000, "Member 'AppWidgetWork_BP_CreateWidget::WidgetClass' has a wrong offset!");
static_assert(offsetof(AppWidgetWork_BP_CreateWidget, Priority) == 0x000008, "Member 'AppWidgetWork_BP_CreateWidget::Priority' has a wrong offset!");
static_assert(offsetof(AppWidgetWork_BP_CreateWidget, SubPriority) == 0x00000C, "Member 'AppWidgetWork_BP_CreateWidget::SubPriority' has a wrong offset!");
static_assert(offsetof(AppWidgetWork_BP_CreateWidget, bAddToScreen) == 0x000010, "Member 'AppWidgetWork_BP_CreateWidget::bAddToScreen' has a wrong offset!");
static_assert(offsetof(AppWidgetWork_BP_CreateWidget, ReturnValue) == 0x000018, "Member 'AppWidgetWork_BP_CreateWidget::ReturnValue' has a wrong offset!");

// Function UIFramework.AppWidgetWork.DisableInputForFocusedWidget
// 0x0008 (0x0008 - 0x0000)
struct AppWidgetWork_DisableInputForFocusedWidget final
{
public:
	class UWidgetBase*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppWidgetWork_DisableInputForFocusedWidget) == 0x000008, "Wrong alignment on AppWidgetWork_DisableInputForFocusedWidget");
static_assert(sizeof(AppWidgetWork_DisableInputForFocusedWidget) == 0x000008, "Wrong size on AppWidgetWork_DisableInputForFocusedWidget");
static_assert(offsetof(AppWidgetWork_DisableInputForFocusedWidget, Widget) == 0x000000, "Member 'AppWidgetWork_DisableInputForFocusedWidget::Widget' has a wrong offset!");

// Function UIFramework.AppWidgetWork.EnableInputForFocusedWidget
// 0x0008 (0x0008 - 0x0000)
struct AppWidgetWork_EnableInputForFocusedWidget final
{
public:
	class UWidgetBase*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppWidgetWork_EnableInputForFocusedWidget) == 0x000008, "Wrong alignment on AppWidgetWork_EnableInputForFocusedWidget");
static_assert(sizeof(AppWidgetWork_EnableInputForFocusedWidget) == 0x000008, "Wrong size on AppWidgetWork_EnableInputForFocusedWidget");
static_assert(offsetof(AppWidgetWork_EnableInputForFocusedWidget, Widget) == 0x000000, "Member 'AppWidgetWork_EnableInputForFocusedWidget::Widget' has a wrong offset!");

// Function UIFramework.AppWidgetWork.FadeIn
// 0x0028 (0x0028 - 0x0000)
struct AppWidgetWork_FadeIn final
{
public:
	struct FOnFadeFinished                        OnFinishedEvent;                                   // 0x0000(0x0010)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	EWidgetTransitionFadeType                     Type;                                              // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConditional;                                      // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x0014(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableWorldRendering;                             // 0x0024(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AppWidgetWork_FadeIn) == 0x000004, "Wrong alignment on AppWidgetWork_FadeIn");
static_assert(sizeof(AppWidgetWork_FadeIn) == 0x000028, "Wrong size on AppWidgetWork_FadeIn");
static_assert(offsetof(AppWidgetWork_FadeIn, OnFinishedEvent) == 0x000000, "Member 'AppWidgetWork_FadeIn::OnFinishedEvent' has a wrong offset!");
static_assert(offsetof(AppWidgetWork_FadeIn, Type) == 0x000010, "Member 'AppWidgetWork_FadeIn::Type' has a wrong offset!");
static_assert(offsetof(AppWidgetWork_FadeIn, bConditional) == 0x000011, "Member 'AppWidgetWork_FadeIn::bConditional' has a wrong offset!");
static_assert(offsetof(AppWidgetWork_FadeIn, Color) == 0x000014, "Member 'AppWidgetWork_FadeIn::Color' has a wrong offset!");
static_assert(offsetof(AppWidgetWork_FadeIn, bEnableWorldRendering) == 0x000024, "Member 'AppWidgetWork_FadeIn::bEnableWorldRendering' has a wrong offset!");

// Function UIFramework.AppWidgetWork.FadeOut
// 0x0028 (0x0028 - 0x0000)
struct AppWidgetWork_FadeOut final
{
public:
	struct FOnFadeFinished                        OnFinishedEvent;                                   // 0x0000(0x0010)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	EWidgetTransitionFadeType                     Type;                                              // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x0014(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowNowLoading;                                   // 0x0024(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AppWidgetWork_FadeOut) == 0x000004, "Wrong alignment on AppWidgetWork_FadeOut");
static_assert(sizeof(AppWidgetWork_FadeOut) == 0x000028, "Wrong size on AppWidgetWork_FadeOut");
static_assert(offsetof(AppWidgetWork_FadeOut, OnFinishedEvent) == 0x000000, "Member 'AppWidgetWork_FadeOut::OnFinishedEvent' has a wrong offset!");
static_assert(offsetof(AppWidgetWork_FadeOut, Type) == 0x000010, "Member 'AppWidgetWork_FadeOut::Type' has a wrong offset!");
static_assert(offsetof(AppWidgetWork_FadeOut, Color) == 0x000014, "Member 'AppWidgetWork_FadeOut::Color' has a wrong offset!");
static_assert(offsetof(AppWidgetWork_FadeOut, bShowNowLoading) == 0x000024, "Member 'AppWidgetWork_FadeOut::bShowNowLoading' has a wrong offset!");

// Function UIFramework.AppWidgetWork.GetCurrentFocusWidget
// 0x0008 (0x0008 - 0x0000)
struct AppWidgetWork_GetCurrentFocusWidget final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppWidgetWork_GetCurrentFocusWidget) == 0x000008, "Wrong alignment on AppWidgetWork_GetCurrentFocusWidget");
static_assert(sizeof(AppWidgetWork_GetCurrentFocusWidget) == 0x000008, "Wrong size on AppWidgetWork_GetCurrentFocusWidget");
static_assert(offsetof(AppWidgetWork_GetCurrentFocusWidget, ReturnValue) == 0x000000, "Member 'AppWidgetWork_GetCurrentFocusWidget::ReturnValue' has a wrong offset!");

// Function UIFramework.AppWidgetWork.GetPreFocusWidget
// 0x0008 (0x0008 - 0x0000)
struct AppWidgetWork_GetPreFocusWidget final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppWidgetWork_GetPreFocusWidget) == 0x000008, "Wrong alignment on AppWidgetWork_GetPreFocusWidget");
static_assert(sizeof(AppWidgetWork_GetPreFocusWidget) == 0x000008, "Wrong size on AppWidgetWork_GetPreFocusWidget");
static_assert(offsetof(AppWidgetWork_GetPreFocusWidget, ReturnValue) == 0x000000, "Member 'AppWidgetWork_GetPreFocusWidget::ReturnValue' has a wrong offset!");

// Function UIFramework.AppWidgetWork.IsGamePadControlVirtualCursor
// 0x0001 (0x0001 - 0x0000)
struct AppWidgetWork_IsGamePadControlVirtualCursor final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppWidgetWork_IsGamePadControlVirtualCursor) == 0x000001, "Wrong alignment on AppWidgetWork_IsGamePadControlVirtualCursor");
static_assert(sizeof(AppWidgetWork_IsGamePadControlVirtualCursor) == 0x000001, "Wrong size on AppWidgetWork_IsGamePadControlVirtualCursor");
static_assert(offsetof(AppWidgetWork_IsGamePadControlVirtualCursor, ReturnValue) == 0x000000, "Member 'AppWidgetWork_IsGamePadControlVirtualCursor::ReturnValue' has a wrong offset!");

// Function UIFramework.AppWidgetWork.IsMouseControlVirtualCursor
// 0x0001 (0x0001 - 0x0000)
struct AppWidgetWork_IsMouseControlVirtualCursor final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppWidgetWork_IsMouseControlVirtualCursor) == 0x000001, "Wrong alignment on AppWidgetWork_IsMouseControlVirtualCursor");
static_assert(sizeof(AppWidgetWork_IsMouseControlVirtualCursor) == 0x000001, "Wrong size on AppWidgetWork_IsMouseControlVirtualCursor");
static_assert(offsetof(AppWidgetWork_IsMouseControlVirtualCursor, ReturnValue) == 0x000000, "Member 'AppWidgetWork_IsMouseControlVirtualCursor::ReturnValue' has a wrong offset!");

// DelegateFunction UIFramework.AppWidgetWork.OperationChangeDelegate__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct AppWidgetWork_OperationChangeDelegate__DelegateSignature final
{
public:
	bool                                          bChange;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppWidgetWork_OperationChangeDelegate__DelegateSignature) == 0x000001, "Wrong alignment on AppWidgetWork_OperationChangeDelegate__DelegateSignature");
static_assert(sizeof(AppWidgetWork_OperationChangeDelegate__DelegateSignature) == 0x000001, "Wrong size on AppWidgetWork_OperationChangeDelegate__DelegateSignature");
static_assert(offsetof(AppWidgetWork_OperationChangeDelegate__DelegateSignature, bChange) == 0x000000, "Member 'AppWidgetWork_OperationChangeDelegate__DelegateSignature::bChange' has a wrong offset!");

// Function UIFramework.AppWidgetWork.SetDefaultMap
// 0x0028 (0x0028 - 0x0000)
struct AppWidgetWork_SetDefaultMap final
{
public:
	TSoftObjectPtr<class UWorld>                  Level;                                             // 0x0000(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppWidgetWork_SetDefaultMap) == 0x000008, "Wrong alignment on AppWidgetWork_SetDefaultMap");
static_assert(sizeof(AppWidgetWork_SetDefaultMap) == 0x000028, "Wrong size on AppWidgetWork_SetDefaultMap");
static_assert(offsetof(AppWidgetWork_SetDefaultMap, Level) == 0x000000, "Member 'AppWidgetWork_SetDefaultMap::Level' has a wrong offset!");

// Function UIFramework.AppWidgetWork.SetHistoryFocusedWidget
// 0x0008 (0x0008 - 0x0000)
struct AppWidgetWork_SetHistoryFocusedWidget final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppWidgetWork_SetHistoryFocusedWidget) == 0x000008, "Wrong alignment on AppWidgetWork_SetHistoryFocusedWidget");
static_assert(sizeof(AppWidgetWork_SetHistoryFocusedWidget) == 0x000008, "Wrong size on AppWidgetWork_SetHistoryFocusedWidget");
static_assert(offsetof(AppWidgetWork_SetHistoryFocusedWidget, Widget) == 0x000000, "Member 'AppWidgetWork_SetHistoryFocusedWidget::Widget' has a wrong offset!");

// Function UIFramework.AppWidgetWork.SetKeyboardFocusUnBlocked
// 0x0008 (0x0008 - 0x0000)
struct AppWidgetWork_SetKeyboardFocusUnBlocked final
{
public:
	class UWidgetBase*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppWidgetWork_SetKeyboardFocusUnBlocked) == 0x000008, "Wrong alignment on AppWidgetWork_SetKeyboardFocusUnBlocked");
static_assert(sizeof(AppWidgetWork_SetKeyboardFocusUnBlocked) == 0x000008, "Wrong size on AppWidgetWork_SetKeyboardFocusUnBlocked");
static_assert(offsetof(AppWidgetWork_SetKeyboardFocusUnBlocked, Widget) == 0x000000, "Member 'AppWidgetWork_SetKeyboardFocusUnBlocked::Widget' has a wrong offset!");

// Function UIFramework.AppWidgetWork.SetKeyNavigation
// 0x0001 (0x0001 - 0x0000)
struct AppWidgetWork_SetKeyNavigation final
{
public:
	bool                                          Keynavigation;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppWidgetWork_SetKeyNavigation) == 0x000001, "Wrong alignment on AppWidgetWork_SetKeyNavigation");
static_assert(sizeof(AppWidgetWork_SetKeyNavigation) == 0x000001, "Wrong size on AppWidgetWork_SetKeyNavigation");
static_assert(offsetof(AppWidgetWork_SetKeyNavigation, Keynavigation) == 0x000000, "Member 'AppWidgetWork_SetKeyNavigation::Keynavigation' has a wrong offset!");

// Function UIFramework.AppWidgetWork.SetLoadingTips
// 0x0010 (0x0010 - 0x0000)
struct AppWidgetWork_SetLoadingTips final
{
public:
	TArray<class FText>                           Tips;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppWidgetWork_SetLoadingTips) == 0x000008, "Wrong alignment on AppWidgetWork_SetLoadingTips");
static_assert(sizeof(AppWidgetWork_SetLoadingTips) == 0x000010, "Wrong size on AppWidgetWork_SetLoadingTips");
static_assert(offsetof(AppWidgetWork_SetLoadingTips, Tips) == 0x000000, "Member 'AppWidgetWork_SetLoadingTips::Tips' has a wrong offset!");

// Function UIFramework.AppWidgetWork.SetVirtualCursorPosition
// 0x0008 (0x0008 - 0x0000)
struct AppWidgetWork_SetVirtualCursorPosition final
{
public:
	struct FVector2D                              Position;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppWidgetWork_SetVirtualCursorPosition) == 0x000004, "Wrong alignment on AppWidgetWork_SetVirtualCursorPosition");
static_assert(sizeof(AppWidgetWork_SetVirtualCursorPosition) == 0x000008, "Wrong size on AppWidgetWork_SetVirtualCursorPosition");
static_assert(offsetof(AppWidgetWork_SetVirtualCursorPosition, Position) == 0x000000, "Member 'AppWidgetWork_SetVirtualCursorPosition::Position' has a wrong offset!");

// Function UIFramework.AppWidgetWork.SetVirtualCursorSpeed
// 0x0008 (0x0008 - 0x0000)
struct AppWidgetWork_SetVirtualCursorSpeed final
{
public:
	struct FVector2D                              Speed;                                             // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppWidgetWork_SetVirtualCursorSpeed) == 0x000004, "Wrong alignment on AppWidgetWork_SetVirtualCursorSpeed");
static_assert(sizeof(AppWidgetWork_SetVirtualCursorSpeed) == 0x000008, "Wrong size on AppWidgetWork_SetVirtualCursorSpeed");
static_assert(offsetof(AppWidgetWork_SetVirtualCursorSpeed, Speed) == 0x000000, "Member 'AppWidgetWork_SetVirtualCursorSpeed::Speed' has a wrong offset!");

// Function UIFramework.AppWidgetWork.ShowMouseCursor
// 0x0010 (0x0010 - 0x0000)
struct AppWidgetWork_ShowMouseCursor final
{
public:
	const class UObject*                          Widget;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Flag;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AppWidgetWork_ShowMouseCursor) == 0x000008, "Wrong alignment on AppWidgetWork_ShowMouseCursor");
static_assert(sizeof(AppWidgetWork_ShowMouseCursor) == 0x000010, "Wrong size on AppWidgetWork_ShowMouseCursor");
static_assert(offsetof(AppWidgetWork_ShowMouseCursor, Widget) == 0x000000, "Member 'AppWidgetWork_ShowMouseCursor::Widget' has a wrong offset!");
static_assert(offsetof(AppWidgetWork_ShowMouseCursor, Flag) == 0x000008, "Member 'AppWidgetWork_ShowMouseCursor::Flag' has a wrong offset!");

// Function UIFramework.AppWidgetWork.GetVirtualCursorDelta
// 0x0008 (0x0008 - 0x0000)
struct AppWidgetWork_GetVirtualCursorDelta final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppWidgetWork_GetVirtualCursorDelta) == 0x000004, "Wrong alignment on AppWidgetWork_GetVirtualCursorDelta");
static_assert(sizeof(AppWidgetWork_GetVirtualCursorDelta) == 0x000008, "Wrong size on AppWidgetWork_GetVirtualCursorDelta");
static_assert(offsetof(AppWidgetWork_GetVirtualCursorDelta, ReturnValue) == 0x000000, "Member 'AppWidgetWork_GetVirtualCursorDelta::ReturnValue' has a wrong offset!");

// Function UIFramework.AppWidgetWork.GetVirtualCursorPosition
// 0x0008 (0x0008 - 0x0000)
struct AppWidgetWork_GetVirtualCursorPosition final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppWidgetWork_GetVirtualCursorPosition) == 0x000004, "Wrong alignment on AppWidgetWork_GetVirtualCursorPosition");
static_assert(sizeof(AppWidgetWork_GetVirtualCursorPosition) == 0x000008, "Wrong size on AppWidgetWork_GetVirtualCursorPosition");
static_assert(offsetof(AppWidgetWork_GetVirtualCursorPosition, ReturnValue) == 0x000000, "Member 'AppWidgetWork_GetVirtualCursorPosition::ReturnValue' has a wrong offset!");

// Function UIFramework.AppWidgetWork.IsControlledGamePad
// 0x0001 (0x0001 - 0x0000)
struct AppWidgetWork_IsControlledGamePad final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppWidgetWork_IsControlledGamePad) == 0x000001, "Wrong alignment on AppWidgetWork_IsControlledGamePad");
static_assert(sizeof(AppWidgetWork_IsControlledGamePad) == 0x000001, "Wrong size on AppWidgetWork_IsControlledGamePad");
static_assert(offsetof(AppWidgetWork_IsControlledGamePad, ReturnValue) == 0x000000, "Member 'AppWidgetWork_IsControlledGamePad::ReturnValue' has a wrong offset!");

// Function UIFramework.AppWidgetWork.IsControlledVirtualCursor
// 0x0001 (0x0001 - 0x0000)
struct AppWidgetWork_IsControlledVirtualCursor final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppWidgetWork_IsControlledVirtualCursor) == 0x000001, "Wrong alignment on AppWidgetWork_IsControlledVirtualCursor");
static_assert(sizeof(AppWidgetWork_IsControlledVirtualCursor) == 0x000001, "Wrong size on AppWidgetWork_IsControlledVirtualCursor");
static_assert(offsetof(AppWidgetWork_IsControlledVirtualCursor, ReturnValue) == 0x000000, "Member 'AppWidgetWork_IsControlledVirtualCursor::ReturnValue' has a wrong offset!");

// Function UIFramework.AppWidgetWork.IsFading
// 0x0001 (0x0001 - 0x0000)
struct AppWidgetWork_IsFading final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppWidgetWork_IsFading) == 0x000001, "Wrong alignment on AppWidgetWork_IsFading");
static_assert(sizeof(AppWidgetWork_IsFading) == 0x000001, "Wrong size on AppWidgetWork_IsFading");
static_assert(offsetof(AppWidgetWork_IsFading, ReturnValue) == 0x000000, "Member 'AppWidgetWork_IsFading::ReturnValue' has a wrong offset!");

// Function UIFramework.AppWidgetWork.IsFadingOut
// 0x0001 (0x0001 - 0x0000)
struct AppWidgetWork_IsFadingOut final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppWidgetWork_IsFadingOut) == 0x000001, "Wrong alignment on AppWidgetWork_IsFadingOut");
static_assert(sizeof(AppWidgetWork_IsFadingOut) == 0x000001, "Wrong size on AppWidgetWork_IsFadingOut");
static_assert(offsetof(AppWidgetWork_IsFadingOut, ReturnValue) == 0x000000, "Member 'AppWidgetWork_IsFadingOut::ReturnValue' has a wrong offset!");

// Function UIFramework.CustomMultiLineEditableText.BP_SetLimitCount
// 0x0004 (0x0004 - 0x0000)
struct CustomMultiLineEditableText_BP_SetLimitCount final
{
public:
	int32                                         LimitCount;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomMultiLineEditableText_BP_SetLimitCount) == 0x000004, "Wrong alignment on CustomMultiLineEditableText_BP_SetLimitCount");
static_assert(sizeof(CustomMultiLineEditableText_BP_SetLimitCount) == 0x000004, "Wrong size on CustomMultiLineEditableText_BP_SetLimitCount");
static_assert(offsetof(CustomMultiLineEditableText_BP_SetLimitCount, LimitCount) == 0x000000, "Member 'CustomMultiLineEditableText_BP_SetLimitCount::LimitCount' has a wrong offset!");

// Function UIFramework.CustomMultiLineEditableText.CustomHandleOnTextChanged
// 0x0018 (0x0018 - 0x0000)
struct CustomMultiLineEditableText_CustomHandleOnTextChanged final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomMultiLineEditableText_CustomHandleOnTextChanged) == 0x000008, "Wrong alignment on CustomMultiLineEditableText_CustomHandleOnTextChanged");
static_assert(sizeof(CustomMultiLineEditableText_CustomHandleOnTextChanged) == 0x000018, "Wrong size on CustomMultiLineEditableText_CustomHandleOnTextChanged");
static_assert(offsetof(CustomMultiLineEditableText_CustomHandleOnTextChanged, InText) == 0x000000, "Member 'CustomMultiLineEditableText_CustomHandleOnTextChanged::InText' has a wrong offset!");

// Function UIFramework.CustomMultiLineEditableText.CustomHandleOnTextCommitted
// 0x0020 (0x0020 - 0x0000)
struct CustomMultiLineEditableText_CustomHandleOnTextCommitted final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomMultiLineEditableText_CustomHandleOnTextCommitted) == 0x000008, "Wrong alignment on CustomMultiLineEditableText_CustomHandleOnTextCommitted");
static_assert(sizeof(CustomMultiLineEditableText_CustomHandleOnTextCommitted) == 0x000020, "Wrong size on CustomMultiLineEditableText_CustomHandleOnTextCommitted");
static_assert(offsetof(CustomMultiLineEditableText_CustomHandleOnTextCommitted, InText) == 0x000000, "Member 'CustomMultiLineEditableText_CustomHandleOnTextCommitted::InText' has a wrong offset!");
static_assert(offsetof(CustomMultiLineEditableText_CustomHandleOnTextCommitted, CommitMethod) == 0x000018, "Member 'CustomMultiLineEditableText_CustomHandleOnTextCommitted::CommitMethod' has a wrong offset!");

// Function UIFramework.CustomEditableTextBox.BP_SetLimitCount
// 0x0004 (0x0004 - 0x0000)
struct CustomEditableTextBox_BP_SetLimitCount final
{
public:
	int32                                         LimitCount;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
