#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIFramework

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "UIFramework_structs.hpp"
#include "Engine_classes.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class UIFramework.WidgetBase
// 0x00D8 (0x0350 - 0x0278)
class UWidgetBase : public UUserWidget
{
public:
	uint8                                         Pad_278[0x18];                                     // 0x0278(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _bBlockLowPriorityInput;                           // 0x0290(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_291[0x17];                                     // 0x0291(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UWidgetAnimation*>    _widgetAnimations;                                 // 0x02A8(0x0050)(Protected, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       _currentAnimation;                                 // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_300[0x18];                                     // 0x0300(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidgetBase*>                    _childWidgets;                                     // 0x0318(0x0010)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UWidgetBase*                            _parentWidget;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _owningLevelName;                                  // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInterface>            _interfaceObject;                                  // 0x0340(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	void BlockLowPriorityInput();
	void BP_NativePlayAll(const class FName& AnimationName, int32 LoopCount, float StartTime, bool IsReverse);
	void BP_NativeStopAll();
	void BP_PlayAll(const class UWidgetAnimation* Animation, int32 LoopCount, float StartTime, bool IsReverse);
	void CopyWidgetAnimations(class UWidgetBase* base, const bool bAllChildren, const bool bOverride);
	void DelayInitializePriorityInput(int32 NewZOrder);
	class FName GetOwningLevelName();
	void InitWidgetAnimations(const bool bAllChildren);
	void OnAddToScreen();
	void OnRemoveFromParent();
	void ReplaceWidgetAnimation(const class FName& Name_0, class UWidgetAnimation* WidgetAnimation, const bool bAllChildren);
	void ReplaceWidgetAnimations(TMap<class FName, class UWidgetAnimation*>* WidgetAnimations, const bool bAllChildren);
	void SendToBP_WidgetBaseDesignatedEvent(EWidgetBaseEventChannel InChannel);
	void SetCanTick(bool bCanTick);
	void SetFocusClearedCause();
	void SetKeyboardFocusUnBlocked();
	void StopWidgetAnimation(const class FName& Name_0, const bool bAllChildren);
	void StopWidgetAnimations(const TArray<class FName>& Names, const bool bAllChildren);
	void StopWidgetAnimationsAll(const bool bAllChildren);
	void UnblockLowPriorityInput();

	const TArray<class UWidgetBase*> GetChildWidgets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetBase">();
	}
	static class UWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetBase>();
	}
};
static_assert(alignof(UWidgetBase) == 0x000008, "Wrong alignment on UWidgetBase");
static_assert(sizeof(UWidgetBase) == 0x000350, "Wrong size on UWidgetBase");
static_assert(offsetof(UWidgetBase, _bBlockLowPriorityInput) == 0x000290, "Member 'UWidgetBase::_bBlockLowPriorityInput' has a wrong offset!");
static_assert(offsetof(UWidgetBase, _widgetAnimations) == 0x0002A8, "Member 'UWidgetBase::_widgetAnimations' has a wrong offset!");
static_assert(offsetof(UWidgetBase, _currentAnimation) == 0x0002F8, "Member 'UWidgetBase::_currentAnimation' has a wrong offset!");
static_assert(offsetof(UWidgetBase, _childWidgets) == 0x000318, "Member 'UWidgetBase::_childWidgets' has a wrong offset!");
static_assert(offsetof(UWidgetBase, _parentWidget) == 0x000328, "Member 'UWidgetBase::_parentWidget' has a wrong offset!");
static_assert(offsetof(UWidgetBase, _owningLevelName) == 0x000330, "Member 'UWidgetBase::_owningLevelName' has a wrong offset!");
static_assert(offsetof(UWidgetBase, _interfaceObject) == 0x000340, "Member 'UWidgetBase::_interfaceObject' has a wrong offset!");

// Class UIFramework.WidgetTransition
// 0x0150 (0x04A0 - 0x0350)
class alignas(0x10) UWidgetTransition : public UWidgetBase
{
public:
	class UImage*                                 Background;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             LoadingText;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 LoadingIcon;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_368[0x138];                                    // 0x0368(0x0138)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetTransition">();
	}
	static class UWidgetTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetTransition>();
	}
};
static_assert(alignof(UWidgetTransition) == 0x000010, "Wrong alignment on UWidgetTransition");
static_assert(sizeof(UWidgetTransition) == 0x0004A0, "Wrong size on UWidgetTransition");
static_assert(offsetof(UWidgetTransition, Background) == 0x000350, "Member 'UWidgetTransition::Background' has a wrong offset!");
static_assert(offsetof(UWidgetTransition, LoadingText) == 0x000358, "Member 'UWidgetTransition::LoadingText' has a wrong offset!");
static_assert(offsetof(UWidgetTransition, LoadingIcon) == 0x000360, "Member 'UWidgetTransition::LoadingIcon' has a wrong offset!");

// Class UIFramework.CustomListView
// 0x0028 (0x0390 - 0x0368)
class UCustomListView final : public UListView
{
public:
	ESlateVisibility                              _scrollBarVisibility;                              // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USlateWidgetStyleAsset*                 _scrollBarStyleAsset;                              // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMargin                                _padding;                                          // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddScrollOffset(float AddScrollOffset_0);
	void AddScrollOffsetByAnalogStick(const struct FAnalogInputEvent& InAnalogEvent, float ScrollSpeed, float DefaultSpeedRate, float MaxSpeedRate, float AddSpeedRate);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomListView">();
	}
	static class UCustomListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomListView>();
	}
};
static_assert(alignof(UCustomListView) == 0x000008, "Wrong alignment on UCustomListView");
static_assert(sizeof(UCustomListView) == 0x000390, "Wrong size on UCustomListView");
static_assert(offsetof(UCustomListView, _scrollBarVisibility) == 0x000368, "Member 'UCustomListView::_scrollBarVisibility' has a wrong offset!");
static_assert(offsetof(UCustomListView, _scrollBarStyleAsset) == 0x000370, "Member 'UCustomListView::_scrollBarStyleAsset' has a wrong offset!");
static_assert(offsetof(UCustomListView, _padding) == 0x000378, "Member 'UCustomListView::_padding' has a wrong offset!");

// Class UIFramework.WidgetVersionNotation
// 0x0018 (0x0368 - 0x0350)
class UWidgetVersionNotation : public UWidgetBase
{
public:
	class UTextBlock*                             Text;                                              // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_358[0x10];                                     // 0x0358(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetVersionNotation">();
	}
	static class UWidgetVersionNotation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetVersionNotation>();
	}
};
static_assert(alignof(UWidgetVersionNotation) == 0x000008, "Wrong alignment on UWidgetVersionNotation");
static_assert(sizeof(UWidgetVersionNotation) == 0x000368, "Wrong size on UWidgetVersionNotation");
static_assert(offsetof(UWidgetVersionNotation, Text) == 0x000350, "Member 'UWidgetVersionNotation::Text' has a wrong offset!");

// Class UIFramework.AppWidget
// 0x0098 (0x03E8 - 0x0350)
class UAppWidget : public UWidgetBase
{
public:
	FMulticastInlineDelegateProperty_             OnPressDelegate;                                   // 0x0350(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnReleaseDelegate;                                 // 0x0360(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnSelectDelegate;                                  // 0x0370(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnCancelDelegate;                                  // 0x0380(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnNegativeDelegate;                                // 0x0390(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnAddedToFocusDelegate;                            // 0x03A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnRemovedFromFocusDelegate;                        // 0x03B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<EInputKey>                             _pressKeys;                                        // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<EInputKey>                             _cancelKeys;                                       // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          _bEnable;                                          // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppWidget">();
	}
	static class UAppWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppWidget>();
	}
};
static_assert(alignof(UAppWidget) == 0x000008, "Wrong alignment on UAppWidget");
static_assert(sizeof(UAppWidget) == 0x0003E8, "Wrong size on UAppWidget");
static_assert(offsetof(UAppWidget, OnPressDelegate) == 0x000350, "Member 'UAppWidget::OnPressDelegate' has a wrong offset!");
static_assert(offsetof(UAppWidget, OnReleaseDelegate) == 0x000360, "Member 'UAppWidget::OnReleaseDelegate' has a wrong offset!");
static_assert(offsetof(UAppWidget, OnSelectDelegate) == 0x000370, "Member 'UAppWidget::OnSelectDelegate' has a wrong offset!");
static_assert(offsetof(UAppWidget, OnCancelDelegate) == 0x000380, "Member 'UAppWidget::OnCancelDelegate' has a wrong offset!");
static_assert(offsetof(UAppWidget, OnNegativeDelegate) == 0x000390, "Member 'UAppWidget::OnNegativeDelegate' has a wrong offset!");
static_assert(offsetof(UAppWidget, OnAddedToFocusDelegate) == 0x0003A0, "Member 'UAppWidget::OnAddedToFocusDelegate' has a wrong offset!");
static_assert(offsetof(UAppWidget, OnRemovedFromFocusDelegate) == 0x0003B0, "Member 'UAppWidget::OnRemovedFromFocusDelegate' has a wrong offset!");
static_assert(offsetof(UAppWidget, _pressKeys) == 0x0003C0, "Member 'UAppWidget::_pressKeys' has a wrong offset!");
static_assert(offsetof(UAppWidget, _cancelKeys) == 0x0003D0, "Member 'UAppWidget::_cancelKeys' has a wrong offset!");
static_assert(offsetof(UAppWidget, _bEnable) == 0x0003E0, "Member 'UAppWidget::_bEnable' has a wrong offset!");

// Class UIFramework.WidgetWindowFrame
// 0x0228 (0x0578 - 0x0350)
class UWidgetWindowFrame : public UWidgetBase
{
public:
	uint8                                         _buttonCount;                                      // 0x0350(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _bLoop;                                            // 0x0351(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_352[0x6];                                      // 0x0352(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeneralButtonText                     _buttonText1;                                      // 0x0358(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FGeneralButtonText                     _buttonText2;                                      // 0x03B0(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   _headerText;                                       // 0x0408(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	float                                         _windowSize;                                       // 0x0420(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                _buttonPanel;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USpacer*                                _buttonSpacer;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetButton*                          _button1;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetButton*                          _button2;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                _button2Panel;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetText*                            _header;                                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USpacer*                                _bgSpacer;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                _buttonBox;                                        // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNamedSlot*                             Base1Slot;                                         // 0x0468(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNamedSlot*                             Base2Slot;                                         // 0x0470(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNamedSlot*                             ContentSlot;                                       // 0x0478(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 _windowBg;                                         // 0x0480(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                _base1Image;                                       // 0x0488(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                _base2Image;                                       // 0x0490(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_498[0x10];                                     // 0x0498(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             _buttonDecideEvent1;                               // 0x04A8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             _buttonPressEvent1;                                // 0x04B8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          _bUseButtonLongDecideEvent1;                       // 0x04C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             _buttonLongDecideEvent1;                           // 0x04D0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             _buttonAddedToFocusEvent1;                         // 0x04E0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             _buttonRemovedFromFocusEvent1;                     // 0x04F0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             _buttonDecideEvent2;                               // 0x0500(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             _buttonPressEvent2;                                // 0x0510(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          _bUseButtonLongDecideEvent2;                       // 0x0520(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             _buttonLongDecideEvent2;                           // 0x0528(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             _buttonAddedToFocusEvent2;                         // 0x0538(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             _buttonRemovedFromFocusEvent2;                     // 0x0548(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnOpenedDelegate;                                  // 0x0558(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnClosedDelegate;                                  // 0x0568(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void OnButtonAddedToFocusEvent(class UAppWidget* Widget, EWidgetInputType InputType);
	void OnButtonDecideEvent(class UAppWidget* Widget, EWidgetInputType InputType);
	void OnButtonOnLongDecideEvent(class UAppWidget* Widget, EWidgetInputType InputType);
	void OnButtonPressEvent(class UAppWidget* Widget, EWidgetInputType InputType);
	void OnButtonRemovedFromFocusEvent(class UAppWidget* Widget, EWidgetInputType InputType);
	void OnWindowEventDelegate__DelegateSignature();
	void ReplaceBase1Slot(class UNamedSlot* Source);
	void ReplaceBase2Slot(class UNamedSlot* Source);
	void ReplaceContentsSlot(class UNamedSlot* Source);
	void SetupBaseWidgets();

	uint8 GetButtonCount() const;
	float GetWindowSize() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetWindowFrame">();
	}
	static class UWidgetWindowFrame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetWindowFrame>();
	}
};
static_assert(alignof(UWidgetWindowFrame) == 0x000008, "Wrong alignment on UWidgetWindowFrame");
static_assert(sizeof(UWidgetWindowFrame) == 0x000578, "Wrong size on UWidgetWindowFrame");
static_assert(offsetof(UWidgetWindowFrame, _buttonCount) == 0x000350, "Member 'UWidgetWindowFrame::_buttonCount' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _bLoop) == 0x000351, "Member 'UWidgetWindowFrame::_bLoop' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _buttonText1) == 0x000358, "Member 'UWidgetWindowFrame::_buttonText1' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _buttonText2) == 0x0003B0, "Member 'UWidgetWindowFrame::_buttonText2' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _headerText) == 0x000408, "Member 'UWidgetWindowFrame::_headerText' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _windowSize) == 0x000420, "Member 'UWidgetWindowFrame::_windowSize' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _buttonPanel) == 0x000428, "Member 'UWidgetWindowFrame::_buttonPanel' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _buttonSpacer) == 0x000430, "Member 'UWidgetWindowFrame::_buttonSpacer' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _button1) == 0x000438, "Member 'UWidgetWindowFrame::_button1' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _button2) == 0x000440, "Member 'UWidgetWindowFrame::_button2' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _button2Panel) == 0x000448, "Member 'UWidgetWindowFrame::_button2Panel' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _header) == 0x000450, "Member 'UWidgetWindowFrame::_header' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _bgSpacer) == 0x000458, "Member 'UWidgetWindowFrame::_bgSpacer' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _buttonBox) == 0x000460, "Member 'UWidgetWindowFrame::_buttonBox' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, Base1Slot) == 0x000468, "Member 'UWidgetWindowFrame::Base1Slot' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, Base2Slot) == 0x000470, "Member 'UWidgetWindowFrame::Base2Slot' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, ContentSlot) == 0x000478, "Member 'UWidgetWindowFrame::ContentSlot' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _windowBg) == 0x000480, "Member 'UWidgetWindowFrame::_windowBg' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _base1Image) == 0x000488, "Member 'UWidgetWindowFrame::_base1Image' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _base2Image) == 0x000490, "Member 'UWidgetWindowFrame::_base2Image' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _buttonDecideEvent1) == 0x0004A8, "Member 'UWidgetWindowFrame::_buttonDecideEvent1' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _buttonPressEvent1) == 0x0004B8, "Member 'UWidgetWindowFrame::_buttonPressEvent1' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _bUseButtonLongDecideEvent1) == 0x0004C8, "Member 'UWidgetWindowFrame::_bUseButtonLongDecideEvent1' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _buttonLongDecideEvent1) == 0x0004D0, "Member 'UWidgetWindowFrame::_buttonLongDecideEvent1' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _buttonAddedToFocusEvent1) == 0x0004E0, "Member 'UWidgetWindowFrame::_buttonAddedToFocusEvent1' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _buttonRemovedFromFocusEvent1) == 0x0004F0, "Member 'UWidgetWindowFrame::_buttonRemovedFromFocusEvent1' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _buttonDecideEvent2) == 0x000500, "Member 'UWidgetWindowFrame::_buttonDecideEvent2' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _buttonPressEvent2) == 0x000510, "Member 'UWidgetWindowFrame::_buttonPressEvent2' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _bUseButtonLongDecideEvent2) == 0x000520, "Member 'UWidgetWindowFrame::_bUseButtonLongDecideEvent2' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _buttonLongDecideEvent2) == 0x000528, "Member 'UWidgetWindowFrame::_buttonLongDecideEvent2' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _buttonAddedToFocusEvent2) == 0x000538, "Member 'UWidgetWindowFrame::_buttonAddedToFocusEvent2' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, _buttonRemovedFromFocusEvent2) == 0x000548, "Member 'UWidgetWindowFrame::_buttonRemovedFromFocusEvent2' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, OnOpenedDelegate) == 0x000558, "Member 'UWidgetWindowFrame::OnOpenedDelegate' has a wrong offset!");
static_assert(offsetof(UWidgetWindowFrame, OnClosedDelegate) == 0x000568, "Member 'UWidgetWindowFrame::OnClosedDelegate' has a wrong offset!");

// Class UIFramework.AppWidgetWork
// 0x0418 (0x0448 - 0x0030)
class UAppWidgetWork final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           _localPlayer;                                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             _onFadeStartedDelegate;                            // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UWidgetTransition>          _generateTransitionWidgetClass;                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetTransition*                      _widgetTransition;                                 // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x30];                                      // 0x0078(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UWidgetVersionNotation>     _generateVersionNotationWidgetClass;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetVersionNotation*                 _widgetVersionNotation;                            // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x328];                                     // 0x00B8(0x0328)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidgetBase*>                    _disableInputWidgets;                              // 0x03E0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3F0[0x48];                                     // 0x03F0(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             _operationControllerChangeEvent;                   // 0x0438(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	class UUserWidget* BP_CreateWidget(TSubclassOf<class UUserWidget> WidgetClass, EAppWidgetPriority Priority, int32 SubPriority, bool bAddToScreen);
	void DisableInputForFocusedWidget(class UWidgetBase* Widget);
	void EnableInputForFocusedWidget(class UWidgetBase* Widget);
	void FadeIn(const struct FOnFadeFinished& OnFinishedEvent, EWidgetTransitionFadeType Type, bool bConditional, const struct FLinearColor& Color, bool bEnableWorldRendering);
	void FadeOut(const struct FOnFadeFinished& OnFinishedEvent, EWidgetTransitionFadeType Type, const struct FLinearColor& Color, bool bShowNowLoading);
	void ForceEnableInput();
	class UUserWidget* GetCurrentFocusWidget();
	class UUserWidget* GetPreFocusWidget();
	void InvalidateAllWidgets();
	bool IsGamePadControlVirtualCursor();
	bool IsMouseControlVirtualCursor();
	void OnInputDeviceChanged__DelegateSignature();
	void OperationChangeDelegate__DelegateSignature(const bool bChange);
	void SetDefaultMap(TSoftObjectPtr<class UWorld> Level);
	void SetHistoryFocusedWidget(class UWidget* Widget);
	void SetKeyboardFocusUnBlocked(class UWidgetBase* Widget);
	void SetKeyNavigation(bool Keynavigation);
	void SetLoadingTips(const TArray<class FText>& Tips);
	void SetVirtualCursorCenter();
	void SetVirtualCursorPosition(const struct FVector2D& Position);
	void SetVirtualCursorSpeed(const struct FVector2D& Speed);
	void ShowMouseCursor(const class UObject* Widget, bool Flag);
	void UpdateMouseCaptureAndLock();

	const struct FVector2D GetVirtualCursorDelta() const;
	const struct FVector2D GetVirtualCursorPosition() const;
	bool IsControlledGamePad() const;
	bool IsControlledVirtualCursor() const;
	bool IsFading() const;
	bool IsFadingOut() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppWidgetWork">();
	}
	static class UAppWidgetWork* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppWidgetWork>();
	}
};
static_assert(alignof(UAppWidgetWork) == 0x000008, "Wrong alignment on UAppWidgetWork");
static_assert(sizeof(UAppWidgetWork) == 0x000448, "Wrong size on UAppWidgetWork");
static_assert(offsetof(UAppWidgetWork, _localPlayer) == 0x000038, "Member 'UAppWidgetWork::_localPlayer' has a wrong offset!");
static_assert(offsetof(UAppWidgetWork, _onFadeStartedDelegate) == 0x000058, "Member 'UAppWidgetWork::_onFadeStartedDelegate' has a wrong offset!");
static_assert(offsetof(UAppWidgetWork, _generateTransitionWidgetClass) == 0x000068, "Member 'UAppWidgetWork::_generateTransitionWidgetClass' has a wrong offset!");
static_assert(offsetof(UAppWidgetWork, _widgetTransition) == 0x000070, "Member 'UAppWidgetWork::_widgetTransition' has a wrong offset!");
static_assert(offsetof(UAppWidgetWork, _generateVersionNotationWidgetClass) == 0x0000A8, "Member 'UAppWidgetWork::_generateVersionNotationWidgetClass' has a wrong offset!");
static_assert(offsetof(UAppWidgetWork, _widgetVersionNotation) == 0x0000B0, "Member 'UAppWidgetWork::_widgetVersionNotation' has a wrong offset!");
static_assert(offsetof(UAppWidgetWork, _disableInputWidgets) == 0x0003E0, "Member 'UAppWidgetWork::_disableInputWidgets' has a wrong offset!");
static_assert(offsetof(UAppWidgetWork, _operationControllerChangeEvent) == 0x000438, "Member 'UAppWidgetWork::_operationControllerChangeEvent' has a wrong offset!");

// Class UIFramework.AppWidgetLocalPlayerWork
// 0x0000 (0x0030 - 0x0030)
class UAppWidgetLocalPlayerWork final : public ULocalPlayerSubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppWidgetLocalPlayerWork">();
	}
	static class UAppWidgetLocalPlayerWork* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppWidgetLocalPlayerWork>();
	}
};
static_assert(alignof(UAppWidgetLocalPlayerWork) == 0x000008, "Wrong alignment on UAppWidgetLocalPlayerWork");
static_assert(sizeof(UAppWidgetLocalPlayerWork) == 0x000030, "Wrong size on UAppWidgetLocalPlayerWork");

// Class UIFramework.CustomMultiLineEditableText
// 0x0020 (0x0590 - 0x0570)
class UCustomMultiLineEditableText final : public UMultiLineEditableText
{
public:
	int32                                         _limitCount;                                       // 0x0568(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _bFullWidthCharacter;                              // 0x056C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_56D[0x23];                                     // 0x056D(0x0023)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_ResetTextBox();
	void BP_SetLimitCount(int32 LimitCount);
	void CustomHandleOnTextChanged(const class FText& InText);
	void CustomHandleOnTextCommitted(const class FText& InText, ETextCommit CommitMethod);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomMultiLineEditableText">();
	}
	static class UCustomMultiLineEditableText* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomMultiLineEditableText>();
	}
};
static_assert(alignof(UCustomMultiLineEditableText) == 0x000010, "Wrong alignment on UCustomMultiLineEditableText");
static_assert(sizeof(UCustomMultiLineEditableText) == 0x000590, "Wrong size on UCustomMultiLineEditableText");
static_assert(offsetof(UCustomMultiLineEditableText, _limitCount) == 0x000568, "Member 'UCustomMultiLineEditableText::_limitCount' has a wrong offset!");
static_assert(offsetof(UCustomMultiLineEditableText, _bFullWidthCharacter) == 0x00056C, "Member 'UCustomMultiLineEditableText::_bFullWidthCharacter' has a wrong offset!");

// Class UIFramework.ClippingWidget
// 0x0048 (0x02C0 - 0x0278)
class UClippingWidget final : public UUserWidget
{
public:
	uint8                                         Pad_278[0x20];                                     // 0x0278(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _bDispClippingMask;                                // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _multAlpha;                                        // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _threshold;                                        // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     _targetMaterialInterface;                          // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URetainerBox*                           _target;                                           // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URetainerBox*                           _clippingMask;                                     // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetupDispClippingMask();
	void Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClippingWidget">();
	}
	static class UClippingWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClippingWidget>();
	}
};
static_assert(alignof(UClippingWidget) == 0x000008, "Wrong alignment on UClippingWidget");
static_assert(sizeof(UClippingWidget) == 0x0002C0, "Wrong size on UClippingWidget");
static_assert(offsetof(UClippingWidget, _bDispClippingMask) == 0x000298, "Member 'UClippingWidget::_bDispClippingMask' has a wrong offset!");
static_assert(offsetof(UClippingWidget, _multAlpha) == 0x00029C, "Member 'UClippingWidget::_multAlpha' has a wrong offset!");
static_assert(offsetof(UClippingWidget, _threshold) == 0x0002A0, "Member 'UClippingWidget::_threshold' has a wrong offset!");
static_assert(offsetof(UClippingWidget, _targetMaterialInterface) == 0x0002A8, "Member 'UClippingWidget::_targetMaterialInterface' has a wrong offset!");
static_assert(offsetof(UClippingWidget, _target) == 0x0002B0, "Member 'UClippingWidget::_target' has a wrong offset!");
static_assert(offsetof(UClippingWidget, _clippingMask) == 0x0002B8, "Member 'UClippingWidget::_clippingMask' has a wrong offset!");

// Class UIFramework.CustomEditableTextBox
// 0x0020 (0x0E20 - 0x0E00)
class UCustomEditableTextBox final : public UEditableTextBox
{
public:
	int32                                         _limitCount;                                       // 0x0DF8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _bFullWidthCharacter;                              // 0x0DFC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DFD[0x23];                                     // 0x0DFD(0x0023)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_ResetTextBox();
	void BP_SetLimitCount(int32 LimitCount);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomEditableTextBox">();
	}
	static class UCustomEditableTextBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomEditableTextBox>();
	}
};
static_assert(alignof(UCustomEditableTextBox) == 0x000010, "Wrong alignment on UCustomEditableTextBox");
static_assert(sizeof(UCustomEditableTextBox) == 0x000E20, "Wrong size on UCustomEditableTextBox");
static_assert(offsetof(UCustomEditableTextBox, _limitCount) == 0x000DF8, "Member 'UCustomEditableTextBox::_limitCount' has a wrong offset!");
static_assert(offsetof(UCustomEditableTextBox, _bFullWidthCharacter) == 0x000DFC, "Member 'UCustomEditableTextBox::_bFullWidthCharacter' has a wrong offset!");

// Class UIFramework.CustomScrollBox
// 0x0010 (0x0C50 - 0x0C40)
class UCustomScrollBox final : public UScrollBox
{
public:
	ESlateVisibility                              _scrollBarVisibility;                              // 0x0C38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C39[0x7];                                      // 0x0C39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USlateWidgetStyleAsset*                 _scrollBarStyleAsset;                              // 0x0C40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C48[0x8];                                      // 0x0C48(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddScrollOffset(float AddScrollOffset_0);
	void AddScrollOffsetByAnalogStick(const struct FAnalogInputEvent& InAnalogEvent, float ScrollSpeed, float DefaultSpeedRate, float MaxSpeedRate, float AddSpeedRate);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomScrollBox">();
	}
	static class UCustomScrollBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomScrollBox>();
	}
};
static_assert(alignof(UCustomScrollBox) == 0x000010, "Wrong alignment on UCustomScrollBox");
static_assert(sizeof(UCustomScrollBox) == 0x000C50, "Wrong size on UCustomScrollBox");
static_assert(offsetof(UCustomScrollBox, _scrollBarVisibility) == 0x000C38, "Member 'UCustomScrollBox::_scrollBarVisibility' has a wrong offset!");
static_assert(offsetof(UCustomScrollBox, _scrollBarStyleAsset) == 0x000C40, "Member 'UCustomScrollBox::_scrollBarStyleAsset' has a wrong offset!");

// Class UIFramework.CustomTileView
// 0x0060 (0x03E8 - 0x0388)
class UCustomTileView final : public UTileView
{
public:
	FMulticastInlineDelegateProperty_             _navigationOutSideRightLeft;                       // 0x0388(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             _navigationOutSideUpDown;                          // 0x0398(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         _navigationColumCount;                             // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bNavigationWarpHorizontal;                         // 0x03AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bNavigationWarpVertical;                           // 0x03AD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3AE[0xA];                                      // 0x03AE(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	ESlateVisibility                              _scrollBarVisibility;                              // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USlateWidgetStyleAsset*                 _scrollBarStyleAsset;                              // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMargin                                _padding;                                          // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D8[0x10];                                     // 0x03D8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddScrollOffset(float AddScrollOffset_0);
	class UWidget* NavigationCustom(EUINavigation NavigationType);
	class UWidget* NavigationSet(int32 Index_0);
	class UWidget* NavigationSetItem();
	void OnNavigationOutSideRightLeft__DelegateSignature(bool Right);
	void OnNavigationOutSideUpDown__DelegateSignature(bool Up);
	void SetNavigationColumnCount(int32 Val);

	int32 GetNavigationColumnCount() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomTileView">();
	}
	static class UCustomTileView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomTileView>();
	}
};
static_assert(alignof(UCustomTileView) == 0x000008, "Wrong alignment on UCustomTileView");
static_assert(sizeof(UCustomTileView) == 0x0003E8, "Wrong size on UCustomTileView");
static_assert(offsetof(UCustomTileView, _navigationOutSideRightLeft) == 0x000388, "Member 'UCustomTileView::_navigationOutSideRightLeft' has a wrong offset!");
static_assert(offsetof(UCustomTileView, _navigationOutSideUpDown) == 0x000398, "Member 'UCustomTileView::_navigationOutSideUpDown' has a wrong offset!");
static_assert(offsetof(UCustomTileView, _navigationColumCount) == 0x0003A8, "Member 'UCustomTileView::_navigationColumCount' has a wrong offset!");
static_assert(offsetof(UCustomTileView, bNavigationWarpHorizontal) == 0x0003AC, "Member 'UCustomTileView::bNavigationWarpHorizontal' has a wrong offset!");
static_assert(offsetof(UCustomTileView, bNavigationWarpVertical) == 0x0003AD, "Member 'UCustomTileView::bNavigationWarpVertical' has a wrong offset!");
static_assert(offsetof(UCustomTileView, _scrollBarVisibility) == 0x0003B8, "Member 'UCustomTileView::_scrollBarVisibility' has a wrong offset!");
static_assert(offsetof(UCustomTileView, _scrollBarStyleAsset) == 0x0003C0, "Member 'UCustomTileView::_scrollBarStyleAsset' has a wrong offset!");
static_assert(offsetof(UCustomTileView, _padding) == 0x0003C8, "Member 'UCustomTileView::_padding' has a wrong offset!");

// Class UIFramework.CustomTileViewHasWidget
// 0x0018 (0x0400 - 0x03E8)
class UCustomTileViewHasWidget : public UAppWidget
{
public:
	class UCustomTileView*                        _tileView;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TDelegate<void(EUINavigation Navigation)>     _navigation;                                       // 0x03F0(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	class UWidget* BP_SetCustomTileViewNavigationSet(int32 Index_0);
	class UWidget* BP_SetCustomTileViewNavigationSetItem();
	class UWidget* DoCustomTileViewHasWidgetNavigation(EUINavigation UiNavigation);

	class UCustomTileView* BP_GetTileViewPtr() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomTileViewHasWidget">();
	}
	static class UCustomTileViewHasWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomTileViewHasWidget>();
	}
};
static_assert(alignof(UCustomTileViewHasWidget) == 0x000008, "Wrong alignment on UCustomTileViewHasWidget");
static_assert(sizeof(UCustomTileViewHasWidget) == 0x000400, "Wrong size on UCustomTileViewHasWidget");
static_assert(offsetof(UCustomTileViewHasWidget, _tileView) == 0x0003E8, "Member 'UCustomTileViewHasWidget::_tileView' has a wrong offset!");
static_assert(offsetof(UCustomTileViewHasWidget, _navigation) == 0x0003F0, "Member 'UCustomTileViewHasWidget::_navigation' has a wrong offset!");

// Class UIFramework.LevelLoaderWork
// 0x0000 (0x0030 - 0x0030)
class ULevelLoaderWork final : public UGameInstanceSubsystem
{
public:
	bool IsLoadedLevel(const class FString& LongPackageName);
	class ULevelStreamingDynamic* LoadStreamLevel(const class FString& LongPackageName, const struct FVector& Location, const struct FRotator& Rotation, bool bClientOnly, bool bVisible);
	class ULevelStreamingDynamic* LoadStreamLevelSoftObjectLevel(TSoftObjectPtr<class UWorld> SubLevelClass, const struct FVector& Location, const struct FRotator& Rotation, bool bClientOnly, bool bVisible);
	void SetLevelVisible(const class FString& LongPackageName, bool bVisible);
	void UnLoadStreamLevel(const class FString& LongPackageName);
	void UnLoadStreamLevelLevelStreamingDynamic(const class ULevelStreamingDynamic* LevelStreamingDynamic);
	void UnLoadStreamLevelSoftObjectLevel(TSoftObjectPtr<class UWorld> SubLevelClass);

	bool IsLevelVisible(const class FString& LongPackageName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelLoaderWork">();
	}
	static class ULevelLoaderWork* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelLoaderWork>();
	}
};
static_assert(alignof(ULevelLoaderWork) == 0x000008, "Wrong alignment on ULevelLoaderWork");
static_assert(sizeof(ULevelLoaderWork) == 0x000030, "Wrong size on ULevelLoaderWork");

// Class UIFramework.LevelStreamingClientOnly
// 0x0000 (0x0150 - 0x0150)
class ULevelStreamingClientOnly final : public ULevelStreamingDynamic
{
public:
	void SetEnableClientOnlyVisible();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelStreamingClientOnly">();
	}
	static class ULevelStreamingClientOnly* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelStreamingClientOnly>();
	}
};
static_assert(alignof(ULevelStreamingClientOnly) == 0x000010, "Wrong alignment on ULevelStreamingClientOnly");
static_assert(sizeof(ULevelStreamingClientOnly) == 0x000150, "Wrong size on ULevelStreamingClientOnly");

// Class UIFramework.ListViewEntryObjectBase
// 0x0008 (0x0030 - 0x0028)
class UListViewEntryObjectBase : public UObject
{
public:
	int32                                         _index;                                            // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetIndex(int32 Index_0);

	int32 GetIndex() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ListViewEntryObjectBase">();
	}
	static class UListViewEntryObjectBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UListViewEntryObjectBase>();
	}
};
static_assert(alignof(UListViewEntryObjectBase) == 0x000008, "Wrong alignment on UListViewEntryObjectBase");
static_assert(sizeof(UListViewEntryObjectBase) == 0x000030, "Wrong size on UListViewEntryObjectBase");
static_assert(offsetof(UListViewEntryObjectBase, _index) == 0x000028, "Member 'UListViewEntryObjectBase::_index' has a wrong offset!");

// Class UIFramework.UIPresenterBase
// 0x0008 (0x0228 - 0x0220)
class AUIPresenterBase : public AActor
{
public:
	EUIInstanceCreationStep                       _stepWhenCreateUIInstance;                         // 0x0220(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIPresenterBase">();
	}
	static class AUIPresenterBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUIPresenterBase>();
	}
};
static_assert(alignof(AUIPresenterBase) == 0x000008, "Wrong alignment on AUIPresenterBase");
static_assert(sizeof(AUIPresenterBase) == 0x000228, "Wrong size on AUIPresenterBase");
static_assert(offsetof(AUIPresenterBase, _stepWhenCreateUIInstance) == 0x000220, "Member 'AUIPresenterBase::_stepWhenCreateUIInstance' has a wrong offset!");

// Class UIFramework.MultiWidgetCreator
// 0x00A8 (0x02D0 - 0x0228)
class AMultiWidgetCreator : public AUIPresenterBase
{
public:
	bool                                          _bWaitPlayerState;                                 // 0x0228(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FWidgetCreationData> _widgetDataToCreate;                               // 0x0230(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, class UWidgetBase*>         _widgetInstances;                                  // 0x0280(0x0050)(ExportObject, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	void DestroyPresenter();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MultiWidgetCreator">();
	}
	static class AMultiWidgetCreator* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMultiWidgetCreator>();
	}
};
static_assert(alignof(AMultiWidgetCreator) == 0x000008, "Wrong alignment on AMultiWidgetCreator");
static_assert(sizeof(AMultiWidgetCreator) == 0x0002D0, "Wrong size on AMultiWidgetCreator");
static_assert(offsetof(AMultiWidgetCreator, _bWaitPlayerState) == 0x000228, "Member 'AMultiWidgetCreator::_bWaitPlayerState' has a wrong offset!");
static_assert(offsetof(AMultiWidgetCreator, _widgetDataToCreate) == 0x000230, "Member 'AMultiWidgetCreator::_widgetDataToCreate' has a wrong offset!");
static_assert(offsetof(AMultiWidgetCreator, _widgetInstances) == 0x000280, "Member 'AMultiWidgetCreator::_widgetInstances' has a wrong offset!");

// Class UIFramework.RichTextImageDecorator
// 0x0000 (0x0038 - 0x0038)
class URichTextImageDecorator : public URichTextBlockImageDecorator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RichTextImageDecorator">();
	}
	static class URichTextImageDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<URichTextImageDecorator>();
	}
};
static_assert(alignof(URichTextImageDecorator) == 0x000008, "Wrong alignment on URichTextImageDecorator");
static_assert(sizeof(URichTextImageDecorator) == 0x000038, "Wrong size on URichTextImageDecorator");

// Class UIFramework.RichTextImageDecoratorForPlatform
// 0x0268 (0x02A0 - 0x0038)
class alignas(0x10) URichTextImageDecoratorForPlatform : public URichTextBlockImageDecorator
{
public:
	uint8                                         Pad_38[0x1F8];                                     // 0x0038(0x01F8)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FLinearColor>        _buttonColors;                                     // 0x0240(0x0050)(NativeAccessSpecifierPublic)
	uint8                                         Pad_290[0x10];                                     // 0x0290(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RichTextImageDecoratorForPlatform">();
	}
	static class URichTextImageDecoratorForPlatform* GetDefaultObj()
	{
		return GetDefaultObjImpl<URichTextImageDecoratorForPlatform>();
	}
};
static_assert(alignof(URichTextImageDecoratorForPlatform) == 0x000010, "Wrong alignment on URichTextImageDecoratorForPlatform");
static_assert(sizeof(URichTextImageDecoratorForPlatform) == 0x0002A0, "Wrong size on URichTextImageDecoratorForPlatform");
static_assert(offsetof(URichTextImageDecoratorForPlatform, Mid) == 0x000230, "Member 'URichTextImageDecoratorForPlatform::Mid' has a wrong offset!");
