#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoiceChatModule

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function VoiceChatModule.VoiceChatObject.GetInstance
// 0x0008 (0x0008 - 0x0000)
struct VoiceChatObject_GetInstance final
{
public:
	class UVoiceChatObject*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_GetInstance) == 0x000008, "Wrong alignment on VoiceChatObject_GetInstance");
static_assert(sizeof(VoiceChatObject_GetInstance) == 0x000008, "Wrong size on VoiceChatObject_GetInstance");
static_assert(offsetof(VoiceChatObject_GetInstance, ReturnValue) == 0x000000, "Member 'VoiceChatObject_GetInstance::ReturnValue' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.AddCrossMutePlayer
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatObject_AddCrossMutePlayer final
{
public:
	class FString                                 PlatformPlayerId;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_AddCrossMutePlayer) == 0x000008, "Wrong alignment on VoiceChatObject_AddCrossMutePlayer");
static_assert(sizeof(VoiceChatObject_AddCrossMutePlayer) == 0x000010, "Wrong size on VoiceChatObject_AddCrossMutePlayer");
static_assert(offsetof(VoiceChatObject_AddCrossMutePlayer, PlatformPlayerId) == 0x000000, "Member 'VoiceChatObject_AddCrossMutePlayer::PlatformPlayerId' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.BlockPlayersStatus
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatObject_BlockPlayersStatus final
{
public:
	TArray<class FString>                         PlatformPlayerIds;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_BlockPlayersStatus) == 0x000008, "Wrong alignment on VoiceChatObject_BlockPlayersStatus");
static_assert(sizeof(VoiceChatObject_BlockPlayersStatus) == 0x000010, "Wrong size on VoiceChatObject_BlockPlayersStatus");
static_assert(offsetof(VoiceChatObject_BlockPlayersStatus, PlatformPlayerIds) == 0x000000, "Member 'VoiceChatObject_BlockPlayersStatus::PlatformPlayerIds' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.BlockPlayerStatus
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatObject_BlockPlayerStatus final
{
public:
	class FString                                 PlatformPlayerId;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_BlockPlayerStatus) == 0x000008, "Wrong alignment on VoiceChatObject_BlockPlayerStatus");
static_assert(sizeof(VoiceChatObject_BlockPlayerStatus) == 0x000010, "Wrong size on VoiceChatObject_BlockPlayerStatus");
static_assert(offsetof(VoiceChatObject_BlockPlayerStatus, PlatformPlayerId) == 0x000000, "Member 'VoiceChatObject_BlockPlayerStatus::PlatformPlayerId' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.Connect
// 0x0018 (0x0018 - 0x0000)
struct VoiceChatObject_Connect final
{
public:
	class FString                                 PlatformPlayerId;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VoiceChatObject_Connect) == 0x000008, "Wrong alignment on VoiceChatObject_Connect");
static_assert(sizeof(VoiceChatObject_Connect) == 0x000018, "Wrong size on VoiceChatObject_Connect");
static_assert(offsetof(VoiceChatObject_Connect, PlatformPlayerId) == 0x000000, "Member 'VoiceChatObject_Connect::PlatformPlayerId' has a wrong offset!");
static_assert(offsetof(VoiceChatObject_Connect, ReturnValue) == 0x000010, "Member 'VoiceChatObject_Connect::ReturnValue' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.GetActiveInputDevice
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatObject_GetActiveInputDevice final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_GetActiveInputDevice) == 0x000008, "Wrong alignment on VoiceChatObject_GetActiveInputDevice");
static_assert(sizeof(VoiceChatObject_GetActiveInputDevice) == 0x000010, "Wrong size on VoiceChatObject_GetActiveInputDevice");
static_assert(offsetof(VoiceChatObject_GetActiveInputDevice, ReturnValue) == 0x000000, "Member 'VoiceChatObject_GetActiveInputDevice::ReturnValue' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.GetActiveOutputDevice
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatObject_GetActiveOutputDevice final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_GetActiveOutputDevice) == 0x000008, "Wrong alignment on VoiceChatObject_GetActiveOutputDevice");
static_assert(sizeof(VoiceChatObject_GetActiveOutputDevice) == 0x000010, "Wrong size on VoiceChatObject_GetActiveOutputDevice");
static_assert(offsetof(VoiceChatObject_GetActiveOutputDevice, ReturnValue) == 0x000000, "Member 'VoiceChatObject_GetActiveOutputDevice::ReturnValue' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.Initialize
// 0x0001 (0x0001 - 0x0000)
struct VoiceChatObject_Initialize final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_Initialize) == 0x000001, "Wrong alignment on VoiceChatObject_Initialize");
static_assert(sizeof(VoiceChatObject_Initialize) == 0x000001, "Wrong size on VoiceChatObject_Initialize");
static_assert(offsetof(VoiceChatObject_Initialize, ReturnValue) == 0x000000, "Member 'VoiceChatObject_Initialize::ReturnValue' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.IsInitialized
// 0x0001 (0x0001 - 0x0000)
struct VoiceChatObject_IsInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_IsInitialized) == 0x000001, "Wrong alignment on VoiceChatObject_IsInitialized");
static_assert(sizeof(VoiceChatObject_IsInitialized) == 0x000001, "Wrong size on VoiceChatObject_IsInitialized");
static_assert(offsetof(VoiceChatObject_IsInitialized, ReturnValue) == 0x000000, "Member 'VoiceChatObject_IsInitialized::ReturnValue' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.JoinChannel
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatObject_JoinChannel final
{
public:
	class FString                                 ChannelName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_JoinChannel) == 0x000008, "Wrong alignment on VoiceChatObject_JoinChannel");
static_assert(sizeof(VoiceChatObject_JoinChannel) == 0x000010, "Wrong size on VoiceChatObject_JoinChannel");
static_assert(offsetof(VoiceChatObject_JoinChannel, ChannelName) == 0x000000, "Member 'VoiceChatObject_JoinChannel::ChannelName' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.Set3DPosition
// 0x0030 (0x0030 - 0x0000)
struct VoiceChatObject_Set3DPosition final
{
public:
	struct FVector                                SpeakerPos;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ListenerPos;                                       // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ForwardDir;                                        // 0x0018(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                UpDirection;                                       // 0x0024(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_Set3DPosition) == 0x000004, "Wrong alignment on VoiceChatObject_Set3DPosition");
static_assert(sizeof(VoiceChatObject_Set3DPosition) == 0x000030, "Wrong size on VoiceChatObject_Set3DPosition");
static_assert(offsetof(VoiceChatObject_Set3DPosition, SpeakerPos) == 0x000000, "Member 'VoiceChatObject_Set3DPosition::SpeakerPos' has a wrong offset!");
static_assert(offsetof(VoiceChatObject_Set3DPosition, ListenerPos) == 0x00000C, "Member 'VoiceChatObject_Set3DPosition::ListenerPos' has a wrong offset!");
static_assert(offsetof(VoiceChatObject_Set3DPosition, ForwardDir) == 0x000018, "Member 'VoiceChatObject_Set3DPosition::ForwardDir' has a wrong offset!");
static_assert(offsetof(VoiceChatObject_Set3DPosition, UpDirection) == 0x000024, "Member 'VoiceChatObject_Set3DPosition::UpDirection' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.SetAudioInputMute
// 0x0001 (0x0001 - 0x0000)
struct VoiceChatObject_SetAudioInputMute final
{
public:
	bool                                          bMuted;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_SetAudioInputMute) == 0x000001, "Wrong alignment on VoiceChatObject_SetAudioInputMute");
static_assert(sizeof(VoiceChatObject_SetAudioInputMute) == 0x000001, "Wrong size on VoiceChatObject_SetAudioInputMute");
static_assert(offsetof(VoiceChatObject_SetAudioInputMute, bMuted) == 0x000000, "Member 'VoiceChatObject_SetAudioInputMute::bMuted' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.SetAudioInputVolume
// 0x0004 (0x0004 - 0x0000)
struct VoiceChatObject_SetAudioInputVolume final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_SetAudioInputVolume) == 0x000004, "Wrong alignment on VoiceChatObject_SetAudioInputVolume");
static_assert(sizeof(VoiceChatObject_SetAudioInputVolume) == 0x000004, "Wrong size on VoiceChatObject_SetAudioInputVolume");
static_assert(offsetof(VoiceChatObject_SetAudioInputVolume, Volume) == 0x000000, "Member 'VoiceChatObject_SetAudioInputVolume::Volume' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.SetAudioOutputMute
// 0x0001 (0x0001 - 0x0000)
struct VoiceChatObject_SetAudioOutputMute final
{
public:
	bool                                          bMuted;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_SetAudioOutputMute) == 0x000001, "Wrong alignment on VoiceChatObject_SetAudioOutputMute");
static_assert(sizeof(VoiceChatObject_SetAudioOutputMute) == 0x000001, "Wrong size on VoiceChatObject_SetAudioOutputMute");
static_assert(offsetof(VoiceChatObject_SetAudioOutputMute, bMuted) == 0x000000, "Member 'VoiceChatObject_SetAudioOutputMute::bMuted' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.SetAudioOutputVolume
// 0x0004 (0x0004 - 0x0000)
struct VoiceChatObject_SetAudioOutputVolume final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_SetAudioOutputVolume) == 0x000004, "Wrong alignment on VoiceChatObject_SetAudioOutputVolume");
static_assert(sizeof(VoiceChatObject_SetAudioOutputVolume) == 0x000004, "Wrong size on VoiceChatObject_SetAudioOutputVolume");
static_assert(offsetof(VoiceChatObject_SetAudioOutputVolume, Volume) == 0x000000, "Member 'VoiceChatObject_SetAudioOutputVolume::Volume' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.SetCrossMutePlayers
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatObject_SetCrossMutePlayers final
{
public:
	TArray<class FString>                         PlatformPlayerIds;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_SetCrossMutePlayers) == 0x000008, "Wrong alignment on VoiceChatObject_SetCrossMutePlayers");
static_assert(sizeof(VoiceChatObject_SetCrossMutePlayers) == 0x000010, "Wrong size on VoiceChatObject_SetCrossMutePlayers");
static_assert(offsetof(VoiceChatObject_SetCrossMutePlayers, PlatformPlayerIds) == 0x000000, "Member 'VoiceChatObject_SetCrossMutePlayers::PlatformPlayerIds' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.SetEnableSpeechToText
// 0x0001 (0x0001 - 0x0000)
struct VoiceChatObject_SetEnableSpeechToText final
{
public:
	bool                                          bEnableSpeechToText;                               // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_SetEnableSpeechToText) == 0x000001, "Wrong alignment on VoiceChatObject_SetEnableSpeechToText");
static_assert(sizeof(VoiceChatObject_SetEnableSpeechToText) == 0x000001, "Wrong size on VoiceChatObject_SetEnableSpeechToText");
static_assert(offsetof(VoiceChatObject_SetEnableSpeechToText, bEnableSpeechToText) == 0x000000, "Member 'VoiceChatObject_SetEnableSpeechToText::bEnableSpeechToText' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.SetInputDevice
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatObject_SetInputDevice final
{
public:
	class FString                                 InputDeviceId;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_SetInputDevice) == 0x000008, "Wrong alignment on VoiceChatObject_SetInputDevice");
static_assert(sizeof(VoiceChatObject_SetInputDevice) == 0x000010, "Wrong size on VoiceChatObject_SetInputDevice");
static_assert(offsetof(VoiceChatObject_SetInputDevice, InputDeviceId) == 0x000000, "Member 'VoiceChatObject_SetInputDevice::InputDeviceId' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.SetOutputDevice
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatObject_SetOutputDevice final
{
public:
	class FString                                 OutputDeviceId;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_SetOutputDevice) == 0x000008, "Wrong alignment on VoiceChatObject_SetOutputDevice");
static_assert(sizeof(VoiceChatObject_SetOutputDevice) == 0x000010, "Wrong size on VoiceChatObject_SetOutputDevice");
static_assert(offsetof(VoiceChatObject_SetOutputDevice, OutputDeviceId) == 0x000000, "Member 'VoiceChatObject_SetOutputDevice::OutputDeviceId' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.SetPlayerMute
// 0x0018 (0x0018 - 0x0000)
struct VoiceChatObject_SetPlayerMute final
{
public:
	class FString                                 PlatformPlayerId;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMute;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VoiceChatObject_SetPlayerMute) == 0x000008, "Wrong alignment on VoiceChatObject_SetPlayerMute");
static_assert(sizeof(VoiceChatObject_SetPlayerMute) == 0x000018, "Wrong size on VoiceChatObject_SetPlayerMute");
static_assert(offsetof(VoiceChatObject_SetPlayerMute, PlatformPlayerId) == 0x000000, "Member 'VoiceChatObject_SetPlayerMute::PlatformPlayerId' has a wrong offset!");
static_assert(offsetof(VoiceChatObject_SetPlayerMute, bMute) == 0x000010, "Member 'VoiceChatObject_SetPlayerMute::bMute' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.SetPlayerVolume
// 0x0018 (0x0018 - 0x0000)
struct VoiceChatObject_SetPlayerVolume final
{
public:
	class FString                                 PlatformPlayerId;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Volume;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VoiceChatObject_SetPlayerVolume) == 0x000008, "Wrong alignment on VoiceChatObject_SetPlayerVolume");
static_assert(sizeof(VoiceChatObject_SetPlayerVolume) == 0x000018, "Wrong size on VoiceChatObject_SetPlayerVolume");
static_assert(offsetof(VoiceChatObject_SetPlayerVolume, PlatformPlayerId) == 0x000000, "Member 'VoiceChatObject_SetPlayerVolume::PlatformPlayerId' has a wrong offset!");
static_assert(offsetof(VoiceChatObject_SetPlayerVolume, Volume) == 0x000010, "Member 'VoiceChatObject_SetPlayerVolume::Volume' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.SetVoiceFont
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatObject_SetVoiceFont final
{
public:
	class FString                                 VoiceFontName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_SetVoiceFont) == 0x000008, "Wrong alignment on VoiceChatObject_SetVoiceFont");
static_assert(sizeof(VoiceChatObject_SetVoiceFont) == 0x000010, "Wrong size on VoiceChatObject_SetVoiceFont");
static_assert(offsetof(VoiceChatObject_SetVoiceFont, VoiceFontName) == 0x000000, "Member 'VoiceChatObject_SetVoiceFont::VoiceFontName' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.UnblockPlayersStatus
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatObject_UnblockPlayersStatus final
{
public:
	TArray<class FString>                         PlatformPlayerIds;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_UnblockPlayersStatus) == 0x000008, "Wrong alignment on VoiceChatObject_UnblockPlayersStatus");
static_assert(sizeof(VoiceChatObject_UnblockPlayersStatus) == 0x000010, "Wrong size on VoiceChatObject_UnblockPlayersStatus");
static_assert(offsetof(VoiceChatObject_UnblockPlayersStatus, PlatformPlayerIds) == 0x000000, "Member 'VoiceChatObject_UnblockPlayersStatus::PlatformPlayerIds' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.UnblockPlayerStatus
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatObject_UnblockPlayerStatus final
{
public:
	class FString                                 PlatformPlayerId;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_UnblockPlayerStatus) == 0x000008, "Wrong alignment on VoiceChatObject_UnblockPlayerStatus");
static_assert(sizeof(VoiceChatObject_UnblockPlayerStatus) == 0x000010, "Wrong size on VoiceChatObject_UnblockPlayerStatus");
static_assert(offsetof(VoiceChatObject_UnblockPlayerStatus, PlatformPlayerId) == 0x000000, "Member 'VoiceChatObject_UnblockPlayerStatus::PlatformPlayerId' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.GetAudioInputVolume
// 0x0004 (0x0004 - 0x0000)
struct VoiceChatObject_GetAudioInputVolume final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_GetAudioInputVolume) == 0x000004, "Wrong alignment on VoiceChatObject_GetAudioInputVolume");
static_assert(sizeof(VoiceChatObject_GetAudioInputVolume) == 0x000004, "Wrong size on VoiceChatObject_GetAudioInputVolume");
static_assert(offsetof(VoiceChatObject_GetAudioInputVolume, ReturnValue) == 0x000000, "Member 'VoiceChatObject_GetAudioInputVolume::ReturnValue' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.GetAudioOutputVolume
// 0x0004 (0x0004 - 0x0000)
struct VoiceChatObject_GetAudioOutputVolume final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_GetAudioOutputVolume) == 0x000004, "Wrong alignment on VoiceChatObject_GetAudioOutputVolume");
static_assert(sizeof(VoiceChatObject_GetAudioOutputVolume) == 0x000004, "Wrong size on VoiceChatObject_GetAudioOutputVolume");
static_assert(offsetof(VoiceChatObject_GetAudioOutputVolume, ReturnValue) == 0x000000, "Member 'VoiceChatObject_GetAudioOutputVolume::ReturnValue' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.GetCurrentChannelName
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatObject_GetCurrentChannelName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_GetCurrentChannelName) == 0x000008, "Wrong alignment on VoiceChatObject_GetCurrentChannelName");
static_assert(sizeof(VoiceChatObject_GetCurrentChannelName) == 0x000010, "Wrong size on VoiceChatObject_GetCurrentChannelName");
static_assert(offsetof(VoiceChatObject_GetCurrentChannelName, ReturnValue) == 0x000000, "Member 'VoiceChatObject_GetCurrentChannelName::ReturnValue' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.GetPlayersInChannel
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatObject_GetPlayersInChannel final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_GetPlayersInChannel) == 0x000008, "Wrong alignment on VoiceChatObject_GetPlayersInChannel");
static_assert(sizeof(VoiceChatObject_GetPlayersInChannel) == 0x000010, "Wrong size on VoiceChatObject_GetPlayersInChannel");
static_assert(offsetof(VoiceChatObject_GetPlayersInChannel, ReturnValue) == 0x000000, "Member 'VoiceChatObject_GetPlayersInChannel::ReturnValue' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.GetPlayerVolume
// 0x0018 (0x0018 - 0x0000)
struct VoiceChatObject_GetPlayerVolume final
{
public:
	class FString                                 PlatformPlayerId;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VoiceChatObject_GetPlayerVolume) == 0x000008, "Wrong alignment on VoiceChatObject_GetPlayerVolume");
static_assert(sizeof(VoiceChatObject_GetPlayerVolume) == 0x000018, "Wrong size on VoiceChatObject_GetPlayerVolume");
static_assert(offsetof(VoiceChatObject_GetPlayerVolume, PlatformPlayerId) == 0x000000, "Member 'VoiceChatObject_GetPlayerVolume::PlatformPlayerId' has a wrong offset!");
static_assert(offsetof(VoiceChatObject_GetPlayerVolume, ReturnValue) == 0x000010, "Member 'VoiceChatObject_GetPlayerVolume::ReturnValue' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.GetVoiceFontNameList
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatObject_GetVoiceFontNameList final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_GetVoiceFontNameList) == 0x000008, "Wrong alignment on VoiceChatObject_GetVoiceFontNameList");
static_assert(sizeof(VoiceChatObject_GetVoiceFontNameList) == 0x000010, "Wrong size on VoiceChatObject_GetVoiceFontNameList");
static_assert(offsetof(VoiceChatObject_GetVoiceFontNameList, ReturnValue) == 0x000000, "Member 'VoiceChatObject_GetVoiceFontNameList::ReturnValue' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.IsAudioInputMuted
// 0x0001 (0x0001 - 0x0000)
struct VoiceChatObject_IsAudioInputMuted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_IsAudioInputMuted) == 0x000001, "Wrong alignment on VoiceChatObject_IsAudioInputMuted");
static_assert(sizeof(VoiceChatObject_IsAudioInputMuted) == 0x000001, "Wrong size on VoiceChatObject_IsAudioInputMuted");
static_assert(offsetof(VoiceChatObject_IsAudioInputMuted, ReturnValue) == 0x000000, "Member 'VoiceChatObject_IsAudioInputMuted::ReturnValue' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.IsAudioOutputMuted
// 0x0001 (0x0001 - 0x0000)
struct VoiceChatObject_IsAudioOutputMuted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_IsAudioOutputMuted) == 0x000001, "Wrong alignment on VoiceChatObject_IsAudioOutputMuted");
static_assert(sizeof(VoiceChatObject_IsAudioOutputMuted) == 0x000001, "Wrong size on VoiceChatObject_IsAudioOutputMuted");
static_assert(offsetof(VoiceChatObject_IsAudioOutputMuted, ReturnValue) == 0x000000, "Member 'VoiceChatObject_IsAudioOutputMuted::ReturnValue' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.IsChannelConnected
// 0x0001 (0x0001 - 0x0000)
struct VoiceChatObject_IsChannelConnected final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_IsChannelConnected) == 0x000001, "Wrong alignment on VoiceChatObject_IsChannelConnected");
static_assert(sizeof(VoiceChatObject_IsChannelConnected) == 0x000001, "Wrong size on VoiceChatObject_IsChannelConnected");
static_assert(offsetof(VoiceChatObject_IsChannelConnected, ReturnValue) == 0x000000, "Member 'VoiceChatObject_IsChannelConnected::ReturnValue' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.IsConnected
// 0x0001 (0x0001 - 0x0000)
struct VoiceChatObject_IsConnected final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_IsConnected) == 0x000001, "Wrong alignment on VoiceChatObject_IsConnected");
static_assert(sizeof(VoiceChatObject_IsConnected) == 0x000001, "Wrong size on VoiceChatObject_IsConnected");
static_assert(offsetof(VoiceChatObject_IsConnected, ReturnValue) == 0x000000, "Member 'VoiceChatObject_IsConnected::ReturnValue' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.IsPlayerMuted
// 0x0018 (0x0018 - 0x0000)
struct VoiceChatObject_IsPlayerMuted final
{
public:
	class FString                                 PlatformPlayerId;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VoiceChatObject_IsPlayerMuted) == 0x000008, "Wrong alignment on VoiceChatObject_IsPlayerMuted");
static_assert(sizeof(VoiceChatObject_IsPlayerMuted) == 0x000018, "Wrong size on VoiceChatObject_IsPlayerMuted");
static_assert(offsetof(VoiceChatObject_IsPlayerMuted, PlatformPlayerId) == 0x000000, "Member 'VoiceChatObject_IsPlayerMuted::PlatformPlayerId' has a wrong offset!");
static_assert(offsetof(VoiceChatObject_IsPlayerMuted, ReturnValue) == 0x000010, "Member 'VoiceChatObject_IsPlayerMuted::ReturnValue' has a wrong offset!");

// Function VoiceChatModule.VoiceChatObject.SendTextSpeech
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatObject_SendTextSpeech final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceChatObject_SendTextSpeech) == 0x000008, "Wrong alignment on VoiceChatObject_SendTextSpeech");
static_assert(sizeof(VoiceChatObject_SendTextSpeech) == 0x000010, "Wrong size on VoiceChatObject_SendTextSpeech");
static_assert(offsetof(VoiceChatObject_SendTextSpeech, Message) == 0x000000, "Member 'VoiceChatObject_SendTextSpeech::Message' has a wrong offset!");

}

