#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ExitGameWindow

#include "Basic.hpp"

#include "UIFramework_structs.hpp"


namespace SDK::Params
{

// Function WBP_ExitGameWindow.WBP_ExitGameWindow_C.ExecuteUbergraph_WBP_ExitGameWindow
// 0x0018 (0x0018 - 0x0000)
struct WBP_ExitGameWindow_C_ExecuteUbergraph_WBP_ExitGameWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppWidget*                             K2Node_ComponentBoundEvent_widget;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWidgetInputType                              K2Node_ComponentBoundEvent_inputType;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_leftButton;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ExitGameWindow_C_ExecuteUbergraph_WBP_ExitGameWindow) == 0x000008, "Wrong alignment on WBP_ExitGameWindow_C_ExecuteUbergraph_WBP_ExitGameWindow");
static_assert(sizeof(WBP_ExitGameWindow_C_ExecuteUbergraph_WBP_ExitGameWindow) == 0x000018, "Wrong size on WBP_ExitGameWindow_C_ExecuteUbergraph_WBP_ExitGameWindow");
static_assert(offsetof(WBP_ExitGameWindow_C_ExecuteUbergraph_WBP_ExitGameWindow, EntryPoint) == 0x000000, "Member 'WBP_ExitGameWindow_C_ExecuteUbergraph_WBP_ExitGameWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ExitGameWindow_C_ExecuteUbergraph_WBP_ExitGameWindow, K2Node_ComponentBoundEvent_widget) == 0x000008, "Member 'WBP_ExitGameWindow_C_ExecuteUbergraph_WBP_ExitGameWindow::K2Node_ComponentBoundEvent_widget' has a wrong offset!");
static_assert(offsetof(WBP_ExitGameWindow_C_ExecuteUbergraph_WBP_ExitGameWindow, K2Node_ComponentBoundEvent_inputType) == 0x000010, "Member 'WBP_ExitGameWindow_C_ExecuteUbergraph_WBP_ExitGameWindow::K2Node_ComponentBoundEvent_inputType' has a wrong offset!");
static_assert(offsetof(WBP_ExitGameWindow_C_ExecuteUbergraph_WBP_ExitGameWindow, K2Node_ComponentBoundEvent_leftButton) == 0x000011, "Member 'WBP_ExitGameWindow_C_ExecuteUbergraph_WBP_ExitGameWindow::K2Node_ComponentBoundEvent_leftButton' has a wrong offset!");

// Function WBP_ExitGameWindow.WBP_ExitGameWindow_C.BndEvt__WBP_ExitGameWindow__checkPopup_K2Node_ComponentBoundEvent_2_OnWindowInputEventDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ExitGameWindow_C_BndEvt__WBP_ExitGameWindow__checkPopup_K2Node_ComponentBoundEvent_2_OnWindowInputEventDelegate__DelegateSignature final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LeftButton;                                        // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ExitGameWindow_C_BndEvt__WBP_ExitGameWindow__checkPopup_K2Node_ComponentBoundEvent_2_OnWindowInputEventDelegate__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ExitGameWindow_C_BndEvt__WBP_ExitGameWindow__checkPopup_K2Node_ComponentBoundEvent_2_OnWindowInputEventDelegate__DelegateSignature");
static_assert(sizeof(WBP_ExitGameWindow_C_BndEvt__WBP_ExitGameWindow__checkPopup_K2Node_ComponentBoundEvent_2_OnWindowInputEventDelegate__DelegateSignature) == 0x000010, "Wrong size on WBP_ExitGameWindow_C_BndEvt__WBP_ExitGameWindow__checkPopup_K2Node_ComponentBoundEvent_2_OnWindowInputEventDelegate__DelegateSignature");
static_assert(offsetof(WBP_ExitGameWindow_C_BndEvt__WBP_ExitGameWindow__checkPopup_K2Node_ComponentBoundEvent_2_OnWindowInputEventDelegate__DelegateSignature, Widget) == 0x000000, "Member 'WBP_ExitGameWindow_C_BndEvt__WBP_ExitGameWindow__checkPopup_K2Node_ComponentBoundEvent_2_OnWindowInputEventDelegate__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_ExitGameWindow_C_BndEvt__WBP_ExitGameWindow__checkPopup_K2Node_ComponentBoundEvent_2_OnWindowInputEventDelegate__DelegateSignature, InputType) == 0x000008, "Member 'WBP_ExitGameWindow_C_BndEvt__WBP_ExitGameWindow__checkPopup_K2Node_ComponentBoundEvent_2_OnWindowInputEventDelegate__DelegateSignature::InputType' has a wrong offset!");
static_assert(offsetof(WBP_ExitGameWindow_C_BndEvt__WBP_ExitGameWindow__checkPopup_K2Node_ComponentBoundEvent_2_OnWindowInputEventDelegate__DelegateSignature, LeftButton) == 0x000009, "Member 'WBP_ExitGameWindow_C_BndEvt__WBP_ExitGameWindow__checkPopup_K2Node_ComponentBoundEvent_2_OnWindowInputEventDelegate__DelegateSignature::LeftButton' has a wrong offset!");

}

