#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TextChatNewMessage

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_TextChatNewMessage.WBP_TextChatNewMessage_C.ExecuteUbergraph_WBP_TextChatNewMessage
// 0x0050 (0x0050 - 0x0000)
struct WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	const class UWidgetAnimation*                 K2Node_Event_Animation_1;                          // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0040(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage) == 0x000008, "Wrong alignment on WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage");
static_assert(sizeof(WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage) == 0x000050, "Wrong size on WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage");
static_assert(offsetof(WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage, EntryPoint) == 0x000000, "Member 'WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage, K2Node_Event_Animation_1) == 0x000020, "Member 'WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage::K2Node_Event_Animation_1' has a wrong offset!");
static_assert(offsetof(WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage, K2Node_Event_bIsSelected) == 0x000038, "Member 'WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage, K2Node_Event_Animation) == 0x000040, "Member 'WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000048, "Member 'WBP_TextChatNewMessage_C_ExecuteUbergraph_WBP_TextChatNewMessage::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

// Function WBP_TextChatNewMessage.WBP_TextChatNewMessage_C.OnAnimationStarted
// 0x0008 (0x0008 - 0x0000)
struct WBP_TextChatNewMessage_C_OnAnimationStarted final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TextChatNewMessage_C_OnAnimationStarted) == 0x000008, "Wrong alignment on WBP_TextChatNewMessage_C_OnAnimationStarted");
static_assert(sizeof(WBP_TextChatNewMessage_C_OnAnimationStarted) == 0x000008, "Wrong size on WBP_TextChatNewMessage_C_OnAnimationStarted");
static_assert(offsetof(WBP_TextChatNewMessage_C_OnAnimationStarted, Animation) == 0x000000, "Member 'WBP_TextChatNewMessage_C_OnAnimationStarted::Animation' has a wrong offset!");

// Function WBP_TextChatNewMessage.WBP_TextChatNewMessage_C.BP_OnItemSelectionChanged_1
// 0x0001 (0x0001 - 0x0000)
struct WBP_TextChatNewMessage_C_BP_OnItemSelectionChanged_1 final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_TextChatNewMessage_C_BP_OnItemSelectionChanged_1) == 0x000001, "Wrong alignment on WBP_TextChatNewMessage_C_BP_OnItemSelectionChanged_1");
static_assert(sizeof(WBP_TextChatNewMessage_C_BP_OnItemSelectionChanged_1) == 0x000001, "Wrong size on WBP_TextChatNewMessage_C_BP_OnItemSelectionChanged_1");
static_assert(offsetof(WBP_TextChatNewMessage_C_BP_OnItemSelectionChanged_1, bIsSelected) == 0x000000, "Member 'WBP_TextChatNewMessage_C_BP_OnItemSelectionChanged_1::bIsSelected' has a wrong offset!");

// Function WBP_TextChatNewMessage.WBP_TextChatNewMessage_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_TextChatNewMessage_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TextChatNewMessage_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_TextChatNewMessage_C_OnAnimationFinished");
static_assert(sizeof(WBP_TextChatNewMessage_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_TextChatNewMessage_C_OnAnimationFinished");
static_assert(offsetof(WBP_TextChatNewMessage_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_TextChatNewMessage_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_TextChatNewMessage.WBP_TextChatNewMessage_C.SetUpColor
// 0x0010 (0x0010 - 0x0000)
struct WBP_TextChatNewMessage_C_SetUpColor final
{
public:
	TArray<class UWBP_TextChatWindow_C*>          CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_TextChatNewMessage_C_SetUpColor) == 0x000008, "Wrong alignment on WBP_TextChatNewMessage_C_SetUpColor");
static_assert(sizeof(WBP_TextChatNewMessage_C_SetUpColor) == 0x000010, "Wrong size on WBP_TextChatNewMessage_C_SetUpColor");
static_assert(offsetof(WBP_TextChatNewMessage_C_SetUpColor, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000000, "Member 'WBP_TextChatNewMessage_C_SetUpColor::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");

// Function WBP_TextChatNewMessage.WBP_TextChatNewMessage_C.PlayEntryAnimation
// 0x0048 (0x0048 - 0x0000)
struct WBP_TextChatNewMessage_C_PlayEntryAnimation final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          OwnEntry;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerDatabaseWork*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BP_GetLocalPlayerUniqueId_ReturnValue;    // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TextChatNewMessage_C_PlayEntryAnimation) == 0x000008, "Wrong alignment on WBP_TextChatNewMessage_C_PlayEntryAnimation");
static_assert(sizeof(WBP_TextChatNewMessage_C_PlayEntryAnimation) == 0x000048, "Wrong size on WBP_TextChatNewMessage_C_PlayEntryAnimation");
static_assert(offsetof(WBP_TextChatNewMessage_C_PlayEntryAnimation, PlayerId) == 0x000000, "Member 'WBP_TextChatNewMessage_C_PlayEntryAnimation::PlayerId' has a wrong offset!");
static_assert(offsetof(WBP_TextChatNewMessage_C_PlayEntryAnimation, OwnEntry) == 0x000010, "Member 'WBP_TextChatNewMessage_C_PlayEntryAnimation::OwnEntry' has a wrong offset!");
static_assert(offsetof(WBP_TextChatNewMessage_C_PlayEntryAnimation, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'WBP_TextChatNewMessage_C_PlayEntryAnimation::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatNewMessage_C_PlayEntryAnimation, CallFunc_BP_GetLocalPlayerUniqueId_ReturnValue) == 0x000020, "Member 'WBP_TextChatNewMessage_C_PlayEntryAnimation::CallFunc_BP_GetLocalPlayerUniqueId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatNewMessage_C_PlayEntryAnimation, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000030, "Member 'WBP_TextChatNewMessage_C_PlayEntryAnimation::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatNewMessage_C_PlayEntryAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'WBP_TextChatNewMessage_C_PlayEntryAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatNewMessage_C_PlayEntryAnimation, CallFunc_PlayAnimation_ReturnValue_1) == 0x000040, "Member 'WBP_TextChatNewMessage_C_PlayEntryAnimation::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_TextChatNewMessage.WBP_TextChatNewMessage_C.Set Message
// 0x0058 (0x0058 - 0x0000)
struct WBP_TextChatNewMessage_C_Set_Message final
{
public:
	class UTextChatListObject*                    NewObject;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BP_GetItemText_ReturnValue;               // 0x0008(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BP_GetDisplayName_ReturnValue;            // 0x0018(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0040(0x0018)()
};
static_assert(alignof(WBP_TextChatNewMessage_C_Set_Message) == 0x000008, "Wrong alignment on WBP_TextChatNewMessage_C_Set_Message");
static_assert(sizeof(WBP_TextChatNewMessage_C_Set_Message) == 0x000058, "Wrong size on WBP_TextChatNewMessage_C_Set_Message");
static_assert(offsetof(WBP_TextChatNewMessage_C_Set_Message, NewObject) == 0x000000, "Member 'WBP_TextChatNewMessage_C_Set_Message::NewObject' has a wrong offset!");
static_assert(offsetof(WBP_TextChatNewMessage_C_Set_Message, CallFunc_BP_GetItemText_ReturnValue) == 0x000008, "Member 'WBP_TextChatNewMessage_C_Set_Message::CallFunc_BP_GetItemText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatNewMessage_C_Set_Message, CallFunc_BP_GetDisplayName_ReturnValue) == 0x000018, "Member 'WBP_TextChatNewMessage_C_Set_Message::CallFunc_BP_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatNewMessage_C_Set_Message, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'WBP_TextChatNewMessage_C_Set_Message::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatNewMessage_C_Set_Message, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000040, "Member 'WBP_TextChatNewMessage_C_Set_Message::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function WBP_TextChatNewMessage.WBP_TextChatNewMessage_C.PlayNewMessageAnimation
// 0x0008 (0x0008 - 0x0000)
struct WBP_TextChatNewMessage_C_PlayNewMessageAnimation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TextChatNewMessage_C_PlayNewMessageAnimation) == 0x000008, "Wrong alignment on WBP_TextChatNewMessage_C_PlayNewMessageAnimation");
static_assert(sizeof(WBP_TextChatNewMessage_C_PlayNewMessageAnimation) == 0x000008, "Wrong size on WBP_TextChatNewMessage_C_PlayNewMessageAnimation");
static_assert(offsetof(WBP_TextChatNewMessage_C_PlayNewMessageAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_TextChatNewMessage_C_PlayNewMessageAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

