#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TeamCommentaryMessageItem

#include "Basic.hpp"

#include "GameModule_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TeamCommentaryMessageItem.WBP_TeamCommentaryMessageItem_C
// 0x0018 (0x03E0 - 0x03C8)
class UWBP_TeamCommentaryMessageItem_C final : public UTeamCommentaryMessageItemWidget
{
public:
	class UWidgetAnimation*                       Ani_End;                                           // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Idle;                                          // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Start;                                         // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TeamCommentaryMessageItem_C">();
	}
	static class UWBP_TeamCommentaryMessageItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TeamCommentaryMessageItem_C>();
	}
};
static_assert(alignof(UWBP_TeamCommentaryMessageItem_C) == 0x000008, "Wrong alignment on UWBP_TeamCommentaryMessageItem_C");
static_assert(sizeof(UWBP_TeamCommentaryMessageItem_C) == 0x0003E0, "Wrong size on UWBP_TeamCommentaryMessageItem_C");
static_assert(offsetof(UWBP_TeamCommentaryMessageItem_C, Ani_End) == 0x0003C8, "Member 'UWBP_TeamCommentaryMessageItem_C::Ani_End' has a wrong offset!");
static_assert(offsetof(UWBP_TeamCommentaryMessageItem_C, Ani_Idle) == 0x0003D0, "Member 'UWBP_TeamCommentaryMessageItem_C::Ani_Idle' has a wrong offset!");
static_assert(offsetof(UWBP_TeamCommentaryMessageItem_C, Ani_Start) == 0x0003D8, "Member 'UWBP_TeamCommentaryMessageItem_C::Ani_Start' has a wrong offset!");

}

