#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DevelopMenuItem

#include "Basic.hpp"

#include "DevelopMenu_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DevelopMenuItem.WBP_DevelopMenuItem_C
// 0x0048 (0x0310 - 0x02C8)
class UWBP_DevelopMenuItem_C final : public UDevelopMenuItemWidget
{
public:
	class USpinBox*                               FloatValue;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpinBox*                               IntValue;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ItemButton;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              ItemCheckBox;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ItemCheckBoxBorder;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ItemCheckButton;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ItemPanel;                                         // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        ItemTextList;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       StringValue;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DevelopMenuItem_C">();
	}
	static class UWBP_DevelopMenuItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DevelopMenuItem_C>();
	}
};
static_assert(alignof(UWBP_DevelopMenuItem_C) == 0x000008, "Wrong alignment on UWBP_DevelopMenuItem_C");
static_assert(sizeof(UWBP_DevelopMenuItem_C) == 0x000310, "Wrong size on UWBP_DevelopMenuItem_C");
static_assert(offsetof(UWBP_DevelopMenuItem_C, FloatValue) == 0x0002C8, "Member 'UWBP_DevelopMenuItem_C::FloatValue' has a wrong offset!");
static_assert(offsetof(UWBP_DevelopMenuItem_C, IntValue) == 0x0002D0, "Member 'UWBP_DevelopMenuItem_C::IntValue' has a wrong offset!");
static_assert(offsetof(UWBP_DevelopMenuItem_C, ItemButton) == 0x0002D8, "Member 'UWBP_DevelopMenuItem_C::ItemButton' has a wrong offset!");
static_assert(offsetof(UWBP_DevelopMenuItem_C, ItemCheckBox) == 0x0002E0, "Member 'UWBP_DevelopMenuItem_C::ItemCheckBox' has a wrong offset!");
static_assert(offsetof(UWBP_DevelopMenuItem_C, ItemCheckBoxBorder) == 0x0002E8, "Member 'UWBP_DevelopMenuItem_C::ItemCheckBoxBorder' has a wrong offset!");
static_assert(offsetof(UWBP_DevelopMenuItem_C, ItemCheckButton) == 0x0002F0, "Member 'UWBP_DevelopMenuItem_C::ItemCheckButton' has a wrong offset!");
static_assert(offsetof(UWBP_DevelopMenuItem_C, ItemPanel) == 0x0002F8, "Member 'UWBP_DevelopMenuItem_C::ItemPanel' has a wrong offset!");
static_assert(offsetof(UWBP_DevelopMenuItem_C, ItemTextList) == 0x000300, "Member 'UWBP_DevelopMenuItem_C::ItemTextList' has a wrong offset!");
static_assert(offsetof(UWBP_DevelopMenuItem_C, StringValue) == 0x000308, "Member 'UWBP_DevelopMenuItem_C::StringValue' has a wrong offset!");

}

