#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadingTitleWidget

#include "Basic.hpp"

#include "OutGameModule_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LoadingTitleWidget.WBP_LoadingTitleWidget_C
// 0x0028 (0x0388 - 0x0360)
class UWBP_LoadingTitleWidget_C final : public ULoadingTitleWidget
{
public:
	class UWidgetAnimation*                       Ani_BarEnd;                                        // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_BarLoop;                                       // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_BarIn;                                         // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_45;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NetworkLoadingIcon_C*              WBP_NetworkLoadingIcon;                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LoadingTitleWidget_C">();
	}
	static class UWBP_LoadingTitleWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LoadingTitleWidget_C>();
	}
};
static_assert(alignof(UWBP_LoadingTitleWidget_C) == 0x000008, "Wrong alignment on UWBP_LoadingTitleWidget_C");
static_assert(sizeof(UWBP_LoadingTitleWidget_C) == 0x000388, "Wrong size on UWBP_LoadingTitleWidget_C");
static_assert(offsetof(UWBP_LoadingTitleWidget_C, Ani_BarEnd) == 0x000360, "Member 'UWBP_LoadingTitleWidget_C::Ani_BarEnd' has a wrong offset!");
static_assert(offsetof(UWBP_LoadingTitleWidget_C, Ani_BarLoop) == 0x000368, "Member 'UWBP_LoadingTitleWidget_C::Ani_BarLoop' has a wrong offset!");
static_assert(offsetof(UWBP_LoadingTitleWidget_C, Ani_BarIn) == 0x000370, "Member 'UWBP_LoadingTitleWidget_C::Ani_BarIn' has a wrong offset!");
static_assert(offsetof(UWBP_LoadingTitleWidget_C, Image_45) == 0x000378, "Member 'UWBP_LoadingTitleWidget_C::Image_45' has a wrong offset!");
static_assert(offsetof(UWBP_LoadingTitleWidget_C, WBP_NetworkLoadingIcon) == 0x000380, "Member 'UWBP_LoadingTitleWidget_C::WBP_NetworkLoadingIcon' has a wrong offset!");

}

