#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DevelopMenuButton

#include "Basic.hpp"

#include "DevelopMenu_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DevelopMenuButton.WBP_DevelopMenuButton_C
// 0x0018 (0x02E0 - 0x02C8)
class UWBP_DevelopMenuButton_C final : public UDevelopMenuButtonWidget
{
public:
	class UBorder*                                Border_0;                                          // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                TagButton;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x02D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DevelopMenuButton_C">();
	}
	static class UWBP_DevelopMenuButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DevelopMenuButton_C>();
	}
};
static_assert(alignof(UWBP_DevelopMenuButton_C) == 0x000008, "Wrong alignment on UWBP_DevelopMenuButton_C");
static_assert(sizeof(UWBP_DevelopMenuButton_C) == 0x0002E0, "Wrong size on UWBP_DevelopMenuButton_C");
static_assert(offsetof(UWBP_DevelopMenuButton_C, Border_0) == 0x0002C8, "Member 'UWBP_DevelopMenuButton_C::Border_0' has a wrong offset!");
static_assert(offsetof(UWBP_DevelopMenuButton_C, TagButton) == 0x0002D0, "Member 'UWBP_DevelopMenuButton_C::TagButton' has a wrong offset!");
static_assert(offsetof(UWBP_DevelopMenuButton_C, TextBlock_0) == 0x0002D8, "Member 'UWBP_DevelopMenuButton_C::TextBlock_0' has a wrong offset!");

}

