#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NetworkLoadingIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameModule_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NetworkLoadingIcon.WBP_NetworkLoadingIcon_C
// 0x0028 (0x0378 - 0x0350)
class UWBP_NetworkLoadingIcon_C final : public ULoadIconWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Close;                                         // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Open;                                          // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 LoadIcon;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LoadiconBG;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SequenceEvent_0();
	void ExecuteUbergraph_WBP_NetworkLoadingIcon(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NetworkLoadingIcon_C">();
	}
	static class UWBP_NetworkLoadingIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NetworkLoadingIcon_C>();
	}
};
static_assert(alignof(UWBP_NetworkLoadingIcon_C) == 0x000008, "Wrong alignment on UWBP_NetworkLoadingIcon_C");
static_assert(sizeof(UWBP_NetworkLoadingIcon_C) == 0x000378, "Wrong size on UWBP_NetworkLoadingIcon_C");
static_assert(offsetof(UWBP_NetworkLoadingIcon_C, UberGraphFrame) == 0x000350, "Member 'UWBP_NetworkLoadingIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_NetworkLoadingIcon_C, Ani_Close) == 0x000358, "Member 'UWBP_NetworkLoadingIcon_C::Ani_Close' has a wrong offset!");
static_assert(offsetof(UWBP_NetworkLoadingIcon_C, Ani_Open) == 0x000360, "Member 'UWBP_NetworkLoadingIcon_C::Ani_Open' has a wrong offset!");
static_assert(offsetof(UWBP_NetworkLoadingIcon_C, LoadIcon) == 0x000368, "Member 'UWBP_NetworkLoadingIcon_C::LoadIcon' has a wrong offset!");
static_assert(offsetof(UWBP_NetworkLoadingIcon_C, LoadiconBG) == 0x000370, "Member 'UWBP_NetworkLoadingIcon_C::LoadiconBG' has a wrong offset!");

}

