#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EntryItemTableName

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EntryItemTableName.WBP_EntryItemTableName_C
// 0x0028 (0x02A0 - 0x0278)
class UWBP_EntryItemTableName_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock_Item;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0288(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WBP_EntryItemTableName(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_EntryItemTableName_C">();
	}
	static class UWBP_EntryItemTableName_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EntryItemTableName_C>();
	}
};
static_assert(alignof(UWBP_EntryItemTableName_C) == 0x000008, "Wrong alignment on UWBP_EntryItemTableName_C");
static_assert(sizeof(UWBP_EntryItemTableName_C) == 0x0002A0, "Wrong size on UWBP_EntryItemTableName_C");
static_assert(offsetof(UWBP_EntryItemTableName_C, UberGraphFrame) == 0x000278, "Member 'UWBP_EntryItemTableName_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_EntryItemTableName_C, TextBlock_Item) == 0x000280, "Member 'UWBP_EntryItemTableName_C::TextBlock_Item' has a wrong offset!");
static_assert(offsetof(UWBP_EntryItemTableName_C, Text) == 0x000288, "Member 'UWBP_EntryItemTableName_C::Text' has a wrong offset!");

}

