#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SafeGeneralWindow

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_SafeGeneralWindow.WBP_SafeGeneralWindow_C.ExecuteUbergraph_WBP_SafeGeneralWindow
// 0x0010 (0x0010 - 0x0000)
struct WBP_SafeGeneralWindow_C_ExecuteUbergraph_WBP_SafeGeneralWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         CallFunc_PlaySound2D_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SafeGeneralWindow_C_ExecuteUbergraph_WBP_SafeGeneralWindow) == 0x000008, "Wrong alignment on WBP_SafeGeneralWindow_C_ExecuteUbergraph_WBP_SafeGeneralWindow");
static_assert(sizeof(WBP_SafeGeneralWindow_C_ExecuteUbergraph_WBP_SafeGeneralWindow) == 0x000010, "Wrong size on WBP_SafeGeneralWindow_C_ExecuteUbergraph_WBP_SafeGeneralWindow");
static_assert(offsetof(WBP_SafeGeneralWindow_C_ExecuteUbergraph_WBP_SafeGeneralWindow, EntryPoint) == 0x000000, "Member 'WBP_SafeGeneralWindow_C_ExecuteUbergraph_WBP_SafeGeneralWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SafeGeneralWindow_C_ExecuteUbergraph_WBP_SafeGeneralWindow, CallFunc_PlaySound2D_ReturnValue) == 0x000008, "Member 'WBP_SafeGeneralWindow_C_ExecuteUbergraph_WBP_SafeGeneralWindow::CallFunc_PlaySound2D_ReturnValue' has a wrong offset!");

// Function WBP_SafeGeneralWindow.WBP_SafeGeneralWindow_C.On_BlockBG_MouseButtonDown_0
// 0x0220 (0x0220 - 0x0000)
struct WBP_SafeGeneralWindow_C_On_BlockBG_MouseButtonDown_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	class UAtomComponent*                         CallFunc_PlaySound2D_ReturnValue;                  // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0168(0x00B8)()
};
static_assert(alignof(WBP_SafeGeneralWindow_C_On_BlockBG_MouseButtonDown_0) == 0x000008, "Wrong alignment on WBP_SafeGeneralWindow_C_On_BlockBG_MouseButtonDown_0");
static_assert(sizeof(WBP_SafeGeneralWindow_C_On_BlockBG_MouseButtonDown_0) == 0x000220, "Wrong size on WBP_SafeGeneralWindow_C_On_BlockBG_MouseButtonDown_0");
static_assert(offsetof(WBP_SafeGeneralWindow_C_On_BlockBG_MouseButtonDown_0, MyGeometry) == 0x000000, "Member 'WBP_SafeGeneralWindow_C_On_BlockBG_MouseButtonDown_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SafeGeneralWindow_C_On_BlockBG_MouseButtonDown_0, MouseEvent) == 0x000038, "Member 'WBP_SafeGeneralWindow_C_On_BlockBG_MouseButtonDown_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_SafeGeneralWindow_C_On_BlockBG_MouseButtonDown_0, ReturnValue) == 0x0000A8, "Member 'WBP_SafeGeneralWindow_C_On_BlockBG_MouseButtonDown_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SafeGeneralWindow_C_On_BlockBG_MouseButtonDown_0, CallFunc_PlaySound2D_ReturnValue) == 0x000160, "Member 'WBP_SafeGeneralWindow_C_On_BlockBG_MouseButtonDown_0::CallFunc_PlaySound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SafeGeneralWindow_C_On_BlockBG_MouseButtonDown_0, K2Node_MakeStruct_EventReply) == 0x000168, "Member 'WBP_SafeGeneralWindow_C_On_BlockBG_MouseButtonDown_0::K2Node_MakeStruct_EventReply' has a wrong offset!");

}

