#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadTransition

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_LoadTransition.WBP_LoadTransition_C.ExecuteUbergraph_WBP_LoadTransition
// 0x0008 (0x0008 - 0x0000)
struct WBP_LoadTransition_C_ExecuteUbergraph_WBP_LoadTransition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Code;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadTransition_C_ExecuteUbergraph_WBP_LoadTransition) == 0x000004, "Wrong alignment on WBP_LoadTransition_C_ExecuteUbergraph_WBP_LoadTransition");
static_assert(sizeof(WBP_LoadTransition_C_ExecuteUbergraph_WBP_LoadTransition) == 0x000008, "Wrong size on WBP_LoadTransition_C_ExecuteUbergraph_WBP_LoadTransition");
static_assert(offsetof(WBP_LoadTransition_C_ExecuteUbergraph_WBP_LoadTransition, EntryPoint) == 0x000000, "Member 'WBP_LoadTransition_C_ExecuteUbergraph_WBP_LoadTransition::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LoadTransition_C_ExecuteUbergraph_WBP_LoadTransition, K2Node_Event_Code) == 0x000004, "Member 'WBP_LoadTransition_C_ExecuteUbergraph_WBP_LoadTransition::K2Node_Event_Code' has a wrong offset!");

// Function WBP_LoadTransition.WBP_LoadTransition_C.UpdateBgTexture
// 0x0004 (0x0004 - 0x0000)
struct WBP_LoadTransition_C_UpdateBgTexture final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadTransition_C_UpdateBgTexture) == 0x000004, "Wrong alignment on WBP_LoadTransition_C_UpdateBgTexture");
static_assert(sizeof(WBP_LoadTransition_C_UpdateBgTexture) == 0x000004, "Wrong size on WBP_LoadTransition_C_UpdateBgTexture");
static_assert(offsetof(WBP_LoadTransition_C_UpdateBgTexture, Code) == 0x000000, "Member 'WBP_LoadTransition_C_UpdateBgTexture::Code' has a wrong offset!");

}

