#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadTransition

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameModule_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LoadTransition.WBP_LoadTransition_C
// 0x0050 (0x0530 - 0x04E0)
class UWBP_LoadTransition_C final : public ULoadTransitionWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_fadeout_moment;                                // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_fadein_moment;                                 // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_fadeout_short;                                 // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_fadein_short;                                  // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_fadeout;                                       // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_fadein;                                        // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_GalleryTexture_C*                  _bgTexture;                                        // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_2;                                      // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Text_bg;                                           // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_LoadTransition(int32 EntryPoint);
	void HiddenBgTexture();
	void UpdateBgTexture(int32 Code);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LoadTransition_C">();
	}
	static class UWBP_LoadTransition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LoadTransition_C>();
	}
};
static_assert(alignof(UWBP_LoadTransition_C) == 0x000010, "Wrong alignment on UWBP_LoadTransition_C");
static_assert(sizeof(UWBP_LoadTransition_C) == 0x000530, "Wrong size on UWBP_LoadTransition_C");
static_assert(offsetof(UWBP_LoadTransition_C, UberGraphFrame) == 0x0004E0, "Member 'UWBP_LoadTransition_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LoadTransition_C, Ani_fadeout_moment) == 0x0004E8, "Member 'UWBP_LoadTransition_C::Ani_fadeout_moment' has a wrong offset!");
static_assert(offsetof(UWBP_LoadTransition_C, Ani_fadein_moment) == 0x0004F0, "Member 'UWBP_LoadTransition_C::Ani_fadein_moment' has a wrong offset!");
static_assert(offsetof(UWBP_LoadTransition_C, Ani_fadeout_short) == 0x0004F8, "Member 'UWBP_LoadTransition_C::Ani_fadeout_short' has a wrong offset!");
static_assert(offsetof(UWBP_LoadTransition_C, Ani_fadein_short) == 0x000500, "Member 'UWBP_LoadTransition_C::Ani_fadein_short' has a wrong offset!");
static_assert(offsetof(UWBP_LoadTransition_C, Ani_fadeout) == 0x000508, "Member 'UWBP_LoadTransition_C::Ani_fadeout' has a wrong offset!");
static_assert(offsetof(UWBP_LoadTransition_C, Ani_fadein) == 0x000510, "Member 'UWBP_LoadTransition_C::Ani_fadein' has a wrong offset!");
static_assert(offsetof(UWBP_LoadTransition_C, _bgTexture) == 0x000518, "Member 'UWBP_LoadTransition_C::_bgTexture' has a wrong offset!");
static_assert(offsetof(UWBP_LoadTransition_C, Background_2) == 0x000520, "Member 'UWBP_LoadTransition_C::Background_2' has a wrong offset!");
static_assert(offsetof(UWBP_LoadTransition_C, Text_bg) == 0x000528, "Member 'UWBP_LoadTransition_C::Text_bg' has a wrong offset!");

}

