#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EmptyWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UIFramework_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EmptyWindow.WBP_EmptyWindow_C
// 0x0040 (0x0520 - 0x04E0)
class UWBP_EmptyWindow_C final : public UWidgetGeneralEmptyWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_out;                                           // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Idle;                                          // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_in;                                            // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_319;                                     // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundAtomCue*                          OpenAtomCue;                                       // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          CloseAtomCue;                                      // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          CancelAtomCue;                                     // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_EmptyWindow(int32 EntryPoint);
	void OnPlayCancelSound();
	void PlayCloseSE();
	void PlayOpenSE();
	void SequenceEvent__ENTRYPOINTWBP_EmptyWindow_0();
	void SequenceEvent__ENTRYPOINTWBP_EmptyWindow_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_EmptyWindow_C">();
	}
	static class UWBP_EmptyWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EmptyWindow_C>();
	}
};
static_assert(alignof(UWBP_EmptyWindow_C) == 0x000008, "Wrong alignment on UWBP_EmptyWindow_C");
static_assert(sizeof(UWBP_EmptyWindow_C) == 0x000520, "Wrong size on UWBP_EmptyWindow_C");
static_assert(offsetof(UWBP_EmptyWindow_C, UberGraphFrame) == 0x0004E0, "Member 'UWBP_EmptyWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_EmptyWindow_C, Ani_out) == 0x0004E8, "Member 'UWBP_EmptyWindow_C::Ani_out' has a wrong offset!");
static_assert(offsetof(UWBP_EmptyWindow_C, Ani_Idle) == 0x0004F0, "Member 'UWBP_EmptyWindow_C::Ani_Idle' has a wrong offset!");
static_assert(offsetof(UWBP_EmptyWindow_C, Ani_in) == 0x0004F8, "Member 'UWBP_EmptyWindow_C::Ani_in' has a wrong offset!");
static_assert(offsetof(UWBP_EmptyWindow_C, NamedSlot_319) == 0x000500, "Member 'UWBP_EmptyWindow_C::NamedSlot_319' has a wrong offset!");
static_assert(offsetof(UWBP_EmptyWindow_C, OpenAtomCue) == 0x000508, "Member 'UWBP_EmptyWindow_C::OpenAtomCue' has a wrong offset!");
static_assert(offsetof(UWBP_EmptyWindow_C, CloseAtomCue) == 0x000510, "Member 'UWBP_EmptyWindow_C::CloseAtomCue' has a wrong offset!");
static_assert(offsetof(UWBP_EmptyWindow_C, CancelAtomCue) == 0x000518, "Member 'UWBP_EmptyWindow_C::CancelAtomCue' has a wrong offset!");

}

