#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GeneralButton

#include "Basic.hpp"

#include "UIFramework_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GeneralButton.WBP_GeneralButton_C
// 0x0050 (0x04D8 - 0x0488)
class UWBP_GeneralButton_C final : public UWidgetButton
{
public:
	class UWidgetAnimation*                       Ani_ReleaseShortcut;                               // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_PressShortcut;                                 // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Negative;                                      // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_FocusEnd;                                      // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Default;                                       // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Release;                                       // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Press;                                         // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_FocusLoop;                                     // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_FocusBegin;                                    // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UNamedSlot*                             Body;                                              // 0x04D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GeneralButton_C">();
	}
	static class UWBP_GeneralButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GeneralButton_C>();
	}
};
static_assert(alignof(UWBP_GeneralButton_C) == 0x000008, "Wrong alignment on UWBP_GeneralButton_C");
static_assert(sizeof(UWBP_GeneralButton_C) == 0x0004D8, "Wrong size on UWBP_GeneralButton_C");
static_assert(offsetof(UWBP_GeneralButton_C, Ani_ReleaseShortcut) == 0x000488, "Member 'UWBP_GeneralButton_C::Ani_ReleaseShortcut' has a wrong offset!");
static_assert(offsetof(UWBP_GeneralButton_C, Ani_PressShortcut) == 0x000490, "Member 'UWBP_GeneralButton_C::Ani_PressShortcut' has a wrong offset!");
static_assert(offsetof(UWBP_GeneralButton_C, Ani_Negative) == 0x000498, "Member 'UWBP_GeneralButton_C::Ani_Negative' has a wrong offset!");
static_assert(offsetof(UWBP_GeneralButton_C, Ani_FocusEnd) == 0x0004A0, "Member 'UWBP_GeneralButton_C::Ani_FocusEnd' has a wrong offset!");
static_assert(offsetof(UWBP_GeneralButton_C, Ani_Default) == 0x0004A8, "Member 'UWBP_GeneralButton_C::Ani_Default' has a wrong offset!");
static_assert(offsetof(UWBP_GeneralButton_C, Ani_Release) == 0x0004B0, "Member 'UWBP_GeneralButton_C::Ani_Release' has a wrong offset!");
static_assert(offsetof(UWBP_GeneralButton_C, Ani_Press) == 0x0004B8, "Member 'UWBP_GeneralButton_C::Ani_Press' has a wrong offset!");
static_assert(offsetof(UWBP_GeneralButton_C, Ani_FocusLoop) == 0x0004C0, "Member 'UWBP_GeneralButton_C::Ani_FocusLoop' has a wrong offset!");
static_assert(offsetof(UWBP_GeneralButton_C, Ani_FocusBegin) == 0x0004C8, "Member 'UWBP_GeneralButton_C::Ani_FocusBegin' has a wrong offset!");
static_assert(offsetof(UWBP_GeneralButton_C, Body) == 0x0004D0, "Member 'UWBP_GeneralButton_C::Body' has a wrong offset!");

}

