#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WindowFrame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UIFramework_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_WindowFrame.WBP_WindowFrame_C
// 0x0048 (0x05C0 - 0x0578)
class UWBP_WindowFrame_C final : public UWidgetWindowFrame
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0578(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_out;                                           // 0x0580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Idle;                                          // 0x0588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_in;                                            // 0x0590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USpacer*                                Base1Spacer;                                       // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Base2Spacer;                                       // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_197;                                        // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             HeaderSlot;                                        // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         ButtonSize;                                        // 0x05B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ButtonSpaceSize;                                   // 0x05BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_WindowFrame(int32 EntryPoint);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void OnFinishedAni_In();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_WindowFrame_C">();
	}
	static class UWBP_WindowFrame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_WindowFrame_C>();
	}
};
static_assert(alignof(UWBP_WindowFrame_C) == 0x000008, "Wrong alignment on UWBP_WindowFrame_C");
static_assert(sizeof(UWBP_WindowFrame_C) == 0x0005C0, "Wrong size on UWBP_WindowFrame_C");
static_assert(offsetof(UWBP_WindowFrame_C, UberGraphFrame) == 0x000578, "Member 'UWBP_WindowFrame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_WindowFrame_C, Ani_out) == 0x000580, "Member 'UWBP_WindowFrame_C::Ani_out' has a wrong offset!");
static_assert(offsetof(UWBP_WindowFrame_C, Ani_Idle) == 0x000588, "Member 'UWBP_WindowFrame_C::Ani_Idle' has a wrong offset!");
static_assert(offsetof(UWBP_WindowFrame_C, Ani_in) == 0x000590, "Member 'UWBP_WindowFrame_C::Ani_in' has a wrong offset!");
static_assert(offsetof(UWBP_WindowFrame_C, Base1Spacer) == 0x000598, "Member 'UWBP_WindowFrame_C::Base1Spacer' has a wrong offset!");
static_assert(offsetof(UWBP_WindowFrame_C, Base2Spacer) == 0x0005A0, "Member 'UWBP_WindowFrame_C::Base2Spacer' has a wrong offset!");
static_assert(offsetof(UWBP_WindowFrame_C, Border_197) == 0x0005A8, "Member 'UWBP_WindowFrame_C::Border_197' has a wrong offset!");
static_assert(offsetof(UWBP_WindowFrame_C, HeaderSlot) == 0x0005B0, "Member 'UWBP_WindowFrame_C::HeaderSlot' has a wrong offset!");
static_assert(offsetof(UWBP_WindowFrame_C, ButtonSize) == 0x0005B8, "Member 'UWBP_WindowFrame_C::ButtonSize' has a wrong offset!");
static_assert(offsetof(UWBP_WindowFrame_C, ButtonSpaceSize) == 0x0005BC, "Member 'UWBP_WindowFrame_C::ButtonSpaceSize' has a wrong offset!");

}

