#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Gasha_OfferRatio_Cell

#include "Basic.hpp"

#include "OutGameModule_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Gasha_OfferRatio_Cell.WBP_Gasha_OfferRatio_Cell_C
// 0x0020 (0x0398 - 0x0378)
class UWBP_Gasha_OfferRatio_Cell_C final : public UGashaOfferRatioListCellWidget
{
public:
	class UImage*                                 Bottom;                                            // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Left;                                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Right;                                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Top;                                               // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Gasha_OfferRatio_Cell_C">();
	}
	static class UWBP_Gasha_OfferRatio_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Gasha_OfferRatio_Cell_C>();
	}
};
static_assert(alignof(UWBP_Gasha_OfferRatio_Cell_C) == 0x000008, "Wrong alignment on UWBP_Gasha_OfferRatio_Cell_C");
static_assert(sizeof(UWBP_Gasha_OfferRatio_Cell_C) == 0x000398, "Wrong size on UWBP_Gasha_OfferRatio_Cell_C");
static_assert(offsetof(UWBP_Gasha_OfferRatio_Cell_C, Bottom) == 0x000378, "Member 'UWBP_Gasha_OfferRatio_Cell_C::Bottom' has a wrong offset!");
static_assert(offsetof(UWBP_Gasha_OfferRatio_Cell_C, Left) == 0x000380, "Member 'UWBP_Gasha_OfferRatio_Cell_C::Left' has a wrong offset!");
static_assert(offsetof(UWBP_Gasha_OfferRatio_Cell_C, Right) == 0x000388, "Member 'UWBP_Gasha_OfferRatio_Cell_C::Right' has a wrong offset!");
static_assert(offsetof(UWBP_Gasha_OfferRatio_Cell_C, Top) == 0x000390, "Member 'UWBP_Gasha_OfferRatio_Cell_C::Top' has a wrong offset!");

}

