#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TextChatWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UIFramework_structs.hpp"
#include "GameModule_structs.hpp"
#include "GameModule_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "BykingUnrealModule_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TextChatWindow.WBP_TextChatWindow_C
// 0x0068 (0x04D0 - 0x0468)
class UWBP_TextChatWindow_C final : public UTextChatWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0468(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_PressShortcut;                                 // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Press;                                         // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_ChatSendButton_C*                  _ChatSendButton;                                   // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EmptyWindow_C*                     _windowWidget;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_362;                                         // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlatformRichTextBlock*                 PlatformRichTextBlock;                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           GuildColor;                                        // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TeamUpColor;                                       // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWidgetInputType                              _inputType;                                        // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            _preFocusWidget;                                   // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_TextChatWindow(int32 EntryPoint);
	void _onCallConcentEventDispather______0();
	void _onSendableDelegate______0(const bool Commit, EPlatform Platform);
	void _onFadeStartedDelegate______0();
	void OnSendEvent();
	void BndEvt__WBP_TextChatWindow__iconButton_K2Node_ComponentBoundEvent_7_OnInputEventDelegate__DelegateSignature(class UAppWidget* Widget, EWidgetInputType InputType);
	void BndEvt__WBP_TextChatWindow__iconButton_K2Node_ComponentBoundEvent_5_OnInputEventDelegate__DelegateSignature(class UAppWidget* Widget, EWidgetInputType InputType);
	void OpenAnimEvent();
	void CloseAnimEvent();
	void _UpdateArrayEvent();
	void BndEvt__WBP_TextChatWindow__iconButton_K2Node_ComponentBoundEvent_1_OnInputEventDelegate__DelegateSignature(class UAppWidget* Widget, EWidgetInputType InputType);
	void BndEvt__WBP_TextChatWindow__ChatSendButton_K2Node_ComponentBoundEvent_3_OnInputEventDelegate__DelegateSignature(class UAppWidget* Widget, EWidgetInputType InputType);
	void BndEvt__WBP_TextChatWindow__iconButton_K2Node_ComponentBoundEvent_0_OnInputEventDelegate__DelegateSignature(class UAppWidget* Widget, EWidgetInputType InputType);
	void SetActiveSendButton(bool IsSendable);
	void ClearText();
	void SetFocusInputTextBox();
	void BndEvt__WBP_TextChatWindow__ChatSendButton_K2Node_ComponentBoundEvent_2_OnInputEventDelegate__DelegateSignature(class UAppWidget* Widget, EWidgetInputType InputType);
	void SetActiveTextInput(bool Input);
	void OnChangeTextEvent(const class FText& Text, const bool IsEmpty);
	void OnAnimationStarted(const class UWidgetAnimation* Animation);
	void WindowClose(bool bPlaySound);
	void WindowOpen(bool bPlaySound);
	void RecieveMessageIconEvent();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void CheckTextEmpty(const class FText& Text, bool* NewParam);
	void SetUpColor(const struct FSlateColor& NewParam);
	void SetupList();
	struct FEventReply OnAnalogValueChanged(const struct FGeometry& MyGeometry, const struct FAnalogInputEvent& InAnalogInputEvent);
	void RequesetSendTeamUpChatTestCommand(const class FText& Message);
	void SetUpPreviousFocusWidgets();
	void SetFocusPreviousFocusWidgets();
	struct FEventReply OnMouseWheel(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void SetWidgetVisibility();
	void Open(bool PlaySound_0);
	void Close(bool PlaySound_0);
	class UWidget* CustomNavigationRight(EUINavigation Navigation_0);
	void ___p_0();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void SequenceEvent__ENTRYPOINTWBP_TextChatWindow_0();
	void SequenceEvent__ENTRYPOINTWBP_TextChatWindow_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TextChatWindow_C">();
	}
	static class UWBP_TextChatWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TextChatWindow_C>();
	}
};
static_assert(alignof(UWBP_TextChatWindow_C) == 0x000008, "Wrong alignment on UWBP_TextChatWindow_C");
static_assert(sizeof(UWBP_TextChatWindow_C) == 0x0004D0, "Wrong size on UWBP_TextChatWindow_C");
static_assert(offsetof(UWBP_TextChatWindow_C, UberGraphFrame) == 0x000468, "Member 'UWBP_TextChatWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TextChatWindow_C, Ani_PressShortcut) == 0x000470, "Member 'UWBP_TextChatWindow_C::Ani_PressShortcut' has a wrong offset!");
static_assert(offsetof(UWBP_TextChatWindow_C, Ani_Press) == 0x000478, "Member 'UWBP_TextChatWindow_C::Ani_Press' has a wrong offset!");
static_assert(offsetof(UWBP_TextChatWindow_C, _ChatSendButton) == 0x000480, "Member 'UWBP_TextChatWindow_C::_ChatSendButton' has a wrong offset!");
static_assert(offsetof(UWBP_TextChatWindow_C, _windowWidget) == 0x000488, "Member 'UWBP_TextChatWindow_C::_windowWidget' has a wrong offset!");
static_assert(offsetof(UWBP_TextChatWindow_C, Image_362) == 0x000490, "Member 'UWBP_TextChatWindow_C::Image_362' has a wrong offset!");
static_assert(offsetof(UWBP_TextChatWindow_C, PlatformRichTextBlock) == 0x000498, "Member 'UWBP_TextChatWindow_C::PlatformRichTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_TextChatWindow_C, GuildColor) == 0x0004A0, "Member 'UWBP_TextChatWindow_C::GuildColor' has a wrong offset!");
static_assert(offsetof(UWBP_TextChatWindow_C, TeamUpColor) == 0x0004B0, "Member 'UWBP_TextChatWindow_C::TeamUpColor' has a wrong offset!");
static_assert(offsetof(UWBP_TextChatWindow_C, _inputType) == 0x0004C0, "Member 'UWBP_TextChatWindow_C::_inputType' has a wrong offset!");
static_assert(offsetof(UWBP_TextChatWindow_C, _preFocusWidget) == 0x0004C8, "Member 'UWBP_TextChatWindow_C::_preFocusWidget' has a wrong offset!");

}

