#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DevelopMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_DevelopMenu.WBP_DevelopMenu_C.ExecuteUbergraph_WBP_DevelopMenu
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_GetAllWidgetsWithInterface_FoundWidgets;  // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DipInterface_C>   K2Node_DynamicCast_AsBPI_Dip_Interface;            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x003C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu) == 0x000008, "Wrong alignment on WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu");
static_assert(sizeof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu) == 0x0000B8, "Wrong size on WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, EntryPoint) == 0x000000, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, CallFunc_GetAllWidgetsWithInterface_FoundWidgets) == 0x000008, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::CallFunc_GetAllWidgetsWithInterface_FoundWidgets' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, K2Node_DynamicCast_AsBPI_Dip_Interface) == 0x000028, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::K2Node_DynamicCast_AsBPI_Dip_Interface' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, K2Node_Event_MyGeometry) == 0x00003C, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, K2Node_Event_InDeltaTime) == 0x000074, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, CallFunc_Add_FloatFloat_ReturnValue) == 0x000078, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, CallFunc_Not_PreBool_ReturnValue) == 0x00007C, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, CallFunc_BooleanAND_ReturnValue) == 0x00007D, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, K2Node_Event_IsDesignTime) == 0x00007E, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00007F, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000080, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000088, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000090, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000094, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000098, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000A0, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0000A4, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, CallFunc_BooleanAND_ReturnValue_1) == 0x0000A8, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, Temp_int_Loop_Counter_Variable) == 0x0000AC, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu, CallFunc_Add_IntInt_ReturnValue) == 0x0000B4, "Member 'WBP_DevelopMenu_C_ExecuteUbergraph_WBP_DevelopMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_DevelopMenu.WBP_DevelopMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_DevelopMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DevelopMenu_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_DevelopMenu_C_PreConstruct");
static_assert(sizeof(WBP_DevelopMenu_C_PreConstruct) == 0x000001, "Wrong size on WBP_DevelopMenu_C_PreConstruct");
static_assert(offsetof(WBP_DevelopMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_DevelopMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_DevelopMenu.WBP_DevelopMenu_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_DevelopMenu_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DevelopMenu_C_Tick) == 0x000004, "Wrong alignment on WBP_DevelopMenu_C_Tick");
static_assert(sizeof(WBP_DevelopMenu_C_Tick) == 0x00003C, "Wrong size on WBP_DevelopMenu_C_Tick");
static_assert(offsetof(WBP_DevelopMenu_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_DevelopMenu_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_DevelopMenu_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_DevelopMenu.WBP_DevelopMenu_C.OnKeyDown
// 0x0200 (0x0200 - 0x0000)
struct WBP_DevelopMenu_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0128(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0148(0x00B8)()
};
static_assert(alignof(WBP_DevelopMenu_C_OnKeyDown) == 0x000008, "Wrong alignment on WBP_DevelopMenu_C_OnKeyDown");
static_assert(sizeof(WBP_DevelopMenu_C_OnKeyDown) == 0x000200, "Wrong size on WBP_DevelopMenu_C_OnKeyDown");
static_assert(offsetof(WBP_DevelopMenu_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'WBP_DevelopMenu_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'WBP_DevelopMenu_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'WBP_DevelopMenu_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000128, "Member 'WBP_DevelopMenu_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000140, "Member 'WBP_DevelopMenu_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000141, "Member 'WBP_DevelopMenu_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000148, "Member 'WBP_DevelopMenu_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_DevelopMenu.WBP_DevelopMenu_C.OnKeyUp
// 0x0200 (0x0200 - 0x0000)
struct WBP_DevelopMenu_C_OnKeyUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0128(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0148(0x00B8)()
};
static_assert(alignof(WBP_DevelopMenu_C_OnKeyUp) == 0x000008, "Wrong alignment on WBP_DevelopMenu_C_OnKeyUp");
static_assert(sizeof(WBP_DevelopMenu_C_OnKeyUp) == 0x000200, "Wrong size on WBP_DevelopMenu_C_OnKeyUp");
static_assert(offsetof(WBP_DevelopMenu_C_OnKeyUp, MyGeometry) == 0x000000, "Member 'WBP_DevelopMenu_C_OnKeyUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_OnKeyUp, InKeyEvent) == 0x000038, "Member 'WBP_DevelopMenu_C_OnKeyUp::InKeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_OnKeyUp, ReturnValue) == 0x000070, "Member 'WBP_DevelopMenu_C_OnKeyUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_OnKeyUp, CallFunc_GetKey_ReturnValue) == 0x000128, "Member 'WBP_DevelopMenu_C_OnKeyUp::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000140, "Member 'WBP_DevelopMenu_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000141, "Member 'WBP_DevelopMenu_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_OnKeyUp, CallFunc_Handled_ReturnValue) == 0x000148, "Member 'WBP_DevelopMenu_C_OnKeyUp::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_DevelopMenu.WBP_DevelopMenu_C.SetupButton
// 0x0620 (0x0620 - 0x0000)
struct WBP_DevelopMenu_C_SetupButton final
{
public:
	class UButton*                                TargetButton;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MaterialInstance;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x00E0(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_2;                    // 0x01B0(0x00D0)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle;                     // 0x0280(0x03A0)()
};
static_assert(alignof(WBP_DevelopMenu_C_SetupButton) == 0x000010, "Wrong alignment on WBP_DevelopMenu_C_SetupButton");
static_assert(sizeof(WBP_DevelopMenu_C_SetupButton) == 0x000620, "Wrong size on WBP_DevelopMenu_C_SetupButton");
static_assert(offsetof(WBP_DevelopMenu_C_SetupButton, TargetButton) == 0x000000, "Member 'WBP_DevelopMenu_C_SetupButton::TargetButton' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_SetupButton, MaterialInstance) == 0x000008, "Member 'WBP_DevelopMenu_C_SetupButton::MaterialInstance' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_SetupButton, K2Node_MakeStruct_SlateBrush) == 0x000010, "Member 'WBP_DevelopMenu_C_SetupButton::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_SetupButton, K2Node_MakeStruct_SlateBrush_1) == 0x0000E0, "Member 'WBP_DevelopMenu_C_SetupButton::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_SetupButton, K2Node_MakeStruct_SlateBrush_2) == 0x0001B0, "Member 'WBP_DevelopMenu_C_SetupButton::K2Node_MakeStruct_SlateBrush_2' has a wrong offset!");
static_assert(offsetof(WBP_DevelopMenu_C_SetupButton, K2Node_MakeStruct_ButtonStyle) == 0x000280, "Member 'WBP_DevelopMenu_C_SetupButton::K2Node_MakeStruct_ButtonStyle' has a wrong offset!");

}

