#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputTextBox

#include "Basic.hpp"

#include "UIFramework_structs.hpp"
#include "SlateCore_structs.hpp"
#include "BykingUnrealModule_structs.hpp"


namespace SDK::Params
{

// Function WBP_InputTextBox.WBP_InputTextBox_C.ExecuteUbergraph_WBP_InputTextBox
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppWidget*                             K2Node_CustomEvent_Widget;                         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWidgetInputType                              K2Node_CustomEvent_inputType;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0028(0x0018)()
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0040(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_CheckMessageEmpty_ReturnValue;         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_CheckMessageEmpty_ReturnValue_1;       // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_CheckMessageEmpty_ReturnValue_2;       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlatformSubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlatformSubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlatform                                     CallFunc_GetPlatform_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlatform                                     CallFunc_GetPlatform_ReturnValue_1;                // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlatformSubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetSteamGamePadInputText_ReturnValue;     // 0x00C0(0x0018)()
	TDelegate<void(bool bFlag)>                   K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	struct FOnGamePadTextInputDismissed           K2Node_MakeStruct_OnGamePadTextInputDismissed;     // 0x00E8(0x0010)(NoDestructor, ContainsInstancedReference)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x00F8(0x0018)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_CheckMessageEmpty_ReturnValue_3;       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_flag;                           // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0138(0x0018)()
	class UPlatformSubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlatformSubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShowSteamGamePadTextInput_ReturnValue;    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlatform                                     CallFunc_GetPlatform_ReturnValue_2;                // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EPlatform                                     CallFunc_GetPlatform_ReturnValue_3;                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x2];                                      // 0x01A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAppWidget* Widget, EWidgetInputType InputType)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x01A4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasFocusedDescendants_ReturnValue;        // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_CheckFirstFocus_ReturnValue;           // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox) == 0x000008, "Wrong alignment on WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox");
static_assert(sizeof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox) == 0x0001B8, "Wrong size on WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, EntryPoint) == 0x000000, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, K2Node_CustomEvent_Widget) == 0x000018, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::K2Node_CustomEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, K2Node_CustomEvent_inputType) == 0x000020, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::K2Node_CustomEvent_inputType' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, K2Node_CustomEvent_InText) == 0x000028, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, K2Node_ComponentBoundEvent_Text_1) == 0x000040, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, K2Node_ComponentBoundEvent_CommitMethod) == 0x000058, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, K2Node_SwitchEnum_CmpSuccess) == 0x000059, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_Conv_TextToString_ReturnValue) == 0x000060, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000070, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_BP_CheckMessageEmpty_ReturnValue) == 0x000080, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_BP_CheckMessageEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_BP_CheckMessageEmpty_ReturnValue_1) == 0x000081, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_BP_CheckMessageEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000088, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_BP_CheckMessageEmpty_ReturnValue_2) == 0x000098, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_BP_CheckMessageEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000A0, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0000A8, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_GetPlatform_ReturnValue) == 0x0000B0, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_GetPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_GetPlatform_ReturnValue_1) == 0x0000B1, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_GetPlatform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x0000B8, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_GetSteamGamePadInputText_ReturnValue) == 0x0000C0, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_GetSteamGamePadInputText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D8, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, K2Node_MakeStruct_OnGamePadTextInputDismissed) == 0x0000E8, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::K2Node_MakeStruct_OnGamePadTextInputDismissed' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, K2Node_ComponentBoundEvent_Text) == 0x0000F8, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_Conv_TextToString_ReturnValue_3) == 0x000110, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_Conv_TextToString_ReturnValue_4) == 0x000120, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_Conv_TextToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_BP_CheckMessageEmpty_ReturnValue_3) == 0x000130, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_BP_CheckMessageEmpty_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, K2Node_Event_IsDesignTime) == 0x000131, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, K2Node_CustomEvent_flag) == 0x000132, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::K2Node_CustomEvent_flag' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_GetText_ReturnValue) == 0x000138, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000150, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000158, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_ShowSteamGamePadTextInput_ReturnValue) == 0x000160, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_ShowSteamGamePadTextInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_GetPlatform_ReturnValue_2) == 0x000161, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_GetPlatform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_Conv_BoolToString_ReturnValue) == 0x000168, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000178, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_Concat_StrStr_ReturnValue) == 0x000180, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000190, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_GetPlatform_ReturnValue_3) == 0x0001A0, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_GetPlatform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001A1, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001A4, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_HasFocusedDescendants_ReturnValue) == 0x0001B4, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_HasFocusedDescendants_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox, CallFunc_BP_CheckFirstFocus_ReturnValue) == 0x0001B5, "Member 'WBP_InputTextBox_C_ExecuteUbergraph_WBP_InputTextBox::CallFunc_BP_CheckFirstFocus_ReturnValue' has a wrong offset!");

// Function WBP_InputTextBox.WBP_InputTextBox_C.OnShowSteamGamePadTextInputEvent
// 0x0001 (0x0001 - 0x0000)
struct WBP_InputTextBox_C_OnShowSteamGamePadTextInputEvent final
{
public:
	bool                                          Flag;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_InputTextBox_C_OnShowSteamGamePadTextInputEvent) == 0x000001, "Wrong alignment on WBP_InputTextBox_C_OnShowSteamGamePadTextInputEvent");
static_assert(sizeof(WBP_InputTextBox_C_OnShowSteamGamePadTextInputEvent) == 0x000001, "Wrong size on WBP_InputTextBox_C_OnShowSteamGamePadTextInputEvent");
static_assert(offsetof(WBP_InputTextBox_C_OnShowSteamGamePadTextInputEvent, Flag) == 0x000000, "Member 'WBP_InputTextBox_C_OnShowSteamGamePadTextInputEvent::Flag' has a wrong offset!");

// Function WBP_InputTextBox.WBP_InputTextBox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_InputTextBox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_InputTextBox_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_InputTextBox_C_PreConstruct");
static_assert(sizeof(WBP_InputTextBox_C_PreConstruct) == 0x000001, "Wrong size on WBP_InputTextBox_C_PreConstruct");
static_assert(offsetof(WBP_InputTextBox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_InputTextBox_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_InputTextBox.WBP_InputTextBox_C.BndEvt__WBP_InputTextBox__textBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_InputTextBox_C_BndEvt__WBP_InputTextBox__textBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text_0;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_InputTextBox_C_BndEvt__WBP_InputTextBox__textBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InputTextBox_C_BndEvt__WBP_InputTextBox__textBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_InputTextBox_C_BndEvt__WBP_InputTextBox__textBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_InputTextBox_C_BndEvt__WBP_InputTextBox__textBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_InputTextBox_C_BndEvt__WBP_InputTextBox__textBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature, Text_0) == 0x000000, "Member 'WBP_InputTextBox_C_BndEvt__WBP_InputTextBox__textBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature::Text_0' has a wrong offset!");

// Function WBP_InputTextBox.WBP_InputTextBox_C.BndEvt__WBP_GuildSearchInputText_TextBoxGuildId_1_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_InputTextBox_C_BndEvt__WBP_GuildSearchInputText_TextBoxGuildId_1_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text_0;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputTextBox_C_BndEvt__WBP_GuildSearchInputText_TextBoxGuildId_1_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InputTextBox_C_BndEvt__WBP_GuildSearchInputText_TextBoxGuildId_1_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_InputTextBox_C_BndEvt__WBP_GuildSearchInputText_TextBoxGuildId_1_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on WBP_InputTextBox_C_BndEvt__WBP_GuildSearchInputText_TextBoxGuildId_1_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_InputTextBox_C_BndEvt__WBP_GuildSearchInputText_TextBoxGuildId_1_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature, Text_0) == 0x000000, "Member 'WBP_InputTextBox_C_BndEvt__WBP_GuildSearchInputText_TextBoxGuildId_1_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature::Text_0' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_BndEvt__WBP_GuildSearchInputText_TextBoxGuildId_1_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'WBP_InputTextBox_C_BndEvt__WBP_GuildSearchInputText_TextBoxGuildId_1_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_InputTextBox.WBP_InputTextBox_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct WBP_InputTextBox_C_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_InputTextBox_C_SetText) == 0x000008, "Wrong alignment on WBP_InputTextBox_C_SetText");
static_assert(sizeof(WBP_InputTextBox_C_SetText) == 0x000018, "Wrong size on WBP_InputTextBox_C_SetText");
static_assert(offsetof(WBP_InputTextBox_C_SetText, InText) == 0x000000, "Member 'WBP_InputTextBox_C_SetText::InText' has a wrong offset!");

// Function WBP_InputTextBox.WBP_InputTextBox_C.DecideEvent
// 0x0010 (0x0010 - 0x0000)
struct WBP_InputTextBox_C_DecideEvent final
{
public:
	class UAppWidget*                             Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWidgetInputType                              InputType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputTextBox_C_DecideEvent) == 0x000008, "Wrong alignment on WBP_InputTextBox_C_DecideEvent");
static_assert(sizeof(WBP_InputTextBox_C_DecideEvent) == 0x000010, "Wrong size on WBP_InputTextBox_C_DecideEvent");
static_assert(offsetof(WBP_InputTextBox_C_DecideEvent, Widget) == 0x000000, "Member 'WBP_InputTextBox_C_DecideEvent::Widget' has a wrong offset!");
static_assert(offsetof(WBP_InputTextBox_C_DecideEvent, InputType) == 0x000008, "Member 'WBP_InputTextBox_C_DecideEvent::InputType' has a wrong offset!");

}

