#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"
#include "MasterDataModule_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu.WBP_Menu_C
// 0x00F8 (0x0370 - 0x0278)
class UWBP_Menu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                ButtonClose;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonDeinitialize;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonInitialize;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonReCopy;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonReDownload;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageMenuBg;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBoxMenu;                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListView*                              ListTableName;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableTextBox*              TextBoxAllJson;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextCodeVersion;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextDatabasePath;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextDataVersion;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextInitialized;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLanguage;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextPassword;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextSrcFilePath;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EntryItemTableName_C*              As_WBP_Entry_Item_Table_Name;                      // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FSlateColor                            In_Color_and_Opacity_Black;                        // 0x0308(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            In_Color_and_Opacity_Red;                          // 0x0330(0x0028)(Edit, BlueprintVisible)
	class UWBP_Menu_C*                            Widget;                                            // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewIndex;                                          // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Item;                                              // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu(int32 EntryPoint);
	void PadTableListDown();
	void PadTableListUp();
	void PadTableSelect();
	void PadClose();
	void PadReDownload();
	void PadReCopy();
	void PadDeInitialize();
	void PadInitialize();
	void CompleteDownloadEvent();
	void BndEvt__ButtonClose_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ButtonReDownload_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ButtonReCopy_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ButtonDeinitialize_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ButtonInitialize_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ListTableName_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item_0);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetTextsFunction();
	void SetTableNamesFunction();
	void Get_Selected_Index(int32* Index_0);
	void ToTableNameString(class UObject* EntryItem, class FString* TableName);
	void SetAllJson(const class FString& TableName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_C">();
	}
	static class UWBP_Menu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_C>();
	}
};
static_assert(alignof(UWBP_Menu_C) == 0x000008, "Wrong alignment on UWBP_Menu_C");
static_assert(sizeof(UWBP_Menu_C) == 0x000370, "Wrong size on UWBP_Menu_C");
static_assert(offsetof(UWBP_Menu_C, UberGraphFrame) == 0x000278, "Member 'UWBP_Menu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, ButtonClose) == 0x000280, "Member 'UWBP_Menu_C::ButtonClose' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, ButtonDeinitialize) == 0x000288, "Member 'UWBP_Menu_C::ButtonDeinitialize' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, ButtonInitialize) == 0x000290, "Member 'UWBP_Menu_C::ButtonInitialize' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, ButtonReCopy) == 0x000298, "Member 'UWBP_Menu_C::ButtonReCopy' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, ButtonReDownload) == 0x0002A0, "Member 'UWBP_Menu_C::ButtonReDownload' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, ImageMenuBg) == 0x0002A8, "Member 'UWBP_Menu_C::ImageMenuBg' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, InvalidationBoxMenu) == 0x0002B0, "Member 'UWBP_Menu_C::InvalidationBoxMenu' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, ListTableName) == 0x0002B8, "Member 'UWBP_Menu_C::ListTableName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, TextBoxAllJson) == 0x0002C0, "Member 'UWBP_Menu_C::TextBoxAllJson' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, TextCodeVersion) == 0x0002C8, "Member 'UWBP_Menu_C::TextCodeVersion' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, TextDatabasePath) == 0x0002D0, "Member 'UWBP_Menu_C::TextDatabasePath' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, TextDataVersion) == 0x0002D8, "Member 'UWBP_Menu_C::TextDataVersion' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, TextInitialized) == 0x0002E0, "Member 'UWBP_Menu_C::TextInitialized' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, TextLanguage) == 0x0002E8, "Member 'UWBP_Menu_C::TextLanguage' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, TextPassword) == 0x0002F0, "Member 'UWBP_Menu_C::TextPassword' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, TextSrcFilePath) == 0x0002F8, "Member 'UWBP_Menu_C::TextSrcFilePath' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, As_WBP_Entry_Item_Table_Name) == 0x000300, "Member 'UWBP_Menu_C::As_WBP_Entry_Item_Table_Name' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, In_Color_and_Opacity_Black) == 0x000308, "Member 'UWBP_Menu_C::In_Color_and_Opacity_Black' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, In_Color_and_Opacity_Red) == 0x000330, "Member 'UWBP_Menu_C::In_Color_and_Opacity_Red' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, Widget) == 0x000358, "Member 'UWBP_Menu_C::Widget' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, Index_0) == 0x000360, "Member 'UWBP_Menu_C::Index_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, NewIndex) == 0x000364, "Member 'UWBP_Menu_C::NewIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_C, Item) == 0x000368, "Member 'UWBP_Menu_C::Item' has a wrong offset!");

}

