#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TeamCommentaryMessages

#include "Basic.hpp"

#include "GameModule_structs.hpp"


namespace SDK::Params
{

// Function WBP_TeamCommentaryMessages.WBP_TeamCommentaryMessages_C.ExecuteUbergraph_WBP_TeamCommentaryMessages
// 0x0050 (0x0050 - 0x0000)
struct WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPlayMenuWidget*>                CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPlayMenuWidget*                        CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamCommentaryMessage                        K2Node_Event_messageType;                          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetOpenSubLevel_ReturnValue;              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMainMenuWidget*>                CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMainMenuWidget*                        CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTabIndex_ReturnValue;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages) == 0x000008, "Wrong alignment on WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages");
static_assert(sizeof(WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages) == 0x000050, "Wrong size on WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages");
static_assert(offsetof(WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages, EntryPoint) == 0x000000, "Member 'WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000008, "Member 'WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages, K2Node_Event_messageType) == 0x000020, "Member 'WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages::K2Node_Event_messageType' has a wrong offset!");
static_assert(offsetof(WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages, K2Node_SwitchEnum_CmpSuccess) == 0x000022, "Member 'WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages, CallFunc_GetOpenSubLevel_ReturnValue) == 0x000023, "Member 'WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages::CallFunc_GetOpenSubLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages, CallFunc_GetAllWidgetsOfClass_FoundWidgets_1) == 0x000028, "Member 'WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages::CallFunc_GetAllWidgetsOfClass_FoundWidgets_1' has a wrong offset!");
static_assert(offsetof(WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages, CallFunc_GetTabIndex_ReturnValue) == 0x000044, "Member 'WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages::CallFunc_GetTabIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000048, "Member 'WBP_TeamCommentaryMessages_C_ExecuteUbergraph_WBP_TeamCommentaryMessages::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_TeamCommentaryMessages.WBP_TeamCommentaryMessages_C.OnRequestMessage
// 0x0001 (0x0001 - 0x0000)
struct WBP_TeamCommentaryMessages_C_OnRequestMessage final
{
public:
	ETeamCommentaryMessage                        MessageType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TeamCommentaryMessages_C_OnRequestMessage) == 0x000001, "Wrong alignment on WBP_TeamCommentaryMessages_C_OnRequestMessage");
static_assert(sizeof(WBP_TeamCommentaryMessages_C_OnRequestMessage) == 0x000001, "Wrong size on WBP_TeamCommentaryMessages_C_OnRequestMessage");
static_assert(offsetof(WBP_TeamCommentaryMessages_C_OnRequestMessage, MessageType) == 0x000000, "Member 'WBP_TeamCommentaryMessages_C_OnRequestMessage::MessageType' has a wrong offset!");

}

