#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu

#include "Basic.hpp"

#include "MasterDataModule_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu.WBP_Menu_C.ExecuteUbergraph_WBP_Menu
// 0x0180 (0x0180 - 0x0000)
struct WBP_Menu_C_ExecuteUbergraph_WBP_Menu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ToTableNameString_TableName;              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0030(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDebugMenuMasterData*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AKeyNotifyPawn_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMasterDataInitialized_ReturnValue;      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDebugMenuMasterData*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Get_Selected_Index_Index;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ToTableNameString_TableName_1;            // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Get_Selected_Index_Index_1;               // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0110(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue_1;               // 0x0128(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue_1;         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ToTableNameString_TableName_2;            // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue_2;         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ToTableNameString_TableName_3;            // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu) == 0x000010, "Wrong alignment on WBP_Menu_C_ExecuteUbergraph_WBP_Menu");
static_assert(sizeof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu) == 0x000180, "Wrong size on WBP_Menu_C_ExecuteUbergraph_WBP_Menu");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, EntryPoint) == 0x000000, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, K2Node_ComponentBoundEvent_Item) == 0x000018, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_ToTableNameString_TableName) == 0x000020, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_ToTableNameString_TableName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, K2Node_Event_MyGeometry) == 0x000030, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, K2Node_Event_InDeltaTime) == 0x000068, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, K2Node_Event_IsDesignTime) == 0x00006C, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, Temp_int_Variable) == 0x000070, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_GetPlayerController_ReturnValue) == 0x000078, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_IsMasterDataInitialized_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_IsMasterDataInitialized_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x0000D0, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, Temp_int_Variable_1) == 0x0000D8, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, Temp_int_Variable_2) == 0x0000DC, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_Get_Selected_Index_Index) == 0x0000E8, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_Get_Selected_Index_Index' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_ToTableNameString_TableName_1) == 0x0000F0, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_ToTableNameString_TableName_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_Add_IntInt_ReturnValue) == 0x000100, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_Get_Selected_Index_Index_1) == 0x000104, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_Get_Selected_Index_Index_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_Subtract_IntInt_ReturnValue) == 0x000108, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_GetListItems_ReturnValue) == 0x000110, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_GetListItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000120, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_GetListItems_ReturnValue_1) == 0x000128, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_GetListItems_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000138, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_BP_GetSelectedItem_ReturnValue_1) == 0x000140, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_BP_GetSelectedItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_ToTableNameString_TableName_2) == 0x000148, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_ToTableNameString_TableName_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_GetNumItems_ReturnValue) == 0x000158, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00015C, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_BP_GetSelectedItem_ReturnValue_2) == 0x000160, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_BP_GetSelectedItem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ExecuteUbergraph_WBP_Menu, CallFunc_ToTableNameString_TableName_3) == 0x000168, "Member 'WBP_Menu_C_ExecuteUbergraph_WBP_Menu::CallFunc_ToTableNameString_TableName_3' has a wrong offset!");

// Function WBP_Menu.WBP_Menu_C.BndEvt__ListTableName_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_C_BndEvt__ListTableName_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_C_BndEvt__ListTableName_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_C_BndEvt__ListTableName_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature");
static_assert(sizeof(WBP_Menu_C_BndEvt__ListTableName_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_Menu_C_BndEvt__ListTableName_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature");
static_assert(offsetof(WBP_Menu_C_BndEvt__ListTableName_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature, Item_0) == 0x000000, "Member 'WBP_Menu_C_BndEvt__ListTableName_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature::Item_0' has a wrong offset!");

// Function WBP_Menu.WBP_Menu_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Menu_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_C_Tick) == 0x000004, "Wrong alignment on WBP_Menu_C_Tick");
static_assert(sizeof(WBP_Menu_C_Tick) == 0x00003C, "Wrong size on WBP_Menu_C_Tick");
static_assert(offsetof(WBP_Menu_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Menu_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_Menu_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Menu.WBP_Menu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Menu_C_PreConstruct");
static_assert(sizeof(WBP_Menu_C_PreConstruct) == 0x000001, "Wrong size on WBP_Menu_C_PreConstruct");
static_assert(offsetof(WBP_Menu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Menu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Menu.WBP_Menu_C.SetTextsFunction
// 0x0150 (0x0150 - 0x0000)
struct WBP_Menu_C_SetTextsFunction final
{
public:
	class UDebugMenuMasterData*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMdLocalization                               CallFunc_GetLanguage_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDatabasePassword_ReturnValue;          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0048(0x0018)()
	class FString                                 CallFunc_GetModuleCodeVersion_ReturnValue;         // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDataFileVersion_ReturnValue;           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0080(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0098(0x0018)()
	class FString                                 CallFunc_GetDatabaseFilePath_ReturnValue;          // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x00D0(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x0108(0x0018)()
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSourceFilePath_ReturnValue;            // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_6;          // 0x0138(0x0018)()
};
static_assert(alignof(WBP_Menu_C_SetTextsFunction) == 0x000008, "Wrong alignment on WBP_Menu_C_SetTextsFunction");
static_assert(sizeof(WBP_Menu_C_SetTextsFunction) == 0x000150, "Wrong size on WBP_Menu_C_SetTextsFunction");
static_assert(offsetof(WBP_Menu_C_SetTextsFunction, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000000, "Member 'WBP_Menu_C_SetTextsFunction::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTextsFunction, CallFunc_GetLanguage_ReturnValue) == 0x000008, "Member 'WBP_Menu_C_SetTextsFunction::CallFunc_GetLanguage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTextsFunction, CallFunc_GetDatabasePassword_ReturnValue) == 0x000010, "Member 'WBP_Menu_C_SetTextsFunction::CallFunc_GetDatabasePassword_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTextsFunction, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000020, "Member 'WBP_Menu_C_SetTextsFunction::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTextsFunction, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'WBP_Menu_C_SetTextsFunction::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTextsFunction, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000048, "Member 'WBP_Menu_C_SetTextsFunction::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTextsFunction, CallFunc_GetModuleCodeVersion_ReturnValue) == 0x000060, "Member 'WBP_Menu_C_SetTextsFunction::CallFunc_GetModuleCodeVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTextsFunction, CallFunc_GetDataFileVersion_ReturnValue) == 0x000070, "Member 'WBP_Menu_C_SetTextsFunction::CallFunc_GetDataFileVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTextsFunction, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000080, "Member 'WBP_Menu_C_SetTextsFunction::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTextsFunction, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000098, "Member 'WBP_Menu_C_SetTextsFunction::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTextsFunction, CallFunc_GetDatabaseFilePath_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_C_SetTextsFunction::CallFunc_GetDatabaseFilePath_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTextsFunction, CallFunc_Conv_TextToString_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_C_SetTextsFunction::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTextsFunction, CallFunc_Conv_StringToText_ReturnValue_4) == 0x0000D0, "Member 'WBP_Menu_C_SetTextsFunction::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTextsFunction, CallFunc_Concat_StrStr_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_C_SetTextsFunction::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTextsFunction, CallFunc_Left_ReturnValue) == 0x0000F8, "Member 'WBP_Menu_C_SetTextsFunction::CallFunc_Left_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTextsFunction, CallFunc_Conv_StringToText_ReturnValue_5) == 0x000108, "Member 'WBP_Menu_C_SetTextsFunction::CallFunc_Conv_StringToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTextsFunction, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000120, "Member 'WBP_Menu_C_SetTextsFunction::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTextsFunction, CallFunc_GetSourceFilePath_ReturnValue) == 0x000128, "Member 'WBP_Menu_C_SetTextsFunction::CallFunc_GetSourceFilePath_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTextsFunction, CallFunc_Conv_StringToText_ReturnValue_6) == 0x000138, "Member 'WBP_Menu_C_SetTextsFunction::CallFunc_Conv_StringToText_ReturnValue_6' has a wrong offset!");

// Function WBP_Menu.WBP_Menu_C.SetTableNamesFunction
// 0x0068 (0x0068 - 0x0000)
struct WBP_Menu_C_SetTableNamesFunction final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDebugMenuMasterData*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_EntryItemTableName_C*              CallFunc_SpawnObject_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetTableList_ReturnValue;                 // 0x0020(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_C_SetTableNamesFunction) == 0x000008, "Wrong alignment on WBP_Menu_C_SetTableNamesFunction");
static_assert(sizeof(WBP_Menu_C_SetTableNamesFunction) == 0x000068, "Wrong size on WBP_Menu_C_SetTableNamesFunction");
static_assert(offsetof(WBP_Menu_C_SetTableNamesFunction, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Menu_C_SetTableNamesFunction::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTableNamesFunction, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Menu_C_SetTableNamesFunction::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTableNamesFunction, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Menu_C_SetTableNamesFunction::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTableNamesFunction, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000010, "Member 'WBP_Menu_C_SetTableNamesFunction::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTableNamesFunction, CallFunc_SpawnObject_ReturnValue) == 0x000018, "Member 'WBP_Menu_C_SetTableNamesFunction::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTableNamesFunction, CallFunc_GetTableList_ReturnValue) == 0x000020, "Member 'WBP_Menu_C_SetTableNamesFunction::CallFunc_GetTableList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTableNamesFunction, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_Menu_C_SetTableNamesFunction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTableNamesFunction, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_Menu_C_SetTableNamesFunction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTableNamesFunction, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'WBP_Menu_C_SetTableNamesFunction::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetTableNamesFunction, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'WBP_Menu_C_SetTableNamesFunction::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu.WBP_Menu_C.Get Selected Index
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_C_Get_Selected_Index final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_C_Get_Selected_Index) == 0x000008, "Wrong alignment on WBP_Menu_C_Get_Selected_Index");
static_assert(sizeof(WBP_Menu_C_Get_Selected_Index) == 0x000018, "Wrong size on WBP_Menu_C_Get_Selected_Index");
static_assert(offsetof(WBP_Menu_C_Get_Selected_Index, Index_0) == 0x000000, "Member 'WBP_Menu_C_Get_Selected_Index::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_Get_Selected_Index, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000008, "Member 'WBP_Menu_C_Get_Selected_Index::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_Get_Selected_Index, CallFunc_GetIndexForItem_ReturnValue) == 0x000010, "Member 'WBP_Menu_C_Get_Selected_Index::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");

// Function WBP_Menu.WBP_Menu_C.ToTableNameString
// 0x0038 (0x0038 - 0x0000)
struct WBP_Menu_C_ToTableNameString final
{
public:
	class UObject*                                EntryItem;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 TableName;                                         // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UWBP_EntryItemTableName_C*              K2Node_DynamicCast_AsWBP_Entry_Item_Table_Name;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_C_ToTableNameString) == 0x000008, "Wrong alignment on WBP_Menu_C_ToTableNameString");
static_assert(sizeof(WBP_Menu_C_ToTableNameString) == 0x000038, "Wrong size on WBP_Menu_C_ToTableNameString");
static_assert(offsetof(WBP_Menu_C_ToTableNameString, EntryItem) == 0x000000, "Member 'WBP_Menu_C_ToTableNameString::EntryItem' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ToTableNameString, TableName) == 0x000008, "Member 'WBP_Menu_C_ToTableNameString::TableName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ToTableNameString, K2Node_DynamicCast_AsWBP_Entry_Item_Table_Name) == 0x000018, "Member 'WBP_Menu_C_ToTableNameString::K2Node_DynamicCast_AsWBP_Entry_Item_Table_Name' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ToTableNameString, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_Menu_C_ToTableNameString::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_ToTableNameString, CallFunc_Conv_TextToString_ReturnValue) == 0x000028, "Member 'WBP_Menu_C_ToTableNameString::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function WBP_Menu.WBP_Menu_C.SetAllJson
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_C_SetAllJson final
{
public:
	class FString                                 TableName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UDebugMenuMasterData*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetAllJson_ReturnValue;                   // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
};
static_assert(alignof(WBP_Menu_C_SetAllJson) == 0x000008, "Wrong alignment on WBP_Menu_C_SetAllJson");
static_assert(sizeof(WBP_Menu_C_SetAllJson) == 0x000040, "Wrong size on WBP_Menu_C_SetAllJson");
static_assert(offsetof(WBP_Menu_C_SetAllJson, TableName) == 0x000000, "Member 'WBP_Menu_C_SetAllJson::TableName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetAllJson, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000010, "Member 'WBP_Menu_C_SetAllJson::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetAllJson, CallFunc_GetAllJson_ReturnValue) == 0x000018, "Member 'WBP_Menu_C_SetAllJson::CallFunc_GetAllJson_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_C_SetAllJson, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'WBP_Menu_C_SetAllJson::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

