#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NetworkWaitng

#include "Basic.hpp"

#include "GameModule_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NetworkWaitng.WBP_NetworkWaitng_C
// 0x0020 (0x03A8 - 0x0388)
class UWBP_NetworkWaitng_C final : public UWaitNetworkMessage
{
public:
	class UCircularThrobber*                      CircularThrobber_0;                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_83;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LoadIcon;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LoadiconBG;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NetworkWaitng_C">();
	}
	static class UWBP_NetworkWaitng_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NetworkWaitng_C>();
	}
};
static_assert(alignof(UWBP_NetworkWaitng_C) == 0x000008, "Wrong alignment on UWBP_NetworkWaitng_C");
static_assert(sizeof(UWBP_NetworkWaitng_C) == 0x0003A8, "Wrong size on UWBP_NetworkWaitng_C");
static_assert(offsetof(UWBP_NetworkWaitng_C, CircularThrobber_0) == 0x000388, "Member 'UWBP_NetworkWaitng_C::CircularThrobber_0' has a wrong offset!");
static_assert(offsetof(UWBP_NetworkWaitng_C, Image_83) == 0x000390, "Member 'UWBP_NetworkWaitng_C::Image_83' has a wrong offset!");
static_assert(offsetof(UWBP_NetworkWaitng_C, LoadIcon) == 0x000398, "Member 'UWBP_NetworkWaitng_C::LoadIcon' has a wrong offset!");
static_assert(offsetof(UWBP_NetworkWaitng_C, LoadiconBG) == 0x0003A0, "Member 'UWBP_NetworkWaitng_C::LoadiconBG' has a wrong offset!");

}

