#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VersionWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OutGameModule_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_VersionWindow.WBP_VersionWindow_C
// 0x0048 (0x03D8 - 0x0390)
class UWBP_VersionWindow_C final : public UVersionWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 HeadingBase;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeadingBase_1;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeadingBase_2;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeadingBase_3;                                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_VersionWindow(int32 EntryPoint);
	void OnClose();
	void SetText(class UTextBlock* TextObject, const class FText& Message);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_VersionWindow_C">();
	}
	static class UWBP_VersionWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_VersionWindow_C>();
	}
};
static_assert(alignof(UWBP_VersionWindow_C) == 0x000008, "Wrong alignment on UWBP_VersionWindow_C");
static_assert(sizeof(UWBP_VersionWindow_C) == 0x0003D8, "Wrong size on UWBP_VersionWindow_C");
static_assert(offsetof(UWBP_VersionWindow_C, UberGraphFrame) == 0x000390, "Member 'UWBP_VersionWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_VersionWindow_C, HeadingBase) == 0x000398, "Member 'UWBP_VersionWindow_C::HeadingBase' has a wrong offset!");
static_assert(offsetof(UWBP_VersionWindow_C, HeadingBase_1) == 0x0003A0, "Member 'UWBP_VersionWindow_C::HeadingBase_1' has a wrong offset!");
static_assert(offsetof(UWBP_VersionWindow_C, HeadingBase_2) == 0x0003A8, "Member 'UWBP_VersionWindow_C::HeadingBase_2' has a wrong offset!");
static_assert(offsetof(UWBP_VersionWindow_C, HeadingBase_3) == 0x0003B0, "Member 'UWBP_VersionWindow_C::HeadingBase_3' has a wrong offset!");
static_assert(offsetof(UWBP_VersionWindow_C, Image) == 0x0003B8, "Member 'UWBP_VersionWindow_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_VersionWindow_C, Image_1) == 0x0003C0, "Member 'UWBP_VersionWindow_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_VersionWindow_C, Image_2) == 0x0003C8, "Member 'UWBP_VersionWindow_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_VersionWindow_C, Image_3) == 0x0003D0, "Member 'UWBP_VersionWindow_C::Image_3' has a wrong offset!");

}

