#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Consent

#include "Basic.hpp"

#include "OutGameModule_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Consent.WBP_Consent_C
// 0x0018 (0x0490 - 0x0478)
class UWBP_Consent_C final : public UConsentWidget
{
public:
	class UImage*                                 Image_Base01;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Base03;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Text_bg;                                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Consent_C">();
	}
	static class UWBP_Consent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Consent_C>();
	}
};
static_assert(alignof(UWBP_Consent_C) == 0x000008, "Wrong alignment on UWBP_Consent_C");
static_assert(sizeof(UWBP_Consent_C) == 0x000490, "Wrong size on UWBP_Consent_C");
static_assert(offsetof(UWBP_Consent_C, Image_Base01) == 0x000478, "Member 'UWBP_Consent_C::Image_Base01' has a wrong offset!");
static_assert(offsetof(UWBP_Consent_C, Image_Base03) == 0x000480, "Member 'UWBP_Consent_C::Image_Base03' has a wrong offset!");
static_assert(offsetof(UWBP_Consent_C, Text_bg) == 0x000488, "Member 'UWBP_Consent_C::Text_bg' has a wrong offset!");

}

