#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ChatSendButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "UIFramework_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ChatSendButton.WBP_ChatSendButton_C
// 0x0070 (0x04F8 - 0x0488)
class UWBP_ChatSendButton_C final : public UWidgetButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 _buttonImage;                                      // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlatformRichTextBlock*                 _iconButtonGuide;                                  // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_61;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_126;                                         // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FocusAnimationListItem_C*          WBP_FocusAnimationListItem;                        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             ButtonIconImage;                                   // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsVisibilityButtonGuide;                           // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Raw_Game_Pad_Key;                                  // 0x04C8(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FKey                                   Raw_Keyboard_Key;                                  // 0x04E0(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ChatSendButton(int32 EntryPoint);
	void OnInitialized();
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ChatSendButton_C">();
	}
	static class UWBP_ChatSendButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ChatSendButton_C>();
	}
};
static_assert(alignof(UWBP_ChatSendButton_C) == 0x000008, "Wrong alignment on UWBP_ChatSendButton_C");
static_assert(sizeof(UWBP_ChatSendButton_C) == 0x0004F8, "Wrong size on UWBP_ChatSendButton_C");
static_assert(offsetof(UWBP_ChatSendButton_C, UberGraphFrame) == 0x000488, "Member 'UWBP_ChatSendButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ChatSendButton_C, _buttonImage) == 0x000490, "Member 'UWBP_ChatSendButton_C::_buttonImage' has a wrong offset!");
static_assert(offsetof(UWBP_ChatSendButton_C, _iconButtonGuide) == 0x000498, "Member 'UWBP_ChatSendButton_C::_iconButtonGuide' has a wrong offset!");
static_assert(offsetof(UWBP_ChatSendButton_C, Image_61) == 0x0004A0, "Member 'UWBP_ChatSendButton_C::Image_61' has a wrong offset!");
static_assert(offsetof(UWBP_ChatSendButton_C, Image_126) == 0x0004A8, "Member 'UWBP_ChatSendButton_C::Image_126' has a wrong offset!");
static_assert(offsetof(UWBP_ChatSendButton_C, WBP_FocusAnimationListItem) == 0x0004B0, "Member 'UWBP_ChatSendButton_C::WBP_FocusAnimationListItem' has a wrong offset!");
static_assert(offsetof(UWBP_ChatSendButton_C, ButtonIconImage) == 0x0004B8, "Member 'UWBP_ChatSendButton_C::ButtonIconImage' has a wrong offset!");
static_assert(offsetof(UWBP_ChatSendButton_C, IsVisibilityButtonGuide) == 0x0004C0, "Member 'UWBP_ChatSendButton_C::IsVisibilityButtonGuide' has a wrong offset!");
static_assert(offsetof(UWBP_ChatSendButton_C, Raw_Game_Pad_Key) == 0x0004C8, "Member 'UWBP_ChatSendButton_C::Raw_Game_Pad_Key' has a wrong offset!");
static_assert(offsetof(UWBP_ChatSendButton_C, Raw_Keyboard_Key) == 0x0004E0, "Member 'UWBP_ChatSendButton_C::Raw_Keyboard_Key' has a wrong offset!");

}

