#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TextChatList

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_TextChatList.WBP_TextChatList_C.ExecuteUbergraph_WBP_TextChatList
// 0x0088 (0x0088 - 0x0000)
struct WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_playerId;                       // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_displayName;                    // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_message;                        // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bBlock;                         // 0x0038(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextChatSubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextChatListObject*                    CallFunc_SpawnObject_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRecieveBlockMessage_ReturnValue;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBackendSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextChatSubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBackendSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& PlayerId, const class FString& DisplayName, const class FString& Message, bool bBlock)> K2Node_CreateDelegate_OutputDelegate;              // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList) == 0x000008, "Wrong alignment on WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList");
static_assert(sizeof(WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList) == 0x000088, "Wrong size on WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList");
static_assert(offsetof(WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList, EntryPoint) == 0x000000, "Member 'WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList, K2Node_CustomEvent_playerId) == 0x000008, "Member 'WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList::K2Node_CustomEvent_playerId' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList, K2Node_CustomEvent_displayName) == 0x000018, "Member 'WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList::K2Node_CustomEvent_displayName' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList, K2Node_CustomEvent_message) == 0x000028, "Member 'WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList::K2Node_CustomEvent_message' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList, K2Node_CustomEvent_bBlock) == 0x000038, "Member 'WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList::K2Node_CustomEvent_bBlock' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000040, "Member 'WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList, CallFunc_SpawnObject_ReturnValue) == 0x000048, "Member 'WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList, CallFunc_IsRecieveBlockMessage_ReturnValue) == 0x000050, "Member 'WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList::CallFunc_IsRecieveBlockMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000058, "Member 'WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000060, "Member 'WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000068, "Member 'WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList, K2Node_Event_IsDesignTime) == 0x000070, "Member 'WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList, K2Node_CreateDelegate_OutputDelegate) == 0x000074, "Member 'WBP_TextChatList_C_ExecuteUbergraph_WBP_TextChatList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_TextChatList.WBP_TextChatList_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TextChatList_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_TextChatList_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_TextChatList_C_PreConstruct");
static_assert(sizeof(WBP_TextChatList_C_PreConstruct) == 0x000001, "Wrong size on WBP_TextChatList_C_PreConstruct");
static_assert(offsetof(WBP_TextChatList_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_TextChatList_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_TextChatList.WBP_TextChatList_C.OnTeamUpChatReceivedEventDispatcherEvent
// 0x0038 (0x0038 - 0x0000)
struct WBP_TextChatList_C_OnTeamUpChatReceivedEventDispatcherEvent final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DisplayName;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Message;                                           // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bBlock;                                            // 0x0030(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_TextChatList_C_OnTeamUpChatReceivedEventDispatcherEvent) == 0x000008, "Wrong alignment on WBP_TextChatList_C_OnTeamUpChatReceivedEventDispatcherEvent");
static_assert(sizeof(WBP_TextChatList_C_OnTeamUpChatReceivedEventDispatcherEvent) == 0x000038, "Wrong size on WBP_TextChatList_C_OnTeamUpChatReceivedEventDispatcherEvent");
static_assert(offsetof(WBP_TextChatList_C_OnTeamUpChatReceivedEventDispatcherEvent, PlayerId) == 0x000000, "Member 'WBP_TextChatList_C_OnTeamUpChatReceivedEventDispatcherEvent::PlayerId' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_OnTeamUpChatReceivedEventDispatcherEvent, DisplayName) == 0x000010, "Member 'WBP_TextChatList_C_OnTeamUpChatReceivedEventDispatcherEvent::DisplayName' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_OnTeamUpChatReceivedEventDispatcherEvent, Message) == 0x000020, "Member 'WBP_TextChatList_C_OnTeamUpChatReceivedEventDispatcherEvent::Message' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_OnTeamUpChatReceivedEventDispatcherEvent, bBlock) == 0x000030, "Member 'WBP_TextChatList_C_OnTeamUpChatReceivedEventDispatcherEvent::bBlock' has a wrong offset!");

// Function WBP_TextChatList.WBP_TextChatList_C.AddItem
// 0x0008 (0x0008 - 0x0000)
struct WBP_TextChatList_C_AddItem final
{
public:
	class UTextChatListObject*                    NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TextChatList_C_AddItem) == 0x000008, "Wrong alignment on WBP_TextChatList_C_AddItem");
static_assert(sizeof(WBP_TextChatList_C_AddItem) == 0x000008, "Wrong size on WBP_TextChatList_C_AddItem");
static_assert(offsetof(WBP_TextChatList_C_AddItem, NewParam) == 0x000000, "Member 'WBP_TextChatList_C_AddItem::NewParam' has a wrong offset!");

// Function WBP_TextChatList.WBP_TextChatList_C.UpdateArray
// 0x0030 (0x0030 - 0x0000)
struct WBP_TextChatList_C_UpdateArray final
{
public:
	class UTextChatListObject*                    NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ChatMax;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextChatSubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextChatSubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_TextChatList_C_UpdateArray) == 0x000008, "Wrong alignment on WBP_TextChatList_C_UpdateArray");
static_assert(sizeof(WBP_TextChatList_C_UpdateArray) == 0x000030, "Wrong size on WBP_TextChatList_C_UpdateArray");
static_assert(offsetof(WBP_TextChatList_C_UpdateArray, NewParam) == 0x000000, "Member 'WBP_TextChatList_C_UpdateArray::NewParam' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_UpdateArray, ChatMax) == 0x000008, "Member 'WBP_TextChatList_C_UpdateArray::ChatMax' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_UpdateArray, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_TextChatList_C_UpdateArray::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_UpdateArray, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000018, "Member 'WBP_TextChatList_C_UpdateArray::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_UpdateArray, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_TextChatList_C_UpdateArray::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_UpdateArray, CallFunc_Array_Add_ReturnValue) == 0x000024, "Member 'WBP_TextChatList_C_UpdateArray::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_UpdateArray, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'WBP_TextChatList_C_UpdateArray::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_TextChatList.WBP_TextChatList_C.test
// 0x0008 (0x0008 - 0x0000)
struct WBP_TextChatList_C_Test final
{
public:
	class UTextChatListObject*                    CallFunc_SpawnObject_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TextChatList_C_Test) == 0x000008, "Wrong alignment on WBP_TextChatList_C_Test");
static_assert(sizeof(WBP_TextChatList_C_Test) == 0x000008, "Wrong size on WBP_TextChatList_C_Test");
static_assert(offsetof(WBP_TextChatList_C_Test, CallFunc_SpawnObject_ReturnValue) == 0x000000, "Member 'WBP_TextChatList_C_Test::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function WBP_TextChatList.WBP_TextChatList_C.SetUpUnreadMessage
// 0x0018 (0x0018 - 0x0000)
struct WBP_TextChatList_C_SetUpUnreadMessage final
{
public:
	class UTextChatListObject*                    NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextChatSubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIngameWindowOpenFlag_ReturnValue;      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_TextChatList_C_SetUpUnreadMessage) == 0x000008, "Wrong alignment on WBP_TextChatList_C_SetUpUnreadMessage");
static_assert(sizeof(WBP_TextChatList_C_SetUpUnreadMessage) == 0x000018, "Wrong size on WBP_TextChatList_C_SetUpUnreadMessage");
static_assert(offsetof(WBP_TextChatList_C_SetUpUnreadMessage, NewParam) == 0x000000, "Member 'WBP_TextChatList_C_SetUpUnreadMessage::NewParam' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_SetUpUnreadMessage, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_TextChatList_C_SetUpUnreadMessage::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_SetUpUnreadMessage, CallFunc_Array_Add_ReturnValue) == 0x000010, "Member 'WBP_TextChatList_C_SetUpUnreadMessage::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_SetUpUnreadMessage, CallFunc_GetIngameWindowOpenFlag_ReturnValue) == 0x000014, "Member 'WBP_TextChatList_C_SetUpUnreadMessage::CallFunc_GetIngameWindowOpenFlag_ReturnValue' has a wrong offset!");

// Function WBP_TextChatList.WBP_TextChatList_C.UpdateUnreadMessage
// 0x0020 (0x0020 - 0x0000)
struct WBP_TextChatList_C_UpdateUnreadMessage final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextChatSubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_TextChatList_C_UpdateUnreadMessage) == 0x000008, "Wrong alignment on WBP_TextChatList_C_UpdateUnreadMessage");
static_assert(sizeof(WBP_TextChatList_C_UpdateUnreadMessage) == 0x000020, "Wrong size on WBP_TextChatList_C_UpdateUnreadMessage");
static_assert(offsetof(WBP_TextChatList_C_UpdateUnreadMessage, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_TextChatList_C_UpdateUnreadMessage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_UpdateUnreadMessage, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_TextChatList_C_UpdateUnreadMessage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_UpdateUnreadMessage, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_TextChatList_C_UpdateUnreadMessage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_UpdateUnreadMessage, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_TextChatList_C_UpdateUnreadMessage::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_UpdateUnreadMessage, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_TextChatList_C_UpdateUnreadMessage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextChatList_C_UpdateUnreadMessage, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_TextChatList_C_UpdateUnreadMessage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

