#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VersionWindow

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_VersionWindow.WBP_VersionWindow_C.ExecuteUbergraph_WBP_VersionWindow
// 0x0004 (0x0004 - 0x0000)
struct WBP_VersionWindow_C_ExecuteUbergraph_WBP_VersionWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VersionWindow_C_ExecuteUbergraph_WBP_VersionWindow) == 0x000004, "Wrong alignment on WBP_VersionWindow_C_ExecuteUbergraph_WBP_VersionWindow");
static_assert(sizeof(WBP_VersionWindow_C_ExecuteUbergraph_WBP_VersionWindow) == 0x000004, "Wrong size on WBP_VersionWindow_C_ExecuteUbergraph_WBP_VersionWindow");
static_assert(offsetof(WBP_VersionWindow_C_ExecuteUbergraph_WBP_VersionWindow, EntryPoint) == 0x000000, "Member 'WBP_VersionWindow_C_ExecuteUbergraph_WBP_VersionWindow::EntryPoint' has a wrong offset!");

// Function WBP_VersionWindow.WBP_VersionWindow_C.SetText
// 0x0028 (0x0028 - 0x0000)
struct WBP_VersionWindow_C_SetText final
{
public:
	class UTextBlock*                             TextObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Message;                                           // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_VersionWindow_C_SetText) == 0x000008, "Wrong alignment on WBP_VersionWindow_C_SetText");
static_assert(sizeof(WBP_VersionWindow_C_SetText) == 0x000028, "Wrong size on WBP_VersionWindow_C_SetText");
static_assert(offsetof(WBP_VersionWindow_C_SetText, TextObject) == 0x000000, "Member 'WBP_VersionWindow_C_SetText::TextObject' has a wrong offset!");
static_assert(offsetof(WBP_VersionWindow_C_SetText, Message) == 0x000008, "Member 'WBP_VersionWindow_C_SetText::Message' has a wrong offset!");
static_assert(offsetof(WBP_VersionWindow_C_SetText, CallFunc_TextIsEmpty_ReturnValue) == 0x000020, "Member 'WBP_VersionWindow_C_SetText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

}

