#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Title

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OutGameModule_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UIFramework_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Title.WBP_Title_C
// 0x0058 (0x0518 - 0x04C0)
class UWBP_Title_C final : public UTitleWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_in_en;                                         // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Exit;                                          // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_fadein;                                        // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_in;                                            // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 TitleBgImage;                                      // 0x04E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AdjustText_C*                      WBP_AdjustText;                                    // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AdjustText_C*                      WBP_AdjustText_1;                                  // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   NewLocalVar_0;                                     // 0x0500(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	class UWidget* DoCustomNavigation_0(EUINavigation Navigation_0);
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnMouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Construct();
	void OnLevelHiddenTitleMenu();
	void OnTitleStepInput();
	void BndEvt__WBP_Title__menuButton_K2Node_ComponentBoundEvent_0_OnInputEventDelegate__DelegateSignature(class UAppWidget* Widget, EWidgetInputType InputType);
	void ExecuteUbergraph_WBP_Title(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Title_C">();
	}
	static class UWBP_Title_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Title_C>();
	}
};
static_assert(alignof(UWBP_Title_C) == 0x000008, "Wrong alignment on UWBP_Title_C");
static_assert(sizeof(UWBP_Title_C) == 0x000518, "Wrong size on UWBP_Title_C");
static_assert(offsetof(UWBP_Title_C, UberGraphFrame) == 0x0004C0, "Member 'UWBP_Title_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, Ani_in_en) == 0x0004C8, "Member 'UWBP_Title_C::Ani_in_en' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, Ani_Exit) == 0x0004D0, "Member 'UWBP_Title_C::Ani_Exit' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, Ani_fadein) == 0x0004D8, "Member 'UWBP_Title_C::Ani_fadein' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, Ani_in) == 0x0004E0, "Member 'UWBP_Title_C::Ani_in' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, TitleBgImage) == 0x0004E8, "Member 'UWBP_Title_C::TitleBgImage' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, WBP_AdjustText) == 0x0004F0, "Member 'UWBP_Title_C::WBP_AdjustText' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, WBP_AdjustText_1) == 0x0004F8, "Member 'UWBP_Title_C::WBP_AdjustText_1' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, NewLocalVar_0) == 0x000500, "Member 'UWBP_Title_C::NewLocalVar_0' has a wrong offset!");

}

