#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SafeGeneralWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameModule_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SafeGeneralWindow.WBP_SafeGeneralWindow_C
// 0x0030 (0x05C8 - 0x0598)
class UWBP_SafeGeneralWindow_C final : public UWidgetSafeGeneralWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0598(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_out;                                           // 0x05A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Idle;                                          // 0x05A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_in;                                            // 0x05B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BlockBG;                                           // 0x05B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Black;                                       // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_SafeGeneralWindow(int32 EntryPoint);
	void OnClose();
	void OnOpen();
	struct FEventReply On_BlockBG_MouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SafeGeneralWindow_C">();
	}
	static class UWBP_SafeGeneralWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SafeGeneralWindow_C>();
	}
};
static_assert(alignof(UWBP_SafeGeneralWindow_C) == 0x000008, "Wrong alignment on UWBP_SafeGeneralWindow_C");
static_assert(sizeof(UWBP_SafeGeneralWindow_C) == 0x0005C8, "Wrong size on UWBP_SafeGeneralWindow_C");
static_assert(offsetof(UWBP_SafeGeneralWindow_C, UberGraphFrame) == 0x000598, "Member 'UWBP_SafeGeneralWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SafeGeneralWindow_C, Ani_out) == 0x0005A0, "Member 'UWBP_SafeGeneralWindow_C::Ani_out' has a wrong offset!");
static_assert(offsetof(UWBP_SafeGeneralWindow_C, Ani_Idle) == 0x0005A8, "Member 'UWBP_SafeGeneralWindow_C::Ani_Idle' has a wrong offset!");
static_assert(offsetof(UWBP_SafeGeneralWindow_C, Ani_in) == 0x0005B0, "Member 'UWBP_SafeGeneralWindow_C::Ani_in' has a wrong offset!");
static_assert(offsetof(UWBP_SafeGeneralWindow_C, BlockBG) == 0x0005B8, "Member 'UWBP_SafeGeneralWindow_C::BlockBG' has a wrong offset!");
static_assert(offsetof(UWBP_SafeGeneralWindow_C, Image_Black) == 0x0005C0, "Member 'UWBP_SafeGeneralWindow_C::Image_Black' has a wrong offset!");

}

