#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VoiceChatMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"
#include "VoiceChatModule_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_VoiceChatMenu.WBP_VoiceChatMenu_C
// 0x0198 (0x0410 - 0x0278)
class UWBP_VoiceChatMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                ButtonBlock;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonClose;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonDisconnect;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonJoin;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonLogin;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonMute;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonUnBlock;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonUnMute;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              CheckBoxMicMute;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              CheckBoxSpeakerMute;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        ComboBoxMicDevice;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        ComboBoxMode;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        ComboBoxSpeakerDevice;                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextChanelName;                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextName;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageMenuBg;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListView*                              ListChatMembers;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListView*                              ListMemberVolumes;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListView*                              ListMuteMembers;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListView*                              ListTalkingMembers;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpinBox*                               SpinBoxMicVolume;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpinBox*                               SpinBoxPlayerVolume;                               // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpinBox*                               SpinBoxSpeakerVolume;                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlockPlayerMuteStatus;                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlockPlayerVolume;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextStatus;                                        // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            In_Color_and_Opacity_Black;                        // 0x0358(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FSlateColor                            In_Color_and_Opacity_Red;                          // 0x0380(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	class UWBP_VoiceChatMenu_C*                   Widget;                                            // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Text_Status;                                       // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 StatusText;                                        // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 PlayerName;                                        // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 ChannelName;                                       // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         MicVolume;                                         // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpeakerVolume;                                     // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableControl;                                     // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_EntryItemMemberName_C*             As_WBP_Entry_Item_Member_Name;                     // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UWBP_EntryItemMemberName_C*             As_WBP_Entry_Item_Member_Name_0;                   // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UWBP_EntryItemMemberName_C*             As_WBP_Entry_Item_Member_Name_1;                   // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_VoiceChatMenu(int32 EntryPoint);
	void BndEvt__WBP_VoiceChatMenu_SpinBoxPlayerVolume_K2Node_ComponentBoundEvent_14_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BndEvt__WBP_VoiceChatMenu_ButtonUnMute_K2Node_ComponentBoundEvent_13_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_VoiceChatMenu_ListChatMembers_K2Node_ComponentBoundEvent_12_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void BndEvt__WBP_VoiceChatMenu_ButtonUnBlock_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_VoiceChatMenu_ButtonMute_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_VoiceChatMenu_ButtonBlock_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void _____n_K__(const class FString& PlayerName_0, EVoiceChatPlayerStatus Status, float Value);
	void BndEvt__ButtonClose_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_VoiceChatMenu_ButtonLeave_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_VoiceChatMenu_SpinBoxSpeakerVolume_K2Node_ComponentBoundEvent_6_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BndEvt__WBP_VoiceChatMenu_SpinBoxMicVolume_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BndEvt__WBP_VoiceChatMenu_EditableTextChanelName_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__WBP_VoiceChatMenu_CheckBoxMicMute_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__WBP_VoiceChatMenu_ButtonJoin_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_VoiceChatMenu_ComboBoxMode_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__WBP_VoiceChatMenu_ComboBoxMicDevice_K2Node_ComponentBoundEvent_48_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__WBP_VoiceChatMenu_ComboBoxSpeakerDevice_K2Node_ComponentBoundEvent_47_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__WBP_VoiceChatMenu_CheckBoxMute_K2Node_ComponentBoundEvent_45_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void OnInitialized();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__ButtonStart_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void PadTableSelect();
	void PadClose();
	void PadReDownload();
	void PadReCopy();
	void PadDeInitialize();
	void PadTableListDown();
	void PadTableListUp();
	void PadInitialize();
	void SetSelectedMode();
	void UpdateMemberList();
	void Get_Selected_Member(class FString* MemberName);
	void Update_Talking_Member_List();
	void Update_Muted_Member_List();
	void Update_Member_Volume_List();
	void Clear_All_Lists();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_VoiceChatMenu_C">();
	}
	static class UWBP_VoiceChatMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_VoiceChatMenu_C>();
	}
};
static_assert(alignof(UWBP_VoiceChatMenu_C) == 0x000008, "Wrong alignment on UWBP_VoiceChatMenu_C");
static_assert(sizeof(UWBP_VoiceChatMenu_C) == 0x000410, "Wrong size on UWBP_VoiceChatMenu_C");
static_assert(offsetof(UWBP_VoiceChatMenu_C, UberGraphFrame) == 0x000278, "Member 'UWBP_VoiceChatMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, ButtonBlock) == 0x000280, "Member 'UWBP_VoiceChatMenu_C::ButtonBlock' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, ButtonClose) == 0x000288, "Member 'UWBP_VoiceChatMenu_C::ButtonClose' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, ButtonDisconnect) == 0x000290, "Member 'UWBP_VoiceChatMenu_C::ButtonDisconnect' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, ButtonJoin) == 0x000298, "Member 'UWBP_VoiceChatMenu_C::ButtonJoin' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, ButtonLogin) == 0x0002A0, "Member 'UWBP_VoiceChatMenu_C::ButtonLogin' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, ButtonMute) == 0x0002A8, "Member 'UWBP_VoiceChatMenu_C::ButtonMute' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, ButtonUnBlock) == 0x0002B0, "Member 'UWBP_VoiceChatMenu_C::ButtonUnBlock' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, ButtonUnMute) == 0x0002B8, "Member 'UWBP_VoiceChatMenu_C::ButtonUnMute' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, CanvasPanel_0) == 0x0002C0, "Member 'UWBP_VoiceChatMenu_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, CheckBoxMicMute) == 0x0002C8, "Member 'UWBP_VoiceChatMenu_C::CheckBoxMicMute' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, CheckBoxSpeakerMute) == 0x0002D0, "Member 'UWBP_VoiceChatMenu_C::CheckBoxSpeakerMute' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, ComboBoxMicDevice) == 0x0002D8, "Member 'UWBP_VoiceChatMenu_C::ComboBoxMicDevice' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, ComboBoxMode) == 0x0002E0, "Member 'UWBP_VoiceChatMenu_C::ComboBoxMode' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, ComboBoxSpeakerDevice) == 0x0002E8, "Member 'UWBP_VoiceChatMenu_C::ComboBoxSpeakerDevice' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, EditableTextChanelName) == 0x0002F0, "Member 'UWBP_VoiceChatMenu_C::EditableTextChanelName' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, EditableTextName) == 0x0002F8, "Member 'UWBP_VoiceChatMenu_C::EditableTextName' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, ImageMenuBg) == 0x000300, "Member 'UWBP_VoiceChatMenu_C::ImageMenuBg' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, ListChatMembers) == 0x000308, "Member 'UWBP_VoiceChatMenu_C::ListChatMembers' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, ListMemberVolumes) == 0x000310, "Member 'UWBP_VoiceChatMenu_C::ListMemberVolumes' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, ListMuteMembers) == 0x000318, "Member 'UWBP_VoiceChatMenu_C::ListMuteMembers' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, ListTalkingMembers) == 0x000320, "Member 'UWBP_VoiceChatMenu_C::ListTalkingMembers' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, SpinBoxMicVolume) == 0x000328, "Member 'UWBP_VoiceChatMenu_C::SpinBoxMicVolume' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, SpinBoxPlayerVolume) == 0x000330, "Member 'UWBP_VoiceChatMenu_C::SpinBoxPlayerVolume' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, SpinBoxSpeakerVolume) == 0x000338, "Member 'UWBP_VoiceChatMenu_C::SpinBoxSpeakerVolume' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, TextBlockPlayerMuteStatus) == 0x000340, "Member 'UWBP_VoiceChatMenu_C::TextBlockPlayerMuteStatus' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, TextBlockPlayerVolume) == 0x000348, "Member 'UWBP_VoiceChatMenu_C::TextBlockPlayerVolume' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, TextStatus) == 0x000350, "Member 'UWBP_VoiceChatMenu_C::TextStatus' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, In_Color_and_Opacity_Black) == 0x000358, "Member 'UWBP_VoiceChatMenu_C::In_Color_and_Opacity_Black' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, In_Color_and_Opacity_Red) == 0x000380, "Member 'UWBP_VoiceChatMenu_C::In_Color_and_Opacity_Red' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, Widget) == 0x0003A8, "Member 'UWBP_VoiceChatMenu_C::Widget' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, Text_Status) == 0x0003B0, "Member 'UWBP_VoiceChatMenu_C::Text_Status' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, StatusText) == 0x0003B8, "Member 'UWBP_VoiceChatMenu_C::StatusText' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, PlayerName) == 0x0003C8, "Member 'UWBP_VoiceChatMenu_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, ChannelName) == 0x0003D8, "Member 'UWBP_VoiceChatMenu_C::ChannelName' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, MicVolume) == 0x0003E8, "Member 'UWBP_VoiceChatMenu_C::MicVolume' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, SpeakerVolume) == 0x0003EC, "Member 'UWBP_VoiceChatMenu_C::SpeakerVolume' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, EnableControl) == 0x0003F0, "Member 'UWBP_VoiceChatMenu_C::EnableControl' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, As_WBP_Entry_Item_Member_Name) == 0x0003F8, "Member 'UWBP_VoiceChatMenu_C::As_WBP_Entry_Item_Member_Name' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, As_WBP_Entry_Item_Member_Name_0) == 0x000400, "Member 'UWBP_VoiceChatMenu_C::As_WBP_Entry_Item_Member_Name_0' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceChatMenu_C, As_WBP_Entry_Item_Member_Name_1) == 0x000408, "Member 'UWBP_VoiceChatMenu_C::As_WBP_Entry_Item_Member_Name_1' has a wrong offset!");

}

